[
    {
        "Title": "Jordan Peterson says he’s left Canada and moved to the U.S.",
        "Date": "Posted December 13, 2024 1:38 pm",
        "Text": "Jordan Peterson, the polarizing Canadian psychologist, has bid Canada adieu and will now call the United States home, citing personal and professional reasons for the move.The news was revealed on a podcast this week, where Peterson and his daughter, Mikhaila Peterson Fuller, discussed his decision to move to Florida.“Welcome to moving to America, formally,” she offhandedly said to her dad during The Mikhaila Peterson Podcast episode.“I guess that’s what happened, isn’t it? Is this the big announcement?” said Peterson.“There are decided advantages to being here,” he said.  View this post on InstagramA post shared by Mikhaila Fuller (@mikhailapeterson)  Story continues below advertisement Peterson made reference to his ongoing feud with the College of Psychologists of Ontario, as well as a bill targeting hate speech, among his key reasons to leave his home country. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“The issue with the College of Psychologists is very annoying, to say the least, and the new legislation that the Liberals are attempting to push through, Bill C-63, we’d all be living in a totalitarian hellhole if it passes,” he told his daughter.“The tax situation is out of hand. The government in Canada at the federal level is incompetent beyond belief, and it’s become uncomfortable for me in my neighbourhood in Toronto,” he added. 9:31Toronto professor refuses to use genderless pronounsPeterson, an author and former University of Toronto professor, has not had an active clinical practice since 2017 but remains a member of the College of Psychologists of Ontario.  Story continues below advertisement In 2022, the professional body reviewed Peterson’s social media conduct after hearing concerns about whether his posts met its standards. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegIt determined that online comments appeared degrading, demeaning and unprofessional — and that this posed a risk to the public.It ordered that he enter a remedial coaching program to reflect on his approach to public statements and warned he could be accused of professional misconduct if he did not comply. Peterson took issue with the direction and launched a legal campaign to try to get out of it.In August of this year, the Ontario Superior Court of Justice dismissed Peterson’s application for judicial review, and the Court of Appeal dismissed an appeal attempt. 0:46Ontario court upholds order that Jordan Peterson undergo social media trainingPeterson has long been a magnet for controversy in Canada — a public figure with a huge social media following that people appear to either fully embrace or abhor.  Story continues below advertisement He first courted controversy for refusing to use gender-neutral pronouns while teaching at the University of Toronto. He has gone on to international fame with sold-out lectures, best-selling books and a popular podcast.While he has frequently made headlines for his controversial views on feminism, gender and climate change, Peterson has insisted in the past that all the complaints at issue are political and don’t have anything to do with his past or present clients as a psychologist.— With files from The Canadian Press More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "Canada Post strike: Ontario utilities warn of penalties as millions await bills",
        "Date": "Posted December 13, 2024 8:30 am",
        "Text": "Millions of Ontarians who rely on paper billing for their utilities may find themselves in a bind as the ongoing Canada Post strike hits the one month mark.With mail delivery at a halt since Nov. 14, customers of major utility providers, including Enbridge Gas, Hydro One, Hydro Ottawa and Toronto Hydro, will face the risk of late fees and service interruptions if they fail to keep their accounts up to date.Those companies are urging customers to switch to e-billing, but there are still a significant amount of people who will be waiting for their bills in the mail, they say.Enbridge Gas, which serves approximately 3.9 million Ontario customers, revealed that 30 per cent of their customers still use paper billing. In an email to Global News, they note that there has been just a two per cent increase in online signups since the strike began.  Story continues below advertisement “We’ve provided several convenient options for customers to access their accounts, including our mobile app, online portal, and telephone banking,” a spokesperson said.The company has committed to waiving late fees “where appropriate,” but encourages customers to use its digital platforms to avoid penalties for missed payments due to the strike. \t\t\t\t'You are responsible'\t\t\tHydro One, serving over 1.5 million customers in the province, stated that almost half of their clientele still rely on paper billing. On their website, they acknowledge the disruption caused by the Canada Post strike, and suggest people to switch to paperless billing. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.For those who are unable to do so, the company has ensured to notify customers of statements by providing account balance updates through phone or its online customer portal. However, the utility made it clear that late fees may apply for unpaid balances.  Story continues below advertisement “You are responsible for keeping your account current,” said Hydro One in a statement. 2:13Business Matters: Minister seeks order to get striking Canada Post workers back on the jobToronto Hydro and Hydro Ottawa customers who are still on paper billing will also face penalties for late payments.“We want to remind customers they are responsible for keeping their accounts up to date,” said Hydro Ottawa spokesperson.Toronto Hydro, serving 710,000 residential customers, reported 300,000 people are still on paper bills.Although the company has introduced additional payment options for customers who wish to pay by cheque, such as droboxes at two Toronto locations, late fees will still apply if payments are not made on time. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobHow the Ford government in Ontario plans to escalate trade war with the U.S.Since the start of the strike, they have recorded 15,000 new registers for paperless billing.  Story continues below advertisement Hydro Ottawa shared similar sentiments, stating that they “have seen an increase in online billing requests, which demonstrates that customers are adapting to the situation,” Hydro Ottawa.For those unable to transition to digital payment methods, the utility companies suggest contacting them directly to discuss payment options or late fee waivers. \t\t\t\tOttawa asking labour board to intervene\t\t\tFriday marks day 29 of the Canada Post strike, and with Christmas fast approaching, there is still no apparent movement at the bargaining table.Federal labour minister Steve MacKinnon has rebuffed calls for government intervention, saying it’s up to the two sides to work out a deal.However, MacKinnon announced Friday he is asking the Canada Industrial Relations Board to send those employees back to work.He said if the board agrees the two sides are at an “impasse,” which he said he believes is the case, union members will be told to return to work until May, while an inquiry is launched to determine why the two sides cannot come to an agreement.  Story continues below advertisement Though MacKinnon said he believes the dispute is at an impasse, this week did see resolution on one thing: a labour practice complaint from the Canadian Union of Postal Workers over layoffs during the strike.The key issues in the strike by more than 55,000 workers include wages, job security and how to staff a proposed expansion into weekend delivery.— with files from Aaron D’Andrea and The Canadian Press More on LifestyleMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\t$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tBroadway Corridor density debateB.C. fruit growers asking for more supportRecord holiday season at YLWRetail analyst on 2024 holiday spending trends"
    },
    {
        "Title": "Trump says it’s ‘fine’ after Ford threat to cut energy to border states",
        "Date": "Posted December 12, 2024 6:11 pm",
        "Text": "U.S. president-elect Donald Trump was asked about Ontario Premier Doug Ford’s recent warning that the province could cut off energy exports to about 1.5 million Americans if Trump lays threatened tariffs on Canada next month, saying Thursday it was “fine.”On Wednesday, following a meeting between premiers and Prime Minister Justin Trudeau, Ford said he believed there was a “100 per cent” chance 25-per-cent tariffs threatened by Trump would be imposed in January on Canada. Ford countered with a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.“That’s OK if he does that, that’s fine,” Trump told a CNBC reporter on the floor of the New York Stock Exchange. “The United States is subsidizing Canada, it’s truly a subsidy and we shouldn’t have to do that.”  Story continues below advertisement Trump claimed the U.S. subsidizes Canada more than US$100 billion a year, though he did not specify where that number came from and made similar remarks in 2018.Subsidies are defined by the International Monetary Fund as “a transfer of resources from a government to a domestic entity without an equivalent contribution in return.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The IMF notes subsidies can “take many forms, including direct grants to domestic companies, tax incentives, or favorable terms for financing.”It’s not clear if Trump’s claims relate to trade deficits, which is when a country buys more than it sells to another country, or direct investment, either.The Office of the U.S. Trade Representative says that “the U.S. goods and services trade deficit with Canada was $53.5 billion in 2022.”Statistics Canada says that direct investment from Canada into the U.S. in 2023 was $1.1 trillion while U.S. direct investment in Canada was $618.2 billion.“In 2023, Canada’s exports of services to the United States increased 7.2% to $107.2 billion, while imports of services from the United States advanced 8.7% to $121.0 billion,” Statistics Canada also said last month.  3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: FordShortly after his re-election, Trump threatened to impose 25-per cent tariffs on all imported goods from Canada and Mexico if both countries do not address illegal immigration and fentanyl trafficking into the U.S.  Story continues below advertisement Since then, Ford and Canada’s premiers have held meetings with the federal government to discuss potential responses, with Trudeau sharing an “overview” Wednesday of his government’s plan to strengthen border security in response to the tariff threat.Sources outlined four potential measures from Ford that Ontario could pursue to Global News:Restricting electricity exports to Michigan, New York and Minnesota — each of which share a border with OntarioRestricting exports of Canadian critical minerals required for electric vehicle batteries and supply chainRestricting U.S.-based companies from the Government of Ontario’s procurement processRestricting the LCBO, the largest purchaser of alcohol in the world, from buying American-made alcoholSources in the Ford government describe the measure as “escalation maneuvers” that are still being fleshed out.—with files from Global News’ Colin D’Mello, Isaac Callan and Sean Boynton Related NewsHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tTrudeau shares border plan with premiers in meeting on Trump tariff response\t\t\t\t\t"
    },
    {
        "Title": "Man who faked own death arrested, charged — and his wife files for divorce",
        "Date": "Posted December 13, 2024 10:20 am",
        "Text": "The wife of a Wisconsin kayaker who faked his own drowning so he could leave her and their children and meet a woman in Eastern Europe filed court documents Thursday seeking to end their marriage.Online court records indicate Emily Borgwardt filed a petition in Dodge County Circuit Court seeking a legal separation from Ryan Borgwardt. According to the petition, the marriage is “irretrievably broken.” The document doesn’t elaborate.A woman who answered the phone at the office of Emily Borgwardt’s lawyer, Andrew Griggs, on Thursday said he would have no comment. Online court records don’t list a lawyer for Ryan Borgwardt.The separation petition states that the couple has been married for 22 years and Emily Borgwardt wants sole custody of their three teenaged children. The document adds that Emily works at a private school in Watertown. Ryan is listed as self-employed and currently residing at an “unknown address.”  Story continues below advertisement A hearing in the case has been set for April. 3:40Wisconsin dad who faked his own death, fled to Europe reveals how he did itRyan Borgwardt, 45, was reported missing on Aug. 12 after telling his wife the night before that he was kayaking on Green Lake, about 100 miles (160 kilometres) northwest of Milwaukee. His disappearance was first investigated as a possible drowning. But subsequent clues — including that he obtained a new passport three months before he disappeared — led investigators to speculate that he faked his death to meet up with a woman he had been communicating with in Uzbekistan, a former Soviet republic in Central Asia. Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegCanada Post strike: Minister seeks order to get workers back on the jobGet daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Investigators made contact with Borgwardt in November and convinced him to return to the U.S. He turned himself in at the Green Lake County sheriff’s office on Tuesday and was charged Wednesday with obstructing the search for his body.  Story continues below advertisement According to the criminal complaint, he travelled 50 miles (80 kilometres) from his family’s home in Watertown to Green Lake on Aug. 11. During the night, he overturned his kayak on the lake, paddled back to shore in an inflatable raft that he brought with him — dumping his identification in the lake along the way — and rode an electric bicycle 70 miles (112 kilometres) to Madison, where he caught a bus to Toronto, flew to Paris and then to an unspecified country in Eastern Europe.He told investigators that a woman picked him up and they spent several days in a hotel before he took up residency in the country of Georgia, according to the complaint.Borgwardt was released from jail Wednesday in Green Lake County on a signature bond. He told a judge Wednesday that he would represent himself because he had only $20 in his wallet. The judge told him the court could appoint a lawyer for him, but online court records didn’t list one as of Thursday. More on WorldMore videosMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tTrump to China’s Xi : Come to my inauguration\t\t\t\t\tBorder officer almost hit by B.C. carjacking suspectBroadway Corridor density debateWhat’s up with the mysterious drones flying over New Jersey?Canada’s most Googled words are in, here’s what mattered most in 2024"
    },
    {
        "Title": "Canada Post strike tests public support heading into holidays: experts",
        "Date": "Posted December 13, 2024 8:20 am",
        "Text": "Public support is key to the success of a strike, experts say, but as the Canada Post strike drags on, that support is likely getting harder to maintain.“As strikes wear on, they become more difficult to sustain, and if the public is not rallying behind you, it can be demoralizing for the union,” said Brock University labour professor Larry Savage.More than 55,000 postal workers are off the job in a strike that has lasted over four weeks.Federal mediation was paused more than two weeks ago as the two sides were too far apart, and though proposals have been exchanged recently, it’s not clear that they’re any closer to reaching a deal, with Canada Post and the union criticizing each others’ demands and comments in public statements.Meanwhile, calls from the business community for government intervention have been rebuffed. Labour Minister Steven MacKinnon has consistently said the two parties have a responsibility to come to the table and hammer out a deal.  Story continues below advertisement  1:59‘I’m losing sleep’: Canada Post strike causes unexpected travel woesCanadian Union of Postal Workers negotiator Jim Gallant says on the picket lines, Canada Post workers are getting the support they need — plus coffee, doughnuts, fried chicken, knitted hats and socks, and even turkeys from citizens.But Savage said he feels overall public opinion has been mixed so far on the strike.“It’s not clear to me that either party is winning the war of public opinion,” he said.“(It) seems like a good chunk of people seem to not care about the strike, but those who do seem evenly split between Canada Post and the union. And I think lots of people are just frustrated and surprised that the strike has lasted this long.” Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.That divide was reflected in a recent Angus Reid poll, though it was conducted during the third week of the work stoppage. The survey of just over 3,000 Canadians found 34 per cent sided with Canada Post and its demands, while 29 per cent stood with the union. The rest were unsure, or didn’t support either side.  Story continues below advertisement Social media posts reflect the mixed opinions, with some people expressing frustration with the disruption and others proclaiming their support for the striking postal workers.Adam King, an assistant professor in the labour studies department at the University of Manitoba, said online discourse doesn’t tell the whole story.“It takes very little effort to post a comment on a story, but it takes much more to show up to a picket line,” he said.On the picket lines King has seen in Winnipeg, “CUPW has received lots of support,” he said, from the labour movement and the public.King and Savage said there’s been a broader trend of higher public support for striking workers in recent years. 0:29Canada Post, union resolve complaint over temporary layoffs“The fact that Canada Post isn’t a profit-making, billionaire-owned company complicates it a little bit, because it’s easier to go after a grocery baron, for example, than Canada Post,” said Savage.  Story continues below advertisement But both said even for the public sector, which Canadians historically have had less support for amid labour disputes, the public has been surprisingly onside over the past couple of years.“I think the public has been generally very understanding and receptive of workers’ demands coming out of the pandemic,” said King.“I think there was a level of understanding that maybe wasn’t there in previous years, that people really do understand that people are in a crunch, union members are in a cost of living squeeze, and they’re sympathetic to their demands.” Trending NowSaskatchewan Premier Scott Moe calls for federal electionCanada Post strike: Minister seeks order to get workers back on the jobAs the Canada Post strike drags on, “I think there might be maybe some shifts in public opinion, and it might be harder to maintain, especially as the Christmas season approaches,” said King. More on MoneyMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\t‘Stubborn’ fixed mortgage rates might not fall despite Bank of Canada cut\t\t\t\t\tCannabis-impaired driving on the rise in Ontario, CAA study findsConcern around new NSLC Cannabis ad campaignThe dangers of illegal cannabisRCMP warning about cannabis laced candy productsBut for the most part, “I would fit this strike into that longer pattern” of stronger support for striking workers, he said.Gallant said as the strike continues, there’s a lot of pressure on both sides to reach a deal.“We don’t want to be the people that ruin Christmas,” he said.Business associations have called for government intervention, saying the strike is harming business owners during the key holiday season.The day the strike started, Shopify CEO Tobi Lütke posted on X that Canada Post is an essential service and shouldn’t be allowed to go on strike.  Story continues below advertisement But strikes are meant to disrupt “business as usual,” Savage pointed out — the anger of customers and business owners is intended to pressure employers to reach a deal. 2:00Health Matters: Canada Post workers seek improved health and safety measures on the jobHowever, strikes “also risk alienating the public,” added Savage.“The trick is for the union to align its demands with the interests of the public. And that is like … walking a tightrope,” said Savage.Bea Bruske, president of the Canadian Labour Congress, said public support is important for workers during strikes because it not only boosts morale on the picket line, it puts pressure on the employer to come to the table.“I mean, they are really stuck, but there’s pressure all the way around. There’s pressure on the employer, and there’s pressure on the union as well,” she said.  Story continues below advertisement When a strike goes on for multiple weeks, “it’s harder to see the end of the road,” said Bruske.Groups within the labour movement like the Canadian Labour Congress try to keep the momentum going through social media, email campaigns and speaking to the media, she said.“Making sure that you maintain that momentum and that public support for the issue is critically important.” "
    },
    {
        "Title": "Macron names Francois Bayrou as new French PM. Who is he?",
        "Date": "Posted December 13, 2024 11:25 am",
        "Text": "French President Emmanuel Macron named key ally Francois Bayrou as his fourth prime minister of 2024 on Friday, but the scale of the challenge facing the veteran centrist was immediately clear as the Socialist Party refused to join his coalition government.Bayrou, 73, gave a sober assessment of whether he could tame a hung parliament that ousted his predecessor, Michel Barnier, just last week.“It is a long road, everyone knows that,” he told reporters. “I am not the first to take a long road.”France’s festering political malaise has raised doubts about whether Macron will complete his second presidential term until 2027.It has also lifted French borrowing costs and left a power vacuum in the heart of Europe, just as Donald Trump heads to the White House and Germany braces for new elections following the collapse of its governing coalition.  Story continues below advertisement Bayrou, the founder of the Democratic Movement (MoDem) party which has been a part of Macron’s ruling alliance since 2017, has himself run for president three times, leaning on his rural roots as the longtime mayor of the southwestern town of Pau. 1:57France’s government toppled in non-confidence vote, what happens next?His immediate priority will be passing a special law to roll over the 2024 budget, with a nastier battle over the belt-tightening 2025 legislation looming early next year.Parliamentary pushback over the 2025 bill led to Barnier’s downfall and left-wing leaders on Friday announced they might try to topple Bayrou as well should he use special constitutional powers to ram through the budget against parliament. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Bayrou’s proximity to the deeply unpopular Macron may also prove to be a vulnerability.The Socialist Party, which Macron courted during his prime ministerial search, accused the president of ignoring their demands for a leftist leader in favor of a “risky” Macronista.  Story continues below advertisement “We will thus not enter the government and remain in the opposition,” said Boris Vallaud, the leader of the Socialists’ parliamentary bloc. \t\t\t\tView from the left\t\t\tReaction to Bayrou’s appointment on the left will be a concern for Macron, with the prime minister likely living day-to-day, at the mercy of the president’s opponents, for the foreseeable future.Macron will hope Bayrou can stave off no-confidence votes until at least July, when France will be able to hold a new parliamentary election.Far-left France Unbowed party leaders said they would be seeking to immediately remove Bayrou, while leaders from other left-wing parties took a more nuanced approach. 0:40Macron appoints new French prime minister Trending NowCanada Post strike: Minister seeks order to get workers back on the jobSaskatchewan Premier Scott Moe calls for federal electionGreens boss Marine Tondelier also said she would support a no-confidence motion if the prime minister ignored their tax and pensions concerns.  Story continues below advertisement Communist leader Fabien Roussel said his party would hold fire against Bayrou and decide on a case-by-case basis if he promises not to ram through legislation.Jordan Bardella, president of the far-right National Rally (RN) party, said it would not be calling for an immediate no-confidence motion, while fellow RN leader Marine Le Pen said Bayrou should listen to the opposition’s budgetary wishes. \t\t\t\tReal test over 2025 budget looms\t\t\tBarnier’s budget bill, which aimed for 60 billion euros ($63 billion) in savings to assuage investors increasingly concerned by France’s 6% deficit, was deemed too miserly by the far-right and left. The government’s failure to find a way out of the gridlock has seen French borrowing costs push higher. 1:49Macron resists calls to resign, vows to name new French PM within daysXTB Research Director Kathleen Brooks said Bayrou’s appointment was unlikely to have a major impact on French bonds. However, she said the CAC 40 French stock index .FCHI is underperforming German stocks by a three-decade margin.  Story continues below advertisement “With France still mired in political turmoil, narrowing this gap is an uphill struggle, even with a new PM,” she wrote.Macron named Bayrou as justice minister in 2017 but he resigned only weeks later amid an investigation into his party’s alleged fraudulent employment of parliamentary assistants. He was acquitted of fraud charges this year.–Reporting by Dominique Vidalon; additional reporting by Michel Rose and Elizabeth Pineau; writing by Gabriel Stargardter; editing by Richard Lough, Angus MacSwan and Ros Russell More on PoliticsMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tDoug Ford in impromptu interview during Global News broadcastBroadway Corridor density debateMore container homes open in CourtenaySyria’s transition: U.S. racing to play role in shaping country’s future"
    },
    {
        "Title": "$32.5B settlement with tobacco giants approved by creditors, lawyer says",
        "Date": "Posted December 12, 2024 8:14 pm",
        "Text": "A proposed deal that would see three tobacco giants pay out billions to provinces and territories, as well as smokers across Canada, has been approved by the companies’ creditors, a lawyer representing some of the creditors said Thursday, calling it an important milestone in a lengthy legal saga.The proposed $32.5-billion global settlement between the companies — JTI-Macdonald Corp., Rothmans, Benson & Hedges and Imperial Tobacco Canada Ltd. — and their creditors was announced in October after more than five years of negotiations.Representatives for the creditors, which include provincial governments seeking to recover smoking-related health-care costs as well as plaintiffs in two Quebec class-action lawsuits, voted on the plan in a virtual meeting Thursday afternoon. 2:29Health Matters: Smoking class action members still waiting for compensationAndré Lespérance, who represents plaintiffs in one of the Quebec lawsuits, said creditors overwhelmingly supported the proposal.  Story continues below advertisement “We’re not surprised, but we’re glad the creditors are united right now to see this plan approved,” he said in French.Before the plan can be implemented, it must obtain the approval of the court. A hearing has been scheduled for the end of January, and Lespérance said he’s optimistic the proposed deal will clear that hurdle as well. Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“I think we’re really close to the end,” he said.Dominique Claveau, executive director of the Quebec Council on Tobacco and Health, which is part of the lawsuit, said they look forward to having the court “bring this long-fought battle for justice and truth to its conclusion.”At least one of the companies has said it opposes the plan in its current form.The proposed deal includes $24 billion for provinces and territories, $4 billion for tens of thousands of Quebec smokers and their heirs, and more than $2.5 billion for smokers in other provinces and territories. It also includes more than $1 billion for a foundation to help those affected by tobacco-related diseases. 1:37Canada becomes 1st country to have individual cigarette warning labelsThe Canadian Cancer Society, which is a social stakeholder in the case, said Thursday it hopes the proposal will be amended before it’s approved by the court. Trending NowCanada Post strike: Ontario utilities warn of penalties as millions await billsCanada Post strike: Minister seeks order to get workers back on the job Story continues below advertisement Rob Cunningham, the organization’s lawyer, said the plan should include smoking-reduction measures and the release of confidential industry documents, similar to what was achieved in the United States decades ago.“There’s a once-in-a-lifetime opportunity to better control the tobacco industry and to reduce tobacco use. We’re never going to get this chance again,” he said.The foundation funded through the proposed deal should also have its mandate expanded to include prevention of tobacco-related disease and public awareness efforts to help people quit smoking, said Manuel Arango, vice-president of policy and advocacy for Heart & Stroke.“We already have a lot of studies and a lot of knowledge about the treatment of tobacco-related disease,” he said. “So it’s really about looking forward and helping prevent tobacco-related disease in the future.” 2:03Holland warns tobacco companies to ‘stay the hell away’ from kidsThe proposal is the culmination of a corporate restructuring process set off by a decades-long legal battle over the health effects of smoking.  Story continues below advertisement In 2015, a Quebec court ordered the three companies to pay about $15 billion in two class-action lawsuits involving smokers in the province who took up the habit between 1950 and 1998 and either fell ill or were addicted, or their heirs.Four years later, the landmark ruling was upheld by the province’s Appeal Court. The companies then sought creditor protection in Ontario in order to negotiate a global settlement with their creditors.All of the legal proceedings against them were put on hold during the talks. That order has now been extended until Jan. 31, 2025. More on HealthMore videos‘Abnormally high’ flames spur recall for thousands of candles in Canada\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tWorld’s oldest newlyweds have a combined age of 202\t\t\t\t\tIt’s RSV season in Canada. Here’s how to keep children safe\t\t\t\t\tHealth Matters: Canada Post workers seek improved health and safety measures on the jobMore container homes open in CourtenayWearing a mask while exercising indoors improves lung functionAlberta paramedics sound the alarm over shift vacancies ahead of the holidays"
    },
    {
        "Title": "Canada’s maple syrup harvest up 91% — but it may not sweeten prices",
        "Date": "Posted December 12, 2024 4:08 pm",
        "Text": "It’s been a good year for one of Canada’s most iconic exports. After a challenging year for maple syrup production in 2023, the industry seems to have come out of a sticky spot.Canada had a record year of maple syrup production in 2024, new data from Statistics Canada revealed on Thursday. However, it may not be enough to lower prices.“Usually, higher production in agricultural production leads to lower prices, but this is a specialized, processed product,” said Barry Prentice, an agricultural economist at the University of Manitoba.“Given the large export market, and food inflation, I would say we are lucky just to see no price increase.”A litre of Grade A maple syrup can range in price from $15-17 at grocery stores like Real Canadian Superstore and Walmart, to $25-28 directly from local producers.  Story continues below advertisement Statistics Canada doesn’t track maple syrup prices specifically but classifies the product within its sugar and syrup index. Yearly annual price changes for the index were down 3.1 per cent in 2019, down 4.5 per cent in 2020, then up 4.6 per cent in 2021, up 15.1 per cent in 2022 and up 9.6 per cent in 2023.Canadian maple syrup producers harvested 19.9 million gallons of maple syrup in 2024, up 91.3 per cent compared with 2023.Production was higher across all four maple-producing provinces — Quebec, Ontario, New Brunswick and Nova Scotia — in 2024. More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal electionMaple syrup production dropped from 17.4 million gallons in 2022 to 10.4 million gallons in 2023, which Statistics Canada attributed to severe weather such as storms and temperature fluctuations. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Canada’s strategic maple syrup reserve fell to its lowest level in 16 years in 2023.Statistics Canada’s 2023 overview of the maple industry said the Federation of Quebec Maple Syrup Producers (QMSP) controls the quantity of production in Quebec, the largest maple-producing province in the country, and maintain a strategic reserve of maple syrup.This is done to “minimize fluctuations in pricing and availability of supply, which is driven by natural variability in annual production.”Statistics Canada cited “favourable weather conditions and increased yields” in 2024 as the reason behind the strong harvest.  Story continues below advertisement “It’s the weather,” said Prentice.“It’s just a matter of if the spring conditions are right and the trees run well. You need cold nights and warm days for an extended period. It certainly helps if you have lots of snow.”Quebec remained Canada’s largest maple syrup producer by far, harvesting 18 million gallons in 2024, up 8.7 million gallons or 92.2 per cent from 2023. 2:12Sweet dreams: How Manitoba could boost Canada’s maple syrup industry Trending NowHow the Ford government in Ontario plans to escalate trade war with the U.S.Saskatchewan Premier Scott Moe calls for federal electionOntario, which harvested 607,000 gallons, saw an increase of nearly 21 per cent compared to 2023.Production in Nova Scotia increased by almost one-third from 2023 to 43,000 gallons in 2024.The biggest percentage jump was in New Brunswick, which saw a 128-per-cent increase by harvesting 1.2 million gallons of maple syrup.  Story continues below advertisement Canadian exports of maple syrup went up too, with Canada exporting 8.4 million gallons of maple products in the first three quarters of 2024, up 8.8 per cent from the same period in 2023.Prentice said despite the high production, Canadian syrup producers should not have trouble selling their product to the world.“We produce 71 per cent of the world’s supply and the United States has the other 29 per cent,” he said.He said 61 per cent of Canada’s maple syrup is exported the U.S., 25 per cent to Europe and the rest to Asia, in addition to the sizeable domestic demand.“There’s no product like it. It does compete in a certain sense with sugar and honey — it’s a sweetener, but it’s such a unique product in itself,” he said.Prentice said any surplus maple syrup could simply go towards replenishing reserves due to its long  shelf life.With more maple syrup likely to hit the shelves soon, a bottle of good old maple syrup might just make for a good holiday present.“This is one of our specialties. Beavers and Mounties and maple syrup are the Canadian icons,” Prentice said. "
    },
    {
        "Title": "Quebec, Ottawa announce $100M deal to fight homelessness",
        "Date": "Posted December 13, 2024 11:50 am",
        "Text": "Ottawa and Quebec announced an agreement Friday to help unhoused Quebecers as homeless encampments continue to multiply in the province and frigid weather sets in.The federal government is providing $50 million over two years as part of a $250-million envelope announced in the last federal budget to address homelessness and encampments across the country.“This funding will reduce the number of people experiencing homelessness outside shelters, in particular those living in encampments,” Soraya Martinez Ferrada, federal tourism minister and minister responsible for economic development in Quebec, told a news conference in Montreal.“This agreement would also help communities across Quebec to provide shelter spaces to ensure that people in need have a safe, warm space during the winter months,” she said.The money will be given to the new Crown corporation overseeing Quebec’s public health-care system, which will distribute the funds to the regions of Quebec. Montreal is set to receive half the federal money.  Story continues below advertisement Chantal Rouleau, Quebec’s social solidarity and community action minister, said the money will be used to hire more street intervention workers, create additional shelter spaces and help people find stable housing. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Robert Beaudry, the Montreal executive committee member responsible for homelessness, said it is needed urgently to make a difference as the weather gets colder.“The holiday season is upon us and, unfortunately, every evening dozens of people are turned away from shelters in Montreal,” he said. “So they’re left to fend for themselves, on the streets, in our parks, without water, without heat, without bathrooms, often with very little support,” he added. 2:07City of Longueuil forcing closure of new homeless shelter Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegCanada Post strike: Ontario utilities warn of penalties as millions await billsThe Quebec government said it will allocate $50 million to address encampments, drawn from $400 million it has committed to fight homelessness from 2021 to 2026.However, Montreal says Quebec is not doing enough. Following the press conference, Beaudry said Quebec’s contribution is from previously promised sums rather than new money.  Story continues below advertisement “All the cities in Quebec expect the government of Quebec to increase the amount of money and match the amount of money that the federal (government) put to respond to this crisis, right now,” he said in an interview.In early November, Montreal Mayor Valérie Plante said a “constitutional fight” between Quebec and Canada was tying up $50 million from Ottawa and an additional $50 million from Quebec City that the city urgently needed to deal with its worsening homelessness problem.Radio-Canada had previously reported that negotiations had stalled because Quebec was resisting the conditions attached to the federal money. More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "Doug Ford threatened to stop energy exports to the U.S. How would it work?",
        "Date": "Posted December 13, 2024 2:13 pm",
        "Text": "Ontario Premier Doug Ford responded to the burgeoning trade tension between Canada and the United States with a threat that the province could cut off energy exports to the U.S. in retaliation to president-elect Donald Trump’s threat of sweeping tariffs.But what would it look like if Ontario and other provinces carried out that threat?Some experts say Canada doesn’t have much room to work with when it comes to potential retaliation.On Wednesday, Ford along with other Canadian premiers met with Prime Minister Justin Trudeau to discuss the 25-per cent tariffs Trump has threatened to impose on all Canadian imports on his first day in office, which will be Jan. 20, 2025.After the meeting, Ford offered a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.  Story continues below advertisement View image in full screen\t\t\t\t\tA map of Canada with the biggest export for the provinces and territories. Donald Trump says he will sign an executive order imposing a 25 per cent tariff on all products coming in to the United States from Canada and Mexico.\t\t\t\t“It would turn off the lights to a million-and-a-half Americans,” Ford said. “If they come at us we have to stand up for Canadians, we have to stand up for Ontarians.”A spokesperson for Independent Electricity System Operator (IESO), Ontario’s energy regulator, said discussions are currently taking place.“There are active discussions underway with government about this matter and the IESO is not in a position to comment at this point in time,” IESO spokesperson Andrew Dow told Global News in a statement. 1:55Eby weighs in on premiers meeting to discuss response to Trump tariff threatDrew Fagan, a professor at the Munk School of Global Affairs & Public Policy, said Canada may have more to lose from an energy war than the United States.  Story continues below advertisement “I’d be very careful about trying to get into a full war where they have a gun and we have a knife,” Fagan said. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Fagan said risking a trade war with the U.S., particularly in the energy sector, could jeopardize Canadian jobs.View image in full screen\t\t\t\t\tCanada’s two biggest exports to the United States are crude oil and motor vehicles. Donald Trump says he will sign an executive order imposing a 25 per cent tariff on all products coming in to the United States from Canada and Mexico.\t\t\t\t“Tit-for-tat means we will damage our economy far more than we will damage their economy. And that means (a negative impact on) economic growth and jobs. And when we’re talking about the energy sector, we’re talking about good, high-paying jobs,” he said.Last month, Global News reported that according to documents filed with the B.C. Utilities Commission, BC Hydro imported 13,600 gigawatt hours of electricity in fiscal year 2024, at a cost of nearly $1.4 billion.Much of the power came from the U.S. and Alberta, where it was generated by burning fossil fuels.  Story continues below advertisement While three U.S. states — primarily Michigan and New York, but also Minnesota — receive Ontario energy, it does not account for the majority of their energy consumption.According to IESO data, Ontario sent 7,718 gigawatts of power to Michigan. However, the state produced 120,656 gigawatts of electricity domestically.New York had similar figures, producing 124,039 gigawatts domestically and importing 4,149 gigawatts from Ontario. Minnesota received 66 gigawatts from Ontario last year. 3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: Ford Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegTrump says it’s ‘fine’ after Ford threat to cut energy to border statesOne premier who doesn’t share Ford’s enthusiasm for cutting off energy exports to the United States is Alberta Premier Danielle Smith.Fagan said, “She (Smith) wouldn’t take that step because it would be something close to economic Armageddon for her economy. It’s interesting that Premier Ford didn’t suggest cutting off cars. He suggested a product that is important (to Ontario) but secondary.”  Story continues below advertisement On Thursday, Smith said, “Under no circumstances will Alberta agree to cut off oil and gas exports.”“I don’t support tariffs on Canadian goods and I don’t support tariffs on U.S. goods. Because all it does is make life more expensive for everyday Canadians and everyday Americans,” she said.As of 2022, Canada’s biggest export to the United States in terms of value was crude oil, worth $152.6 billion. According to Statistics Canada, the U.S. accounted for 97.4 per cent of Canada’s crude oil exports, with Alberta contributing to 87.4 per cent of the total volume exported to the U.S. 3:17Ford introduces bill to dismantle homeless encampments, increase drug penalties \t\t\t\tIs Canada ready for a broader tariff war?\t\t\tFagan cautioned that a tit-for-tat trade fight with the United States may not be contained to the energy sector.  Story continues below advertisement “What if they retaliate to his retaliation by doing something with regard to cars, which is a much bigger part of the Ontario economy?”Ontario is the highest-value exporting province to the United States, with its exports to its southern neighbour amounting to an annual $220.5 billion. Ontario’s highest-value export is motor vehicles, amounting to $36 billion, followed by gold at $17.66 billion.With conflict in the Middle East and in Eastern Europe currently raging, Fagan said Canada could pitch itself as the best bet for meeting U.S. energy needs.“Who do you want to buy from? You want to buy from Canada. We should be doing more trade, not less, in all forms of energy,” he said.Fagan said a larger trade war would hurt Canada more.“The Canadian economy is roughly the size of New York State. There’s a huge imbalance,” he said. More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "‘We need to make a deal,’ Ford says after Trump responds to energy threat",
        "Date": "Posted December 13, 2024 1:25 pm",
        "Text": "Ontario Premier Doug Ford says Canada and the United States need to “make a deal” as president-elect Donald Trump’s threats of sweeping tariffs continues to loom over the two countries.Ford made those comments Friday, one day after Trump responded to his threat of stopping energy exports to the U.S. should Trump follow through.Trump told a CNBC reporter on the floor of the New York Stock Exchange Thursday that it was “OK” if Ford did that, adding it was “fine.” He then went on to claim the U.S. is “subsidizing” Canada to the tune of US$100 billion a year — a claim he’s made in the past before.“Well, what you didn’t hear on the tape after (is) he says ‘I really want to make a deal with Canada.’ That’s the first time he’s ever said that, and I respect the position he’s coming from. I’m sure he respects the position we’re coming from,” Ford said Friday.  Story continues below advertisement “He also mentioned he has lots of friends in Canada. Well, we have lots of friends in the U.S. — that’s the reason we need to make a deal because we’re part of the larger family.”CNBC did not air Trump’s comments about wanting to make a deal, however the reporter told the broadcast Trump said to him off camera afterwards he hoped “we can work something out.” \t\t\t\tHow Ontario is preparing to respond to Trump's threat\t\t\tShortly after winning the November presidential election, Trump threatened to impose 25-per cent tariffs on all imported goods from Canada and Mexico if both countries do not address illegal immigration and fentanyl trafficking into the U.S. 1:19‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energy Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegSaskatchewan Premier Scott Moe calls for federal electionSince then, Ford and Canada’s premiers have held meetings with the federal government to discuss potential responses, with Trudeau sharing an “overview” Wednesday of his government’s plan to strengthen border security in response to the tariff threat.  Story continues below advertisement After the meeting, Ford, who said he now believes there is a “100 per cent” chance tariffs will be imposed in early January, made his threat to “cut off” millions of American living in border states from Ontario’s energy exports. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Furthermore, government sources told Global News the province is also considering restricting imports of U.S.-made alcohol, and limiting exports of Canadian critical minerals to the U.S.They described the plan as “escalation maneuvers” that are still being fleshed out. One source added the government is “deadly serious” about the approach, even if the premier offered personal reservations about cutting off the power supply to millions of American homes and businesses.On Friday, Ford said he’s been speaking spoke to several U.S. politicians over recent days, and said they’re not singing the same tune as Trump.“I’m hearing: ‘Let’s get moving, let’s make a deal and get this done,'” Ford said.“We’ll get through it. Maybe a few bumps in the road; we just have to be prepared.”— with files from Colin D’Mello and Isaac Callan More on PoliticsMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tCanada Post, union resolve complaint over temporary layoffs\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tDoug Ford in impromptu interview during Global News broadcastBroadway Corridor density debateMore container homes open in CourtenaySyria’s transition: U.S. racing to play role in shaping country’s future"
    },
    {
        "Title": "Former U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe",
        "Date": "Posted December 13, 2024 11:56 am",
        "Text": "Former U.S. House of Representatives Speaker Nancy Pelosi suffered an injury on a trip to Luxembourg and has been admitted to a hospital for evaluation, her office said in a statement on Friday.Pelosi, 84, is the first woman to serve as speaker of the House and had also been a longtime leader of the House Democratic Caucus.“While traveling with a bipartisan Congressional delegation in Luxembourg to mark the 80th anniversary of the Battle of the Bulge, Speaker Emerita Nancy Pelosi sustained an injury during an official engagement and was admitted to the hospital for evaluation,” Pelosi spokesperson Ian Krager said in a statement. “Speaker Emerita Pelosi is currently receiving excellent treatment from doctors and medical professionals. She continues to work.” Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The San Francisco congresswoman stepped down from her role as speaker — a powerful position second in line to the presidency after the vice president — in 2023 but she has continued to serve in the House.  Story continues below advertisement She was reelected in November to another two-year term beginning on Jan. 3. 0:30‘Battle for Ukraine is a battle for democracy itself’: Pelosi Trending NowCanada Post strike: Ontario utilities warn of penalties as millions await billsSaskatchewan Premier Scott Moe calls for federal electionPelosi played a key role in passing Democratic President Joe Biden’s sweeping $1 trillion infrastructure bill in 2022 and famously feuded with Republican Donald Trump during his first four years in office, culminating with the moment when she tore up his State of the Union speech on national television in 2020.Pelosi has been a prominent figure in the U.S. capital over a tenure spanning seven presidential administrations. She first served as House speaker from 2007 to 2011, then regained the job in 2019 after her party took back control of the chamber in the 2018 midterm elections.Democrats lost their House majority in 2022, and Republicans will again hold a narrow majority next year when President-elect Trump returns to the White House.  Story continues below advertisement (Reporting by Idrees Ali and Richard Cowan; Editing by Scott Malone) More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tTrump to China’s Xi : Come to my inauguration\t\t\t\t\tLarge, unknown drone sightings over eastern US being ‘closely’ tracked, White House saysAlberta unveils red zone border patrol plan to combat illegal activityTrump named Time’s ‘Person of the Year’ for 2nd time: ‘I think I like it better this time’‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energy"
    },
    {
        "Title": "California couple shot dead in Mexico while on vacation for the holidays",
        "Date": "Posted December 13, 2024 12:01 pm",
        "Text": "A California couple has been shot and killed while on vacation in Mexico, authorities have confirmed.The couple, identified by the Michoacan State Attorney General’s Office only as Gloria A., 50, and Rafael C., 53, were gunned down in the western state of Michoacan just before midnight Wednesday night.The married pair had been travelling in a pickup truck in the municipality of Angamacutiro when they were shot. The woman died at the scene, reports Reuters, while the man died in hospital a short time later.It was not immediately clear why or if the couple was specifically targeted.State prosecutors told Reuters that the woman, who had obtained U.S. citizenship, and the man, who was born in the U.S. to Mexican parents, had family and a home in Angamacutiro.  Story continues below advertisement  4:55Why more Canadians say they’re skipping travel and staying home for the holidaysWhy more Canadians say they’re skipping travel and staying home for the holidaysThe medical travel risks to be aware of this holiday seasonPrevious VideoNext VideoMagdalena Guzmán, a press officer at the Michoacán prosecutor’s office, told the New York Times the couple arrived in Mexico late last month to spend the holidays with family. Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegSaskatchewan Premier Scott Moe calls for federal electionGet daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.According to the outlet, authorities learned of the attack after security officers found their vehicle ridden with bullets on an Angamacutiro street.The prosecutor’s office said that the couple’s licence plate had been registered without a number in the Lázaro Cárdenas neighbourhood. Investigators were collecting ballistic evidence from the scene for analysis.The killing is considered a step backward in the Mexican government’s pledge to curb organized crime in several regions.Mexican President Claudia Sheinbaum, who took office in October, has promised to replicate nationally the success she had as mayor of Mexico City in bringing down the sprawling capital’s murder rate.  Story continues below advertisement But her first two months in office have been marked by an outbreak of cartel violence in several hotspots.The Canadian government advises tourists to avoid non-essential travel to several states in Mexico — including Michoacan — due to high levels of violence and organized crime.— With files from Reuters More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tTrump to China’s Xi : Come to my inauguration\t\t\t\t\tMarie Antoinette ‘smartwatch’ on display in LondonSyria’s transition: U.S. racing to play role in shaping country’s futureSouth Korea’s president says he’ll fight impeachmentYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg"
    },
    {
        "Title": "Trump to China’s Xi : Come to my inauguration",
        "Date": "Posted December 13, 2024 8:49 am",
        "Text": "U.S. President-elect Donald Trump has invited Chinese President Xi Jinping and other foreign leaders to his inauguration next month in Washington, a Trump transition spokesperson said on Thursday, but experts said that Xi was not likely to attend.Asked if Xi had responded, Karoline Leavitt told Fox News in an interview that was “to be determined.” She did not name the other world leaders who were also invited.“This is an example of President Trump creating an open dialog with leaders of countries that are not just our allies but our adversaries and our competitors, too,” Leavitt added.It would be unprecedented for a leader of China, a top U.S. geopolitical rival, to attend a U.S. presidential inauguration and China experts said it was highly unlikely that Xi would come to Washington.“This is diplomatic theater, nothing more. Other heads of state, let alone Xi Jinping, haven’t attended U.S. Presidential inaugurations,” said Scott Kennedy, a China specialist at Washington’s Center for Strategic and International Studies.  Story continues below advertisement  2:10Tit for tat? Premiers divided on response to Trump’s tariff vowTrump, in remarks to CNBC on the floor of the New York Stock Exchange on Thursday, said his administration would be having “a lot of talks with China.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“We have a good relationship with China. I have a surprising relationship. Now, when the COVID came in, I sort of cut it off. That was a step too far,” he said.“But we’ve been talking and discussing with President Xi, some things, and others, other world leaders, and I think we’re going to do very well all around.”The Kremlin separately on Thursday said that it had not received an invitation to attend the Jan. 20 inauguration.The offer for Xi to attend Trump’s swearing-in was extended in early November, shortly after the Nov. 5 presidential election, according to CBS News, which first reported the invitation on Wednesday.  Story continues below advertisement CBS said Hungary’s far-right leader, Prime Minister Viktor Orbán, who has a warm relationship with Trump and visited him in Florida this week, was “still considering” whether to attend,The Chinese embassy has not responded to a Reuters request for comment. \t\t\t\tTensions over trade, taiwan\t\t\tTrump has named numerous China hawks to key posts in his incoming administration, including Senator Marco Rubio as secretary of state. Trending NowSaskatchewan Premier Scott Moe calls for federal electionYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegTrump has also said he will impose an additional 10% tariff on Chinese goods unless Beijing does more to stop trafficking of the highly addictive narcotic fentanyl. He threatened tariffs in excess of 60% on Chinese goods while on the campaign trail.In late November, China’s state media warned Trump that his tariff threat could drag the world’s top two economies into a mutually destructive tariff war.  Story continues below advertisement On Wednesday, China’s U.S. Ambassador Xie Feng read a letter from Xi to a U.S.-China Business Council gala in Washington, in which the Chinese leader said Beijing was prepared to stay in communication with the U.S.“We should choose dialog over confrontation and win-win cooperation over zero-sum games,” Xi said in the letter.Other China experts said China could respond to Trump’s invitation by offering to send a lower level official, but would likely demand that self-governed Taiwan, which China claims as its own territory, not be invited.Taiwan, which the United States does not officially recognize, is likely to be uneasy about Trump’s invitation to Xi, said Bonnie Glaser, a Taiwan expert at the German Marshall Fund of the United States. 3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: FordTrump’s electoral win sparked hope in Taiwan that he will pursue a tough line with China but also anxiety given his comments that the island should pay the U.S. for its defense.  Story continues below advertisement Two senior members of Taiwan’s government have been in the United States this week to meet people connected to Trump’s transition team, five sources told Reuters. More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tLarge, unknown drone sightings over eastern US being ‘closely’ tracked, White House saysAlberta unveils red zone border patrol plan to combat illegal activityTrump named Time’s ‘Person of the Year’ for 2nd time: ‘I think I like it better this time’‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energy"
    },
    {
        "Title": "Canada Post strike: Minister seeks order to get workers back on the job",
        "Date": "Posted December 13, 2024 10:29 am",
        "Text": "Amid the ongoing Canada Post strike, federal Labour Minister Steven MacKinnon announced Friday that he is asking the Canada Industrial Relations Board (CIRB) to order workers back on the job if it agrees with his determination there is an “impasse” in negotiations.If the CIRB agrees, MacKinnon says the labour relations board would order Canada Post and all employees represented by the Canadian Union of Postal Workers to resume operations and extend the terms of the existing collective agreements until May 2025.“Not only have the parties been unable to show any progress towards an agreement, the federal mediator has now informed me that the negotiations between both parties are now, in fact, going in the wrong direction,” he said during a Friday media conference.“So I’m here today to announce that I am applying a solution to promote conditions favorable to the settlement of this labor dispute and protect the interests of all Canadians.”  Story continues below advertisement When asked about the resumption of services and whether Christmas gifts and letters could be sent, MacKinnon stated that both parties must be heard by CIRB.He emphasized that if the CIRB reaches the same conclusion as he has that the parties are at an “impasse,” he says the board could issue a directive for workers to be back by next week.The strike began on Nov. 15 after Canada Post workers and the employer failed to reach an agreement. The union was seeking wage increases, better pensions and improved health benefits. 2:02Canada Post strike: Rural communities anxious as labour dispute nears 1-month markIn the past, federal governments have used back-to-work legislation during Canada Post strikes, including in 2018 and 2011, to resolve disputes and restore essential services.In 2011, a postal worker strike was followed by a two-week lockout imposed by Canada Post management. However, the Conservative government passed back-to-work legislation to end the disruption. Similarly, in 2018, Prime Minister Justin Trudeau’s government passed back-to-work legislation to resolve another Canada Post strike.  Story continues below advertisement MacKinnon has previously said that Ottawa is not looking to force an end to the strike and that the government would remain on the sidelines. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The postal shutdown was costing small businesses millions each day, the Canadian Federation of Independent Business said, and impacting Canadians across the country.On Friday, the Canadian Union of Postal Workers (CUPW) released a statement saying it “denounces in the strongest terms this assault on our constitutionally protected right to collectively bargain and to strike.” More on CanadaMore videosCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election“This order continues a deeply troubling pattern in which the government uses its arbitrary powers to let employers off the hook, drag their feet, and refuse to bargain in good faith with workers and their unions,” the statement read.CUPW added that because it is a “rapidly developing situation” it has not had time to review all the details.“What we do know is that postal workers are being forced to return to work without new negotiated collective agreements in place,” it said, adding that it is currently reviewing the order and considering its options moving forward.Canada Post said it is also reviewing the details of MacKinnon’s announcement to ensure it is prepared to fully participate and comply.“While that unfolds, we look forward to welcoming our employees back to work and serving Canadians and customers. We will take all appropriate steps to support that process as quickly as possible given the direction provided to us by the Minister,” a spokesperson told Global News in a Friday email.  Story continues below advertisement  \t\t\t\t'Canadians are rightly fed up': minister\t\t\tAfter nearly a month of stalled negotiations, MacKinnon said he had to intervene and use his powers to try to ensure mail operations continue.The decision is not one he “takes lightly,” he said, adding that it is time to “call a time out.”“Canada Post and the Canadian Union of Postal Workers remain unable to reach an agreement. Canadians are rightly fed up,” MacKinnon said.“As the minister of labour, I have a responsibility to protect Canadians and the public’s interests while respecting the rights of the parties involved in this. That’s why I’m here to announce that I’m bringing forward a solution to promote conditions conducive to resolving this labour dispute and protect the interests of all Canadians,” he added. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesHow the Ford government in Ontario plans to escalate trade war with the U.S.The strike has impacted businesses across the nation, with Canada Post unable to process an estimated one million parcels a day. MacKinnon called the disruption “detrimental” to businesses, causing “economic harm” with each passing day.  Story continues below advertisement He also noted that the strike has affected charities during the holiday season, as fundraising efforts have been “jeopardized” by the ongoing dispute.The idea now is to extend the terms of their existing collective agreements until May 22, 2025.During this time, he said an Industrial Inquiry Commission (ICC) would be established, with William Kaplan, an arbitration and mediation lawyer, appointed as the commissioner. 2:11Canada Post lost nearly $750M last year, future now uncertain“The commissioner will be tasked with examining the structural issues preventing the resolution of the current labour dispute. The IIC will be required to submit a report to me and the parties outlining their findings and recommendations by May 15, 2025,” MacKinnon said.“The review could provide the basis of a path forward on how to amend the collective agreements and clarify the structures, rights and responsibilities of the parties in collective bargaining. The inquiry will have a broad scope, as it will examine the entire structure of Canada Post from both the customer and business model standpoint. Considering the challenging business environment now facing Canada Post.”  Story continues below advertisement The chair of Canada Post warned in August that the Crown corporation is at a “critical juncture” and its financial situation is “unsustainable.”The Crown corporation’s latest annual report used similar language, noting it has recorded “significant” annual losses since 2018. Last year’s loss was the second-largest on record, at $748 million.The Canadian Federation of Independent Business (CFIB) said Friday that it is relieved to learn the government is taking action to get Canada Post workers back on the job.“It appears the Canada Industrial Relations Board (CIRB) will have 72 hours to do its work before issuing a back to work order on Monday. This means Canada Post workers would be back on the job sometime next week at the earliest,” CFIB president Dan Kelly said in a media release.“This will be too late to salvage any of the Christmas holiday season for small businesses. With a massive backlog, it will be nearly impossible for any new shipments to make it to Canadians before Christmas through Canada Post,” he said.But, he added, the temporary order will help businesses that are desperately waiting for cheque-based payments from other business customers. Millions of dollars have been frozen in the mail making it difficult for small firms to pay their bills.— With files from the Canadian Press  Advertisement "
    },
    {
        "Title": "Trump says it’s ‘fine’ after Ford threat to cut energy to border states",
        "Date": "Posted December 12, 2024 6:11 pm",
        "Text": "U.S. president-elect Donald Trump was asked about Ontario Premier Doug Ford’s recent warning that the province could cut off energy exports to about 1.5 million Americans if Trump lays threatened tariffs on Canada next month, saying Thursday it was “fine.”On Wednesday, following a meeting between premiers and Prime Minister Justin Trudeau, Ford said he believed there was a “100 per cent” chance 25-per-cent tariffs threatened by Trump would be imposed in January on Canada. Ford countered with a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.“That’s OK if he does that, that’s fine,” Trump told a CNBC reporter on the floor of the New York Stock Exchange. “The United States is subsidizing Canada, it’s truly a subsidy and we shouldn’t have to do that.”  Story continues below advertisement Trump claimed the U.S. subsidizes Canada more than US$100 billion a year, though he did not specify where that number came from and made similar remarks in 2018.Subsidies are defined by the International Monetary Fund as “a transfer of resources from a government to a domestic entity without an equivalent contribution in return.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The IMF notes subsidies can “take many forms, including direct grants to domestic companies, tax incentives, or favorable terms for financing.”It’s not clear if Trump’s claims relate to trade deficits, which is when a country buys more than it sells to another country, or direct investment, either.The Office of the U.S. Trade Representative says that “the U.S. goods and services trade deficit with Canada was $53.5 billion in 2022.”Statistics Canada says that direct investment from Canada into the U.S. in 2023 was $1.1 trillion while U.S. direct investment in Canada was $618.2 billion.“In 2023, Canada’s exports of services to the United States increased 7.2% to $107.2 billion, while imports of services from the United States advanced 8.7% to $121.0 billion,” Statistics Canada also said last month.  3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: FordShortly after his re-election, Trump threatened to impose 25-per cent tariffs on all imported goods from Canada and Mexico if both countries do not address illegal immigration and fentanyl trafficking into the U.S.  Story continues below advertisement Since then, Ford and Canada’s premiers have held meetings with the federal government to discuss potential responses, with Trudeau sharing an “overview” Wednesday of his government’s plan to strengthen border security in response to the tariff threat.Sources outlined four potential measures from Ford that Ontario could pursue to Global News:Restricting electricity exports to Michigan, New York and Minnesota — each of which share a border with OntarioRestricting exports of Canadian critical minerals required for electric vehicle batteries and supply chainRestricting U.S.-based companies from the Government of Ontario’s procurement processRestricting the LCBO, the largest purchaser of alcohol in the world, from buying American-made alcoholSources in the Ford government describe the measure as “escalation maneuvers” that are still being fleshed out.—with files from Global News’ Colin D’Mello, Isaac Callan and Sean Boynton Related NewsHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tTrudeau shares border plan with premiers in meeting on Trump tariff response\t\t\t\t\t"
    },
    {
        "Title": "How the Ford government in Ontario plans to escalate trade war with the U.S.",
        "Date": "Posted December 12, 2024 6:00 am",
        "Text": "Cutting off power to 1.5 million Americans, restricting imports of U.S.-made alcohol, and limiting exports of Canadian critical minerals are among the list of measures the Ford government is considering if a looming trade war with the incoming Trump administration escalates in the new year.On Wednesday, Premier Doug Ford, along with other Canadian premiers, met with Prime Minister Justin Trudeau to discuss the 25 per cent tariffs U.S. President-Elect Donald Trump has threatened to impose on all Canadian imports.After the meeting, Ford, who now believes there is a “100 per cent” chance that tariffs will be imposed in early January, offered a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.“It would turn off the lights to a million-and-a-half Americans,” Ford told Global News. “If they come at us we have to stand up for Canadians, we have to stand up for Ontarians.”  Story continues below advertisement  \t\t\t\tOntario is 'sending a message': Ford\t\t\tSources outlined four potential measures: Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Restricting electricity exports to Michigan, New York State and MinnesotaRestricting exports of Canadian critical minerals required for electric vehicle batteries and supply chainRestricting U.S.-based companies from the Government of Ontario’s procurement processRestricting the LCBO, the largest purchaser of alcohol in the world, from buying American-made alcoholSources in the Ford government describe the measures as “escalation maneuvres” that are still being fleshed out.One source added the government is “deadly serious” about the approach, even if the Premier offered personal reservations about cutting off the power supply to millions of American homes and businesses.Some of the measures would also come at a cost the Ontario’s economy.For example, the energy restriction policy, conceived by the Ministry of Economic Development and Trade, could cost the provincial treasury $400-$700 million in lost revenue.  Story continues below advertisement Sources pointed out, however, the economic impact to Ontario’s southern neighbours is estimated to be in the billions. The Associated Press reported that about 85 per cent of electricity imported to the U.S. comes from Canadian generation.Another source suggested the province could join forces with other provinces to maximize the pain.“Shutting off its electricity is one thing,” the source said. “Ontario and Quebec shutting off electricity is entirely another thing.” 2:34Doug Ford in impromptu interview during Global News broadcastAt a news conference Thursday, Ford told reporters the province is “sending a message” to the U.S.“You come in and attack Ontario … we’re going to use every tool in our toolbox to defend Ontarians and Canadians across the border,” he said.“Let’s hope that never comes to that point.”  Story continues below advertisement Ford went on to point the finger at Mexico — a claim he’s made in the past — for reportedly allowing Chinese companies to bypass CUSMA rules and export vehicles and parts into the U.S. and Canada through Mexican-built manufacturing plants.“That’s the problem, and as I said yesterday, it’s very clear: Mexico has a choice to stand with Beijing or stand with Washington,” he added.— with files from Aaron D’Andrea Related NewsDoug Ford in impromptu interview during Global News broadcast\t\t\t\t\t"
    },
    {
        "Title": "None",
        "Date": "None",
        "Text": "None"
    },
    {
        "Title": "Canada Post strike: Ontario utilities warn of penalties as millions await bills",
        "Date": "Posted December 13, 2024 8:30 am",
        "Text": "Millions of Ontarians who rely on paper billing for their utilities may find themselves in a bind as the ongoing Canada Post strike hits the one month mark.With mail delivery at a halt since Nov. 14, customers of major utility providers, including Enbridge Gas, Hydro One, Hydro Ottawa and Toronto Hydro, will face the risk of late fees and service interruptions if they fail to keep their accounts up to date.Those companies are urging customers to switch to e-billing, but there are still a significant amount of people who will be waiting for their bills in the mail, they say.Enbridge Gas, which serves approximately 3.9 million Ontario customers, revealed that 30 per cent of their customers still use paper billing. In an email to Global News, they note that there has been just a two per cent increase in online signups since the strike began.  Story continues below advertisement “We’ve provided several convenient options for customers to access their accounts, including our mobile app, online portal, and telephone banking,” a spokesperson said.The company has committed to waiving late fees “where appropriate,” but encourages customers to use its digital platforms to avoid penalties for missed payments due to the strike. \t\t\t\t'You are responsible'\t\t\tHydro One, serving over 1.5 million customers in the province, stated that almost half of their clientele still rely on paper billing. On their website, they acknowledge the disruption caused by the Canada Post strike, and suggest people to switch to paperless billing. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.For those who are unable to do so, the company has ensured to notify customers of statements by providing account balance updates through phone or its online customer portal. However, the utility made it clear that late fees may apply for unpaid balances.  Story continues below advertisement “You are responsible for keeping your account current,” said Hydro One in a statement. 2:13Business Matters: Minister seeks order to get striking Canada Post workers back on the jobToronto Hydro and Hydro Ottawa customers who are still on paper billing will also face penalties for late payments.“We want to remind customers they are responsible for keeping their accounts up to date,” said Hydro Ottawa spokesperson.Toronto Hydro, serving 710,000 residential customers, reported 300,000 people are still on paper bills.Although the company has introduced additional payment options for customers who wish to pay by cheque, such as droboxes at two Toronto locations, late fees will still apply if payments are not made on time. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobHow the Ford government in Ontario plans to escalate trade war with the U.S.Since the start of the strike, they have recorded 15,000 new registers for paperless billing.  Story continues below advertisement Hydro Ottawa shared similar sentiments, stating that they “have seen an increase in online billing requests, which demonstrates that customers are adapting to the situation,” Hydro Ottawa.For those unable to transition to digital payment methods, the utility companies suggest contacting them directly to discuss payment options or late fee waivers. \t\t\t\tOttawa asking labour board to intervene\t\t\tFriday marks day 29 of the Canada Post strike, and with Christmas fast approaching, there is still no apparent movement at the bargaining table.Federal labour minister Steve MacKinnon has rebuffed calls for government intervention, saying it’s up to the two sides to work out a deal.However, MacKinnon announced Friday he is asking the Canada Industrial Relations Board to send those employees back to work.He said if the board agrees the two sides are at an “impasse,” which he said he believes is the case, union members will be told to return to work until May, while an inquiry is launched to determine why the two sides cannot come to an agreement.  Story continues below advertisement Though MacKinnon said he believes the dispute is at an impasse, this week did see resolution on one thing: a labour practice complaint from the Canadian Union of Postal Workers over layoffs during the strike.The key issues in the strike by more than 55,000 workers include wages, job security and how to staff a proposed expansion into weekend delivery.— with files from Aaron D’Andrea and The Canadian Press More on LifestyleMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\t$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tBroadway Corridor density debateB.C. fruit growers asking for more supportRecord holiday season at YLWRetail analyst on 2024 holiday spending trends"
    },
    {
        "Title": "Canada Post strike: Minister seeks order to get workers back on the job",
        "Date": "Posted December 13, 2024 10:29 am",
        "Text": "Amid the ongoing Canada Post strike, federal Labour Minister Steven MacKinnon announced Friday that he is asking the Canada Industrial Relations Board (CIRB) to order workers back on the job if it agrees with his determination there is an “impasse” in negotiations.If the CIRB agrees, MacKinnon says the labour relations board would order Canada Post and all employees represented by the Canadian Union of Postal Workers to resume operations and extend the terms of the existing collective agreements until May 2025.“Not only have the parties been unable to show any progress towards an agreement, the federal mediator has now informed me that the negotiations between both parties are now, in fact, going in the wrong direction,” he said during a Friday media conference.“So I’m here today to announce that I am applying a solution to promote conditions favorable to the settlement of this labor dispute and protect the interests of all Canadians.”  Story continues below advertisement When asked about the resumption of services and whether Christmas gifts and letters could be sent, MacKinnon stated that both parties must be heard by CIRB.He emphasized that if the CIRB reaches the same conclusion as he has that the parties are at an “impasse,” he says the board could issue a directive for workers to be back by next week.The strike began on Nov. 15 after Canada Post workers and the employer failed to reach an agreement. The union was seeking wage increases, better pensions and improved health benefits. 2:02Canada Post strike: Rural communities anxious as labour dispute nears 1-month markIn the past, federal governments have used back-to-work legislation during Canada Post strikes, including in 2018 and 2011, to resolve disputes and restore essential services.In 2011, a postal worker strike was followed by a two-week lockout imposed by Canada Post management. However, the Conservative government passed back-to-work legislation to end the disruption. Similarly, in 2018, Prime Minister Justin Trudeau’s government passed back-to-work legislation to resolve another Canada Post strike.  Story continues below advertisement MacKinnon has previously said that Ottawa is not looking to force an end to the strike and that the government would remain on the sidelines. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The postal shutdown was costing small businesses millions each day, the Canadian Federation of Independent Business said, and impacting Canadians across the country.On Friday, the Canadian Union of Postal Workers (CUPW) released a statement saying it “denounces in the strongest terms this assault on our constitutionally protected right to collectively bargain and to strike.” More on CanadaMore videosCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election“This order continues a deeply troubling pattern in which the government uses its arbitrary powers to let employers off the hook, drag their feet, and refuse to bargain in good faith with workers and their unions,” the statement read.CUPW added that because it is a “rapidly developing situation” it has not had time to review all the details.“What we do know is that postal workers are being forced to return to work without new negotiated collective agreements in place,” it said, adding that it is currently reviewing the order and considering its options moving forward.Canada Post said it is also reviewing the details of MacKinnon’s announcement to ensure it is prepared to fully participate and comply.“While that unfolds, we look forward to welcoming our employees back to work and serving Canadians and customers. We will take all appropriate steps to support that process as quickly as possible given the direction provided to us by the Minister,” a spokesperson told Global News in a Friday email.  Story continues below advertisement  \t\t\t\t'Canadians are rightly fed up': minister\t\t\tAfter nearly a month of stalled negotiations, MacKinnon said he had to intervene and use his powers to try to ensure mail operations continue.The decision is not one he “takes lightly,” he said, adding that it is time to “call a time out.”“Canada Post and the Canadian Union of Postal Workers remain unable to reach an agreement. Canadians are rightly fed up,” MacKinnon said.“As the minister of labour, I have a responsibility to protect Canadians and the public’s interests while respecting the rights of the parties involved in this. That’s why I’m here to announce that I’m bringing forward a solution to promote conditions conducive to resolving this labour dispute and protect the interests of all Canadians,” he added. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesHow the Ford government in Ontario plans to escalate trade war with the U.S.The strike has impacted businesses across the nation, with Canada Post unable to process an estimated one million parcels a day. MacKinnon called the disruption “detrimental” to businesses, causing “economic harm” with each passing day.  Story continues below advertisement He also noted that the strike has affected charities during the holiday season, as fundraising efforts have been “jeopardized” by the ongoing dispute.The idea now is to extend the terms of their existing collective agreements until May 22, 2025.During this time, he said an Industrial Inquiry Commission (ICC) would be established, with William Kaplan, an arbitration and mediation lawyer, appointed as the commissioner. 2:11Canada Post lost nearly $750M last year, future now uncertain“The commissioner will be tasked with examining the structural issues preventing the resolution of the current labour dispute. The IIC will be required to submit a report to me and the parties outlining their findings and recommendations by May 15, 2025,” MacKinnon said.“The review could provide the basis of a path forward on how to amend the collective agreements and clarify the structures, rights and responsibilities of the parties in collective bargaining. The inquiry will have a broad scope, as it will examine the entire structure of Canada Post from both the customer and business model standpoint. Considering the challenging business environment now facing Canada Post.”  Story continues below advertisement The chair of Canada Post warned in August that the Crown corporation is at a “critical juncture” and its financial situation is “unsustainable.”The Crown corporation’s latest annual report used similar language, noting it has recorded “significant” annual losses since 2018. Last year’s loss was the second-largest on record, at $748 million.The Canadian Federation of Independent Business (CFIB) said Friday that it is relieved to learn the government is taking action to get Canada Post workers back on the job.“It appears the Canada Industrial Relations Board (CIRB) will have 72 hours to do its work before issuing a back to work order on Monday. This means Canada Post workers would be back on the job sometime next week at the earliest,” CFIB president Dan Kelly said in a media release.“This will be too late to salvage any of the Christmas holiday season for small businesses. With a massive backlog, it will be nearly impossible for any new shipments to make it to Canadians before Christmas through Canada Post,” he said.But, he added, the temporary order will help businesses that are desperately waiting for cheque-based payments from other business customers. Millions of dollars have been frozen in the mail making it difficult for small firms to pay their bills.— With files from the Canadian Press  Advertisement "
    },
    {
        "Title": "Trump says it’s ‘fine’ after Ford threat to cut energy to border states",
        "Date": "Posted December 12, 2024 6:11 pm",
        "Text": "U.S. president-elect Donald Trump was asked about Ontario Premier Doug Ford’s recent warning that the province could cut off energy exports to about 1.5 million Americans if Trump lays threatened tariffs on Canada next month, saying Thursday it was “fine.”On Wednesday, following a meeting between premiers and Prime Minister Justin Trudeau, Ford said he believed there was a “100 per cent” chance 25-per-cent tariffs threatened by Trump would be imposed in January on Canada. Ford countered with a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.“That’s OK if he does that, that’s fine,” Trump told a CNBC reporter on the floor of the New York Stock Exchange. “The United States is subsidizing Canada, it’s truly a subsidy and we shouldn’t have to do that.”  Story continues below advertisement Trump claimed the U.S. subsidizes Canada more than US$100 billion a year, though he did not specify where that number came from and made similar remarks in 2018.Subsidies are defined by the International Monetary Fund as “a transfer of resources from a government to a domestic entity without an equivalent contribution in return.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The IMF notes subsidies can “take many forms, including direct grants to domestic companies, tax incentives, or favorable terms for financing.”It’s not clear if Trump’s claims relate to trade deficits, which is when a country buys more than it sells to another country, or direct investment, either.The Office of the U.S. Trade Representative says that “the U.S. goods and services trade deficit with Canada was $53.5 billion in 2022.”Statistics Canada says that direct investment from Canada into the U.S. in 2023 was $1.1 trillion while U.S. direct investment in Canada was $618.2 billion.“In 2023, Canada’s exports of services to the United States increased 7.2% to $107.2 billion, while imports of services from the United States advanced 8.7% to $121.0 billion,” Statistics Canada also said last month.  3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: FordShortly after his re-election, Trump threatened to impose 25-per cent tariffs on all imported goods from Canada and Mexico if both countries do not address illegal immigration and fentanyl trafficking into the U.S.  Story continues below advertisement Since then, Ford and Canada’s premiers have held meetings with the federal government to discuss potential responses, with Trudeau sharing an “overview” Wednesday of his government’s plan to strengthen border security in response to the tariff threat.Sources outlined four potential measures from Ford that Ontario could pursue to Global News:Restricting electricity exports to Michigan, New York and Minnesota — each of which share a border with OntarioRestricting exports of Canadian critical minerals required for electric vehicle batteries and supply chainRestricting U.S.-based companies from the Government of Ontario’s procurement processRestricting the LCBO, the largest purchaser of alcohol in the world, from buying American-made alcoholSources in the Ford government describe the measure as “escalation maneuvers” that are still being fleshed out.—with files from Global News’ Colin D’Mello, Isaac Callan and Sean Boynton Related NewsHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tTrudeau shares border plan with premiers in meeting on Trump tariff response\t\t\t\t\t"
    },
    {
        "Title": "How the Ford government in Ontario plans to escalate trade war with the U.S.",
        "Date": "Posted December 12, 2024 6:00 am",
        "Text": "Cutting off power to 1.5 million Americans, restricting imports of U.S.-made alcohol, and limiting exports of Canadian critical minerals are among the list of measures the Ford government is considering if a looming trade war with the incoming Trump administration escalates in the new year.On Wednesday, Premier Doug Ford, along with other Canadian premiers, met with Prime Minister Justin Trudeau to discuss the 25 per cent tariffs U.S. President-Elect Donald Trump has threatened to impose on all Canadian imports.After the meeting, Ford, who now believes there is a “100 per cent” chance that tariffs will be imposed in early January, offered a threat of his own: to “cut off” millions of American residents living in border states from Ontario’s energy exports.“It would turn off the lights to a million-and-a-half Americans,” Ford told Global News. “If they come at us we have to stand up for Canadians, we have to stand up for Ontarians.”  Story continues below advertisement  \t\t\t\tOntario is 'sending a message': Ford\t\t\tSources outlined four potential measures: Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Restricting electricity exports to Michigan, New York State and MinnesotaRestricting exports of Canadian critical minerals required for electric vehicle batteries and supply chainRestricting U.S.-based companies from the Government of Ontario’s procurement processRestricting the LCBO, the largest purchaser of alcohol in the world, from buying American-made alcoholSources in the Ford government describe the measures as “escalation maneuvres” that are still being fleshed out.One source added the government is “deadly serious” about the approach, even if the Premier offered personal reservations about cutting off the power supply to millions of American homes and businesses.Some of the measures would also come at a cost the Ontario’s economy.For example, the energy restriction policy, conceived by the Ministry of Economic Development and Trade, could cost the provincial treasury $400-$700 million in lost revenue.  Story continues below advertisement Sources pointed out, however, the economic impact to Ontario’s southern neighbours is estimated to be in the billions. The Associated Press reported that about 85 per cent of electricity imported to the U.S. comes from Canadian generation.Another source suggested the province could join forces with other provinces to maximize the pain.“Shutting off its electricity is one thing,” the source said. “Ontario and Quebec shutting off electricity is entirely another thing.” 2:34Doug Ford in impromptu interview during Global News broadcastAt a news conference Thursday, Ford told reporters the province is “sending a message” to the U.S.“You come in and attack Ontario … we’re going to use every tool in our toolbox to defend Ontarians and Canadians across the border,” he said.“Let’s hope that never comes to that point.”  Story continues below advertisement Ford went on to point the finger at Mexico — a claim he’s made in the past — for reportedly allowing Chinese companies to bypass CUSMA rules and export vehicles and parts into the U.S. and Canada through Mexican-built manufacturing plants.“That’s the problem, and as I said yesterday, it’s very clear: Mexico has a choice to stand with Beijing or stand with Washington,” he added.— with files from Aaron D’Andrea Related NewsDoug Ford in impromptu interview during Global News broadcast\t\t\t\t\t"
    },
    {
        "Title": "None",
        "Date": "None",
        "Text": "None"
    },
    {
        "Title": "Canada Post strike: Ontario utilities warn of penalties as millions await bills",
        "Date": "Posted December 13, 2024 8:30 am",
        "Text": "Millions of Ontarians who rely on paper billing for their utilities may find themselves in a bind as the ongoing Canada Post strike hits the one month mark.With mail delivery at a halt since Nov. 14, customers of major utility providers, including Enbridge Gas, Hydro One, Hydro Ottawa and Toronto Hydro, will face the risk of late fees and service interruptions if they fail to keep their accounts up to date.Those companies are urging customers to switch to e-billing, but there are still a significant amount of people who will be waiting for their bills in the mail, they say.Enbridge Gas, which serves approximately 3.9 million Ontario customers, revealed that 30 per cent of their customers still use paper billing. In an email to Global News, they note that there has been just a two per cent increase in online signups since the strike began.  Story continues below advertisement “We’ve provided several convenient options for customers to access their accounts, including our mobile app, online portal, and telephone banking,” a spokesperson said.The company has committed to waiving late fees “where appropriate,” but encourages customers to use its digital platforms to avoid penalties for missed payments due to the strike. \t\t\t\t'You are responsible'\t\t\tHydro One, serving over 1.5 million customers in the province, stated that almost half of their clientele still rely on paper billing. On their website, they acknowledge the disruption caused by the Canada Post strike, and suggest people to switch to paperless billing. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.For those who are unable to do so, the company has ensured to notify customers of statements by providing account balance updates through phone or its online customer portal. However, the utility made it clear that late fees may apply for unpaid balances.  Story continues below advertisement “You are responsible for keeping your account current,” said Hydro One in a statement. 2:13Business Matters: Minister seeks order to get striking Canada Post workers back on the jobToronto Hydro and Hydro Ottawa customers who are still on paper billing will also face penalties for late payments.“We want to remind customers they are responsible for keeping their accounts up to date,” said Hydro Ottawa spokesperson.Toronto Hydro, serving 710,000 residential customers, reported 300,000 people are still on paper bills.Although the company has introduced additional payment options for customers who wish to pay by cheque, such as droboxes at two Toronto locations, late fees will still apply if payments are not made on time. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobHow the Ford government in Ontario plans to escalate trade war with the U.S.Since the start of the strike, they have recorded 15,000 new registers for paperless billing.  Story continues below advertisement Hydro Ottawa shared similar sentiments, stating that they “have seen an increase in online billing requests, which demonstrates that customers are adapting to the situation,” Hydro Ottawa.For those unable to transition to digital payment methods, the utility companies suggest contacting them directly to discuss payment options or late fee waivers. \t\t\t\tOttawa asking labour board to intervene\t\t\tFriday marks day 29 of the Canada Post strike, and with Christmas fast approaching, there is still no apparent movement at the bargaining table.Federal labour minister Steve MacKinnon has rebuffed calls for government intervention, saying it’s up to the two sides to work out a deal.However, MacKinnon announced Friday he is asking the Canada Industrial Relations Board to send those employees back to work.He said if the board agrees the two sides are at an “impasse,” which he said he believes is the case, union members will be told to return to work until May, while an inquiry is launched to determine why the two sides cannot come to an agreement.  Story continues below advertisement Though MacKinnon said he believes the dispute is at an impasse, this week did see resolution on one thing: a labour practice complaint from the Canadian Union of Postal Workers over layoffs during the strike.The key issues in the strike by more than 55,000 workers include wages, job security and how to staff a proposed expansion into weekend delivery.— with files from Aaron D’Andrea and The Canadian Press More on LifestyleMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\t$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tBroadway Corridor density debateB.C. fruit growers asking for more supportRecord holiday season at YLWRetail analyst on 2024 holiday spending trends"
    },
    {
        "Title": "Canada Post strike: Minister seeks order to get workers back on the job",
        "Date": "Posted December 13, 2024 10:29 am",
        "Text": "Amid the ongoing Canada Post strike, federal Labour Minister Steven MacKinnon announced Friday that he is asking the Canada Industrial Relations Board (CIRB) to order workers back on the job if it agrees with his determination there is an “impasse” in negotiations.If the CIRB agrees, MacKinnon says the labour relations board would order Canada Post and all employees represented by the Canadian Union of Postal Workers to resume operations and extend the terms of the existing collective agreements until May 2025.“Not only have the parties been unable to show any progress towards an agreement, the federal mediator has now informed me that the negotiations between both parties are now, in fact, going in the wrong direction,” he said during a Friday media conference.“So I’m here today to announce that I am applying a solution to promote conditions favorable to the settlement of this labor dispute and protect the interests of all Canadians.”  Story continues below advertisement When asked about the resumption of services and whether Christmas gifts and letters could be sent, MacKinnon stated that both parties must be heard by CIRB.He emphasized that if the CIRB reaches the same conclusion as he has that the parties are at an “impasse,” he says the board could issue a directive for workers to be back by next week.The strike began on Nov. 15 after Canada Post workers and the employer failed to reach an agreement. The union was seeking wage increases, better pensions and improved health benefits. 2:02Canada Post strike: Rural communities anxious as labour dispute nears 1-month markIn the past, federal governments have used back-to-work legislation during Canada Post strikes, including in 2018 and 2011, to resolve disputes and restore essential services.In 2011, a postal worker strike was followed by a two-week lockout imposed by Canada Post management. However, the Conservative government passed back-to-work legislation to end the disruption. Similarly, in 2018, Prime Minister Justin Trudeau’s government passed back-to-work legislation to resolve another Canada Post strike.  Story continues below advertisement MacKinnon has previously said that Ottawa is not looking to force an end to the strike and that the government would remain on the sidelines. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The postal shutdown was costing small businesses millions each day, the Canadian Federation of Independent Business said, and impacting Canadians across the country.On Friday, the Canadian Union of Postal Workers (CUPW) released a statement saying it “denounces in the strongest terms this assault on our constitutionally protected right to collectively bargain and to strike.” More on CanadaMore videosCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\t‘We need to make a deal,’ Ford says after Trump responds to energy threat\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election“This order continues a deeply troubling pattern in which the government uses its arbitrary powers to let employers off the hook, drag their feet, and refuse to bargain in good faith with workers and their unions,” the statement read.CUPW added that because it is a “rapidly developing situation” it has not had time to review all the details.“What we do know is that postal workers are being forced to return to work without new negotiated collective agreements in place,” it said, adding that it is currently reviewing the order and considering its options moving forward.Canada Post said it is also reviewing the details of MacKinnon’s announcement to ensure it is prepared to fully participate and comply.“While that unfolds, we look forward to welcoming our employees back to work and serving Canadians and customers. We will take all appropriate steps to support that process as quickly as possible given the direction provided to us by the Minister,” a spokesperson told Global News in a Friday email.  Story continues below advertisement  \t\t\t\t'Canadians are rightly fed up': minister\t\t\tAfter nearly a month of stalled negotiations, MacKinnon said he had to intervene and use his powers to try to ensure mail operations continue.The decision is not one he “takes lightly,” he said, adding that it is time to “call a time out.”“Canada Post and the Canadian Union of Postal Workers remain unable to reach an agreement. Canadians are rightly fed up,” MacKinnon said.“As the minister of labour, I have a responsibility to protect Canadians and the public’s interests while respecting the rights of the parties involved in this. That’s why I’m here to announce that I’m bringing forward a solution to promote conditions conducive to resolving this labour dispute and protect the interests of all Canadians,” he added. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesHow the Ford government in Ontario plans to escalate trade war with the U.S.The strike has impacted businesses across the nation, with Canada Post unable to process an estimated one million parcels a day. MacKinnon called the disruption “detrimental” to businesses, causing “economic harm” with each passing day.  Story continues below advertisement He also noted that the strike has affected charities during the holiday season, as fundraising efforts have been “jeopardized” by the ongoing dispute.The idea now is to extend the terms of their existing collective agreements until May 22, 2025.During this time, he said an Industrial Inquiry Commission (ICC) would be established, with William Kaplan, an arbitration and mediation lawyer, appointed as the commissioner. 2:11Canada Post lost nearly $750M last year, future now uncertain“The commissioner will be tasked with examining the structural issues preventing the resolution of the current labour dispute. The IIC will be required to submit a report to me and the parties outlining their findings and recommendations by May 15, 2025,” MacKinnon said.“The review could provide the basis of a path forward on how to amend the collective agreements and clarify the structures, rights and responsibilities of the parties in collective bargaining. The inquiry will have a broad scope, as it will examine the entire structure of Canada Post from both the customer and business model standpoint. Considering the challenging business environment now facing Canada Post.”  Story continues below advertisement The chair of Canada Post warned in August that the Crown corporation is at a “critical juncture” and its financial situation is “unsustainable.”The Crown corporation’s latest annual report used similar language, noting it has recorded “significant” annual losses since 2018. Last year’s loss was the second-largest on record, at $748 million.The Canadian Federation of Independent Business (CFIB) said Friday that it is relieved to learn the government is taking action to get Canada Post workers back on the job.“It appears the Canada Industrial Relations Board (CIRB) will have 72 hours to do its work before issuing a back to work order on Monday. This means Canada Post workers would be back on the job sometime next week at the earliest,” CFIB president Dan Kelly said in a media release.“This will be too late to salvage any of the Christmas holiday season for small businesses. With a massive backlog, it will be nearly impossible for any new shipments to make it to Canadians before Christmas through Canada Post,” he said.But, he added, the temporary order will help businesses that are desperately waiting for cheque-based payments from other business customers. Millions of dollars have been frozen in the mail making it difficult for small firms to pay their bills.— With files from the Canadian Press  Advertisement "
    },
    {
        "Title": "Canada Post strike tests public support heading into holidays: experts",
        "Date": "Posted December 13, 2024 8:20 am",
        "Text": "Public support is key to the success of a strike, experts say, but as the Canada Post strike drags on, that support is likely getting harder to maintain.“As strikes wear on, they become more difficult to sustain, and if the public is not rallying behind you, it can be demoralizing for the union,” said Brock University labour professor Larry Savage.More than 55,000 postal workers are off the job in a strike that has lasted over four weeks.Federal mediation was paused more than two weeks ago as the two sides were too far apart, and though proposals have been exchanged recently, it’s not clear that they’re any closer to reaching a deal, with Canada Post and the union criticizing each others’ demands and comments in public statements.Meanwhile, calls from the business community for government intervention have been rebuffed. Labour Minister Steven MacKinnon has consistently said the two parties have a responsibility to come to the table and hammer out a deal.  Story continues below advertisement  1:59‘I’m losing sleep’: Canada Post strike causes unexpected travel woesCanadian Union of Postal Workers negotiator Jim Gallant says on the picket lines, Canada Post workers are getting the support they need — plus coffee, doughnuts, fried chicken, knitted hats and socks, and even turkeys from citizens.But Savage said he feels overall public opinion has been mixed so far on the strike.“It’s not clear to me that either party is winning the war of public opinion,” he said.“(It) seems like a good chunk of people seem to not care about the strike, but those who do seem evenly split between Canada Post and the union. And I think lots of people are just frustrated and surprised that the strike has lasted this long.” Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.That divide was reflected in a recent Angus Reid poll, though it was conducted during the third week of the work stoppage. The survey of just over 3,000 Canadians found 34 per cent sided with Canada Post and its demands, while 29 per cent stood with the union. The rest were unsure, or didn’t support either side.  Story continues below advertisement Social media posts reflect the mixed opinions, with some people expressing frustration with the disruption and others proclaiming their support for the striking postal workers.Adam King, an assistant professor in the labour studies department at the University of Manitoba, said online discourse doesn’t tell the whole story.“It takes very little effort to post a comment on a story, but it takes much more to show up to a picket line,” he said.On the picket lines King has seen in Winnipeg, “CUPW has received lots of support,” he said, from the labour movement and the public.King and Savage said there’s been a broader trend of higher public support for striking workers in recent years. 0:29Canada Post, union resolve complaint over temporary layoffs“The fact that Canada Post isn’t a profit-making, billionaire-owned company complicates it a little bit, because it’s easier to go after a grocery baron, for example, than Canada Post,” said Savage.  Story continues below advertisement But both said even for the public sector, which Canadians historically have had less support for amid labour disputes, the public has been surprisingly onside over the past couple of years.“I think the public has been generally very understanding and receptive of workers’ demands coming out of the pandemic,” said King.“I think there was a level of understanding that maybe wasn’t there in previous years, that people really do understand that people are in a crunch, union members are in a cost of living squeeze, and they’re sympathetic to their demands.” Trending NowSaskatchewan Premier Scott Moe calls for federal electionCanada Post strike: Minister seeks order to get workers back on the jobAs the Canada Post strike drags on, “I think there might be maybe some shifts in public opinion, and it might be harder to maintain, especially as the Christmas season approaches,” said King. More on MoneyMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\t‘Stubborn’ fixed mortgage rates might not fall despite Bank of Canada cut\t\t\t\t\tCannabis-impaired driving on the rise in Ontario, CAA study findsConcern around new NSLC Cannabis ad campaignThe dangers of illegal cannabisRCMP warning about cannabis laced candy productsBut for the most part, “I would fit this strike into that longer pattern” of stronger support for striking workers, he said.Gallant said as the strike continues, there’s a lot of pressure on both sides to reach a deal.“We don’t want to be the people that ruin Christmas,” he said.Business associations have called for government intervention, saying the strike is harming business owners during the key holiday season.The day the strike started, Shopify CEO Tobi Lütke posted on X that Canada Post is an essential service and shouldn’t be allowed to go on strike.  Story continues below advertisement But strikes are meant to disrupt “business as usual,” Savage pointed out — the anger of customers and business owners is intended to pressure employers to reach a deal. 2:00Health Matters: Canada Post workers seek improved health and safety measures on the jobHowever, strikes “also risk alienating the public,” added Savage.“The trick is for the union to align its demands with the interests of the public. And that is like … walking a tightrope,” said Savage.Bea Bruske, president of the Canadian Labour Congress, said public support is important for workers during strikes because it not only boosts morale on the picket line, it puts pressure on the employer to come to the table.“I mean, they are really stuck, but there’s pressure all the way around. There’s pressure on the employer, and there’s pressure on the union as well,” she said.  Story continues below advertisement When a strike goes on for multiple weeks, “it’s harder to see the end of the road,” said Bruske.Groups within the labour movement like the Canadian Labour Congress try to keep the momentum going through social media, email campaigns and speaking to the media, she said.“Making sure that you maintain that momentum and that public support for the issue is critically important.” "
    },
    {
        "Title": "Trump to China’s Xi : Come to my inauguration",
        "Date": "Posted December 13, 2024 8:49 am",
        "Text": "U.S. President-elect Donald Trump has invited Chinese President Xi Jinping and other foreign leaders to his inauguration next month in Washington, a Trump transition spokesperson said on Thursday, but experts said that Xi was not likely to attend.Asked if Xi had responded, Karoline Leavitt told Fox News in an interview that was “to be determined.” She did not name the other world leaders who were also invited.“This is an example of President Trump creating an open dialog with leaders of countries that are not just our allies but our adversaries and our competitors, too,” Leavitt added.It would be unprecedented for a leader of China, a top U.S. geopolitical rival, to attend a U.S. presidential inauguration and China experts said it was highly unlikely that Xi would come to Washington.“This is diplomatic theater, nothing more. Other heads of state, let alone Xi Jinping, haven’t attended U.S. Presidential inaugurations,” said Scott Kennedy, a China specialist at Washington’s Center for Strategic and International Studies.  Story continues below advertisement  2:10Tit for tat? Premiers divided on response to Trump’s tariff vowTrump, in remarks to CNBC on the floor of the New York Stock Exchange on Thursday, said his administration would be having “a lot of talks with China.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“We have a good relationship with China. I have a surprising relationship. Now, when the COVID came in, I sort of cut it off. That was a step too far,” he said.“But we’ve been talking and discussing with President Xi, some things, and others, other world leaders, and I think we’re going to do very well all around.”The Kremlin separately on Thursday said that it had not received an invitation to attend the Jan. 20 inauguration.The offer for Xi to attend Trump’s swearing-in was extended in early November, shortly after the Nov. 5 presidential election, according to CBS News, which first reported the invitation on Wednesday.  Story continues below advertisement CBS said Hungary’s far-right leader, Prime Minister Viktor Orbán, who has a warm relationship with Trump and visited him in Florida this week, was “still considering” whether to attend,The Chinese embassy has not responded to a Reuters request for comment. \t\t\t\tTensions over trade, taiwan\t\t\tTrump has named numerous China hawks to key posts in his incoming administration, including Senator Marco Rubio as secretary of state. Trending NowSaskatchewan Premier Scott Moe calls for federal electionYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegTrump has also said he will impose an additional 10% tariff on Chinese goods unless Beijing does more to stop trafficking of the highly addictive narcotic fentanyl. He threatened tariffs in excess of 60% on Chinese goods while on the campaign trail.In late November, China’s state media warned Trump that his tariff threat could drag the world’s top two economies into a mutually destructive tariff war.  Story continues below advertisement On Wednesday, China’s U.S. Ambassador Xie Feng read a letter from Xi to a U.S.-China Business Council gala in Washington, in which the Chinese leader said Beijing was prepared to stay in communication with the U.S.“We should choose dialog over confrontation and win-win cooperation over zero-sum games,” Xi said in the letter.Other China experts said China could respond to Trump’s invitation by offering to send a lower level official, but would likely demand that self-governed Taiwan, which China claims as its own territory, not be invited.Taiwan, which the United States does not officially recognize, is likely to be uneasy about Trump’s invitation to Xi, said Bonnie Glaser, a Taiwan expert at the German Marshall Fund of the United States. 3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: FordTrump’s electoral win sparked hope in Taiwan that he will pursue a tough line with China but also anxiety given his comments that the island should pay the U.S. for its defense.  Story continues below advertisement Two senior members of Taiwan’s government have been in the United States this week to meet people connected to Trump’s transition team, five sources told Reuters. More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tLarge, unknown drone sightings over eastern US being ‘closely’ tracked, White House saysAlberta unveils red zone border patrol plan to combat illegal activityTrump named Time’s ‘Person of the Year’ for 2nd time: ‘I think I like it better this time’‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energy"
    },
    {
        "Title": "Canada Post strike tests public support heading into holidays: experts",
        "Date": "Posted December 13, 2024 8:20 am",
        "Text": "Public support is key to the success of a strike, experts say, but as the Canada Post strike drags on, that support is likely getting harder to maintain.“As strikes wear on, they become more difficult to sustain, and if the public is not rallying behind you, it can be demoralizing for the union,” said Brock University labour professor Larry Savage.More than 55,000 postal workers are off the job in a strike that has lasted over four weeks.Federal mediation was paused more than two weeks ago as the two sides were too far apart, and though proposals have been exchanged recently, it’s not clear that they’re any closer to reaching a deal, with Canada Post and the union criticizing each others’ demands and comments in public statements.Meanwhile, calls from the business community for government intervention have been rebuffed. Labour Minister Steven MacKinnon has consistently said the two parties have a responsibility to come to the table and hammer out a deal.  Story continues below advertisement  1:59‘I’m losing sleep’: Canada Post strike causes unexpected travel woesCanadian Union of Postal Workers negotiator Jim Gallant says on the picket lines, Canada Post workers are getting the support they need — plus coffee, doughnuts, fried chicken, knitted hats and socks, and even turkeys from citizens.But Savage said he feels overall public opinion has been mixed so far on the strike.“It’s not clear to me that either party is winning the war of public opinion,” he said.“(It) seems like a good chunk of people seem to not care about the strike, but those who do seem evenly split between Canada Post and the union. And I think lots of people are just frustrated and surprised that the strike has lasted this long.” Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.That divide was reflected in a recent Angus Reid poll, though it was conducted during the third week of the work stoppage. The survey of just over 3,000 Canadians found 34 per cent sided with Canada Post and its demands, while 29 per cent stood with the union. The rest were unsure, or didn’t support either side.  Story continues below advertisement Social media posts reflect the mixed opinions, with some people expressing frustration with the disruption and others proclaiming their support for the striking postal workers.Adam King, an assistant professor in the labour studies department at the University of Manitoba, said online discourse doesn’t tell the whole story.“It takes very little effort to post a comment on a story, but it takes much more to show up to a picket line,” he said.On the picket lines King has seen in Winnipeg, “CUPW has received lots of support,” he said, from the labour movement and the public.King and Savage said there’s been a broader trend of higher public support for striking workers in recent years. 0:29Canada Post, union resolve complaint over temporary layoffs“The fact that Canada Post isn’t a profit-making, billionaire-owned company complicates it a little bit, because it’s easier to go after a grocery baron, for example, than Canada Post,” said Savage.  Story continues below advertisement But both said even for the public sector, which Canadians historically have had less support for amid labour disputes, the public has been surprisingly onside over the past couple of years.“I think the public has been generally very understanding and receptive of workers’ demands coming out of the pandemic,” said King.“I think there was a level of understanding that maybe wasn’t there in previous years, that people really do understand that people are in a crunch, union members are in a cost of living squeeze, and they’re sympathetic to their demands.” Trending NowSaskatchewan Premier Scott Moe calls for federal electionCanada Post strike: Minister seeks order to get workers back on the jobAs the Canada Post strike drags on, “I think there might be maybe some shifts in public opinion, and it might be harder to maintain, especially as the Christmas season approaches,” said King. More on MoneyMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\t‘Stubborn’ fixed mortgage rates might not fall despite Bank of Canada cut\t\t\t\t\tCannabis-impaired driving on the rise in Ontario, CAA study findsConcern around new NSLC Cannabis ad campaignThe dangers of illegal cannabisRCMP warning about cannabis laced candy productsBut for the most part, “I would fit this strike into that longer pattern” of stronger support for striking workers, he said.Gallant said as the strike continues, there’s a lot of pressure on both sides to reach a deal.“We don’t want to be the people that ruin Christmas,” he said.Business associations have called for government intervention, saying the strike is harming business owners during the key holiday season.The day the strike started, Shopify CEO Tobi Lütke posted on X that Canada Post is an essential service and shouldn’t be allowed to go on strike.  Story continues below advertisement But strikes are meant to disrupt “business as usual,” Savage pointed out — the anger of customers and business owners is intended to pressure employers to reach a deal. 2:00Health Matters: Canada Post workers seek improved health and safety measures on the jobHowever, strikes “also risk alienating the public,” added Savage.“The trick is for the union to align its demands with the interests of the public. And that is like … walking a tightrope,” said Savage.Bea Bruske, president of the Canadian Labour Congress, said public support is important for workers during strikes because it not only boosts morale on the picket line, it puts pressure on the employer to come to the table.“I mean, they are really stuck, but there’s pressure all the way around. There’s pressure on the employer, and there’s pressure on the union as well,” she said.  Story continues below advertisement When a strike goes on for multiple weeks, “it’s harder to see the end of the road,” said Bruske.Groups within the labour movement like the Canadian Labour Congress try to keep the momentum going through social media, email campaigns and speaking to the media, she said.“Making sure that you maintain that momentum and that public support for the issue is critically important.” "
    },
    {
        "Title": "Cold weather clothing essentials for kids",
        "Date": "Posted December 13, 2024 7:00 am",
        "Text": "When the snow starts to fall, it’s the little one’s cue to get the winter gear on. Get them cold-weather ready with all the essentials they need to get the most out of this festive season. From cute matching mitten and glove sets, to little luxe puffer coats, we’ve got it all and we’re not gatekeeping these adorable finds.  \t\t\t\t\t\tKids Winter Knitted Pom Beanie Hat\t\t\t\t\t\t\t\t\t\tBeautifully and softly knitted, this faux fur beanie hat will be a staple winter accessory for your kid to enjoy the outdoor wintery fun.\t\t\t\t\t\t\t\t\t\t$23.99 on Amazon (was $25.99)\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tMango Pocket Quilted Jacket\t\t\t\t\t\t\t\t\t\tThis cloud-like quilted Mango jacket has a turtleneck design and large pockets, all while being long enough to keep toasty.\t\t\t\t\t\t\t\t\t\t$119.99 at Mango\t\t\t\t\t  \t\t\t\t\t\tNike Sportswear Lightweight Synthetic Fill\t\t\t\t\t\t\t\t\t\tThis Nike jacket is made from insulated fabric with a smooth, matte finish and will be your best friend this winter. The sleeves are lined with with extra fabric for maximum warmth and comfort.\t\t\t\t\t\t\t\t\t\t$110 at Nike\t\t\t\t\t  \t\t\t\t\t\tBeanie Hats Scarfs Gloves Set\t\t\t\t\t\t\t\t\t\tEveryone needs a matching set and your little one will love this adorable koala hat mitten and gloves set. Made from thick fabric and super soft.\t\t\t\t\t\t\t\t\t\t$29.99 on Amazon\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tUGG Classic Mini Boots\t\t\t\t\t\t\t\t\t\tForever a classic, these kids classic mini boots come in toddler and kid sizes so play time doesn’t have to end early for your little snow-lover. Made with sheepskin lining, super warm and comfortable on your feet.\t\t\t\t\t\t\t\t\t\tBuy on Amazon\t\t\t\t\t  \t\t\t\t\t\tMoncler Marat Down Jacket\t\t\t\t\t\t\t\t\t\tSnuggle up in The Marat — a cloud-like jacket made from recycled nylon that keeps you warm and light, with cozy details like a snug hood and handy zip pockets.\t\t\t\t\t\t\t\t\t\t$1265 at Holt Renfrew\t\t\t\t\t  \t\t\t\t\t\tMetallic puffer jacket\t\t\t\t\t\t\t\t\t\tIf you’re looking for a standout piece, this metallic puffer comes in a light champagne hue and was made to totally turn heads.\t\t\t\t\t\t\t\t\t\t$119.99 at Mango\t\t\t\t\t  Story continues below advertisement You may also like: Get weekly The Curator newsBe in the know before you buy - Stay up to date with the latest trends, get expert recommendations, tips, and shopping guides.Sign up for weekly The Curator newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Roots Kid Classic Cabin Ankle Sock 3 Pack – $19.50The North Face Beanie – $43.95Columbia girls Heavenly Long Jacket – $104.99 – $318.33Kamik Baby Boy’s Boots – $160Boys Snow Boots – $49.88Disposable Hand Warmers – $34.99  \t\t\t\t\t\tKids Wool Bomber Jacket\t\t\t\t\t\t\t\t\t\tThis sherpa-collar bomber jacket from Gap is made from a wool-blend, offering warmth and lightweight comfort — perfect for the kid on the go.\t\t\t\t\t\t\t\t\t\t$79.00 at Gap Canada (was $158.00)\t\t\t\t\t  \t\t\t\t\t\tMango Quilted gilet with hood\t\t\t\t\t\t\t\t\t\tAdorned with gold button detailing, this simple yet sleek hooded vest pairs well with any long-sleeve sweatshirt for those milder winter days.\t\t\t\t\t\t\t\t\t\t$59.99 at Mango\t\t\t\t\t More Recommendations15 mini gifts that make a big impact Story continues below advertisement   \t\t\t\t\t\tUniqlo Heattech Ultra Warm Crew Neck T-Shirt\t\t\t\t\t\t\t\t\t\tLong-sleeve tops are always a winter essential, and these heattech ultra warm crew neck t-shirts from Uniqlo are going to be your kids new go-to everyday staple. Moisture-wicking and the thickest option in the kids heattech collection, it’s the perfect time to stock up on these high-tech basics.\t\t\t\t\t\t\t\t\t\t$24.90 at Uniqlo\t\t\t\t\t  \t\t\t\t\t\tPolo Ralph Lauren Baby Boy's Combed Cotton Button-Front Cardigan\t\t\t\t\t\t\t\t\t\tKeep your little one looking undeniably dapper with Polo Ralph Lauren’s combed cotton cardigan, featuring classic button-front charm and an irresistibly soft touch.\t\t\t\t\t\t\t\t\t\t$86.00 at Saks Fifth Avenue\t\t\t\t\t \t\t\t\t\t\tWaterproof Toddler Snowsuit\t\t\t\t\t\t\t\t\t\tThis adorable snowsuit will keep your toddler warm and dry with its high-quality polyester fill, waterproof and windproof fabric, and easy zipper closure.\t\t\t\t\t\t\t\t\t\t$48.98 on Amazon\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tDeux Par Deux Two Piece Snowsuit\t\t\t\t\t\t\t\t\t\tNeed something a little more heavy-duty? This snowsuit has adjustable features and ski-gear-ready pockets ensure a perfect fit and seal in warmth while keeping moisture out.\t\t\t\t\t\t\t\t\t\t$298.00 at deux par deux\t\t\t\t\t  \t\t\t\t\t\tSorel Unisex Snow Commander Boots\t\t\t\t\t\t\t\t\t\tLet your little explorer stomp through snow, mud, or grass with these Sorel winter boots — featuring a waterproof shell, fleece lining, and great traction.\t\t\t\t\t\t\t\t\t\t$68 on Amazon\t\t\t\t\t  \t\t\t\t\t\tKids Wool Socks\t\t\t\t\t\t\t\t\t\tThese wool socks come in a variety of festive winter designs and are extra thick to combat snow and slushy playtime.\t\t\t\t\t\t\t\t\t\t$24.99 on Amazon\t\t\t\t\t  Story continues below advertisement You may also like:Kids Winter Thermal Top – $26.99Nike Sportswear Club Fleece Girls High-Waisted Fitted Trousers – $50Kids Fleece Ski Face Mask – $21.99Canada Goose Logan Down Parka – $895Thick Wool Beanie – $10.65 More from The Curator10 Last-Minute Gifts That Will Arrive on Time\t\t\t\t\t14 Canadian gifts to give this holiday season\t\t\t\t\tGifting goals: The best picks for every budget\t\t\t\t\t"
    },
    {
        "Title": "Canadians concerned country’s children are too soft, with no coping skills: survey",
        "Date": "Posted December 12, 2024 6:37 pm",
        "Text": "A Scouts Canada survey found that most Canadians are concerned that children aged 10 to 21 are too soft and have not been taught appropriate coping skills to navigate their future.The survey, which included 1,000 Canadians, uncovered that social media channels, screens and lack of development, social/peer pressure, video games and helicopter parenting are the biggest dangers to kids today.Just over a third of those surveyed are not confident that the kids aged 10 to 21 will be able to get jobs in the future and grow into successful adults.When it comes to different generations, almost 75 per cent of those surveyed said parents in Gen X (1965-1976), Millennial (1977-1995) and Generation Z (1996-2010) have been “too soft” on their children.Canadians say the top skills kids aged 10 to 21 do not have are stress coping skills, basic etiquette problem solving and the ability to say thank you.  Story continues below advertisement Almost 100 per cent of those polled said kids have had a disadvantage growing up during COVID. 5:07The Bad Parents podcasters share their holiday survival guideDr. Ashley Miller, a clinical associate professor of psychiatry at the University of British Columbia, told Global News that it is very difficult to be a parent these days. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“That’s not necessarily because of parenting style, but because of overall stress in society and also just lack of supports for most parents of young kids especially,” she said.“I think parents undergo too much judgment, which is actually part of the problem. But it’s important as a parent to have a balance of both kindness and firmness.”When asked what province is raising their children aged 10 to 21 to be the most resilient and setting them up for the best future successes, those polled said Ontario is doing the best job with 36.5 per cent and B.C. is a distant second with 16.6 per cent of the vote.  Story continues below advertisement Parents and caregivers in Prince Edward Island are doing the worst job, according to the survey.“There’s debt that comes with every generation and every generation figures out tricks,” Miller said. “And they also have to adapt for the context that they’re in. So, you know, I think there’s there’s lots of creativity that goes on with parents today.” Trending NowSaskatchewan Premier Scott Moe calls for federal electionTrump says it’s ‘fine’ after Ford threat to cut energy to border states 1:56New study blames genetics, not parenting, for picky eatersShe said kids also have a tough job.“They also just aren’t necessarily playing outside as much as they should be or doing as much free play, which we know really helps with child development,” Miller added.“So they’re trying to navigate really complex systems and worlds and online everything. And it’s usually those basics that help them develop their real sense of self.”  Story continues below advertisement She said she would like to see parents reach out to other parents more and ask for and offer support.“There are big broad categories of strategies that work or don’t work,” Miller added.“But I always love the advice of one of my mentors as a parent to read the book of yourself,” she said. “So not to get too fixated on a specific parenting task or trend, and also to just notice your child, have curiosity about who is your child, what are their needs.“Some kids need a little nudge to explore more and take more risks. Other kids, you need to send way firmer boundaries, otherwise they’re just going to keep getting into trouble.” More on BCMore videosPortion of Highway 99 remains closed Friday following multi-vehicle crash\t\t\t\t\tMan charged with assault in Burnaby golf club attack appears in court\t\t\t\t\tBorder officer almost hit by B.C. carjacking suspect at Peace Arch crossing\t\t\t\t\tStruggling B.C. fruit growers say province lagging on promise of help\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "Saskatchewan Premier Scott Moe calls for federal election",
        "Date": "Posted December 12, 2024 6:14 pm",
        "Text": "Saskatchewan Premier Scott Moe has officially called for a federal election.The news comes Thursday in an interview with Global News, where Moe discussed the potential tariffs coming from U.S. president-elect Donald Trump when he is in office.“We have just heard today that the federal government may be looking at export tariffs on oil, potash and uranium,” Moe said. “Export tariffs on our own products. So taxing Canadians on products that we are exporting, which is exactly as ridiculous as it sounds.“It’s a betrayal of those that work in the industry. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“It certainly is a betrayal by the federal government if they are considering any type of an export tax on potash, oil or uranium.”Moe went on to say throughout meetings he has heard of a ‘Team Canada approach’ and that the different levels of government would work together to find a solution.  Story continues below advertisement Moe said he has never heard any mention of an export tariff suggested from any premier.“Maybe it’s time for Canadians to have a say and a choice and to determine who they would like to have a four-year mandate to negotiate with the incoming Trump administration,” Moe said. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobCanada Post strike: Ontario utilities warn of penalties as millions await bills“We would ask Prime Minister Trudeau to do the right thing, to give Canadians the opportunity to make the choice on who is going to represent them at the table… that can happen anytime.”More to come… 3:19Cutting off energy to the U.S. is ‘last resort’ if Trump doesn’t back down on tariff threat: Ford "
    },
    {
        "Title": "CBSA says Canada not significant source of fentanyl into U.S.",
        "Date": "Posted December 12, 2024 5:55 pm",
        "Text": "Canadian border officials told members of Parliament Thursday that Canada is not a significant source of fentanyl headed into the United States.Aaron McCrorie, vice-president of intelligence and enforcement at the Canada Border Services Agency, made that comment to a parliamentary committee studying the impact of president-elect Donald Trump’s plans for border security and migration.CBSA President Erin O’Gorman also said the U.S. Drug Enforcement Administration has characterized the amount coming from Canada as “slippage” — small amounts sent over for personal use, mostly by post.Trump has threatened 25 per cent tariffs against Canada and Mexico unless the two countries step up on border security to tamp down on flows of illicit fentanyl. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.During the presidential race, Trump also threatened to deport millions of undocumented people, stirring fears that could trigger an influx of migrants into Canada.  Story continues below advertisement  1:22Ontario could cut off energy to U.S. if Trump imposes tariffs: FordOttawa is compiling new measures to bolster border security through more staff and equipment in the face of Trump’s tariff threats. Trending NowSaskatchewan Premier Scott Moe calls for federal electionCanada Post strike: Ontario utilities warn of penalties as millions await billsPrime Minister Justin Trudeau shared his border plan with the premiers during a Wednesday evening meeting, and Ottawa plans to add their suggestions into the soon-to-come package of measures.Several media outlets have reported that the tab for that could surpass $1 billion, citing confidential sources.RCMP Commissioner Michael Duheme said he was surprised to see that figure bandied about in headlines, and that he’s not clear on whether Ottawa will actually put that much into beefing up the border.He said he plans to use any additional resources coming his way for the RCMP to rely more on modern technology to enforce the Canada-U.S. border.  Story continues below advertisement An RCMP official said the police force currently has over 900 drones and nine helicopters located across the country, with six helicopters that occasionally provide border surveillance. More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "World’s oldest newlyweds have a combined age of 202",
        "Date": "Posted December 12, 2024 5:22 pm",
        "Text": "For these centenarians, their life as a married couple is just getting started.Bernie Littman, 100, and Marjorie Fiterman, 102, have set a Guinness World Record, becoming the world’s oldest newlyweds (aggregate age) after they tied the knot earlier this year. They secured the record with a joint age of 202 years and 271 days.The couple found love nine years ago at a Philadelphia seniors’ living facility after their longtime spouses passed away. Guinness notes that they met at a costume party and have been enjoying each other’s company ever since.View image in full screen\t\t\t\t\tMarjorie Fiterman, 102, and Bernie Littman, 100, from Philadelphia, got married at the care home where they met.\t\t\t\t\t\t\t\t\tSarah Sicherman via Guinness World Records\t\t\t\t“The pair bonded by sharing meals and participating in their retirement community’s productions,” said Guinness World Records, noting that they had their first date on the same day one of Littman’s great-granddaughters was born.  Story continues below advertisement Interestingly, there was a chance, decades ago, that the pair could have met – both studied at the University of Pennsylvania. However, Littman studied engineering while Fiterman undertook a teaching career, so their paths never crossed. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Instead, each married their respective spouses and spent more than 60 years with them before they became widowed.Littman’s granddaughter Sarah Sicherman told the Jewish Chronicle the whole family was “thrilled” for the couple and that they were “so lucky to have found each other and be a support to each other, especially during the pandemic.”“They both love each other’s humour and intellect,” she told Guinness, “they keep each other young.”  View this post on InstagramA post shared by Australian Jewish Association (@austjewishassociation) Trending NowHow the Ford government in Ontario plans to escalate trade war with the U.S.Saskatchewan Premier Scott Moe calls for federal election  Story continues below advertisement According to the records organization, the couple wed in May in a small ceremony at the facility where they reside, surrounded by four generations of family. The rabbi presiding over the ceremony said he adjusted the usual advice he gives to newlyweds, given their longevity.“Each of you has already amassed a lifetime of wisdom and experience, and your attitudes, feelings and opinions are pretty well formulated at this point,” Adam Wohlberg said in his speech.“That’s not to suggest that you won’t continue to learn and develop as people. But I think it is safe to say each of you, what you know and understand about each other, is exactly what the future holds for you and your partner. 2:49Canadian grandma breaks Guinness World Record by doing 1575 push-ups in an hourCanadian grandma breaks Guinness World Record by doing 1575 push-ups in an hourToronto chef slices and dices his way into the Guinness World RecordsWorld’s smartest chicken lives on Gabriola IslandShuswap teen’s record breaking accomplishments inspire movieScientists to study DNA of Bobi, world’s oldest dog‘A big honour’: Calgary’s ‘Frisbee Rob’ makes new Guinness World Records BookPrevious VideoNext Video“And what you have determined you love about each other – well, those things are not about to change.”  Story continues below advertisement Littman told Guinness he credits his long life and happiness to “reading and staying up-to-date,” while his bride said she her longevity to “buttermilk.” More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tBorder officer almost hit by B.C. carjacking suspectBroadway Corridor density debateWhat’s up with the mysterious drones flying over New Jersey?Canada’s most Googled words are in, here’s what mattered most in 2024"
    },
    {
        "Title": "It’s RSV season in Canada. Here’s how to keep children safe",
        "Date": "Posted December 12, 2024 3:59 pm",
        "Text": "As the respiratory illness season begins, cases of respiratory syncytial virus (RSV) cases are rising in Canada. But a new tool — nirsevimab, a protective antibody for infants — offers hope for prevention, though it is currently available only in some provinces.The latest data from Health Canada, covering the week of Nov. 24 to Nov. 30, shows RSV cases are already climbing, with infants under one year old making up the largest proportion of infections.RSV is a common and highly contagious respiratory virus that typically causes mild symptoms, but in infants, it can lead to serious complications such as bronchiolitis and pneumonia, which may require hospitalization or even result in death, according to Health Canada.Early infection has also been linked to long-term health issues, including persistent wheezing later in childhood.  Story continues below advertisement “Respiratory syncytial virus can affect everyone, but more consistently, it severely affects children less than five years of age,” explained Dr. Darine El-Chaar, a maternal-fetal medicine physician at the Ottawa Hospital.“A little baby has an immunity gap and doesn’t have the strongest immunity system to protect themselves, so they are more vulnerable and sensitive to get really sick,” she said. 1:59Alberta mother warns of severity of RSV in young babies: ‘It took everything out of her’Parents may be more aware of the dangers of RSV following the surge in infections two years ago, which occurred after COVID-19 lockdowns left some children unexposed to the virus and more vulnerable.Nearly half (49.8 per cent) of RSV-related hospitalizations recorded in Canada from 2021 to 2022 were in patients under six months of age.While last year’s respiratory illness season in Canada was less severe than the year before, RSV is still a serious threat, especially for infants.  Story continues below advertisement That’s why health professionals, like El-Chaar, are relieved to have two treatment options available to protect infants this respiratory illness season — nirsevimab and Abrysvo (a vaccine given to pregnant people). \t\t\t\tMore effective RSV treatment\t\t\t“It’s really an exciting time for RSV treatment,” El-Chaar said. “So we certainly did have strategies for RSV beforehand, but they were limited to high-risk infants.” Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The drug previously used to protect high-risk infants during the RSV season was palivizumab, a monoclonal antibody given monthly.“Nirsevimab, it’s a monoclonal antibody. Let’s call it the cousin of palivizumab. The difference is that it’s a one-time injection instead of monthly for our babies and it can last up to eight months and ten months so it can protect them during an RSV season,” El-Chaar said.Approved by Health Canada in April 2023, nirsevimab is a long-acting monoclonal antibody that provides a single-dose solution for preventing RSV in newborns and infants up to 24 months old.  Story continues below advertisement It works by blocking the virus’s ability to enter cells, offering 50 times more neutralizing activity than palivizumab, according to Health Canada. 1:51Canadian task force calls on provinces to fund RSV protection for infants, pregnant peopleNirsevimab starts working right away and offers longer-lasting protection, especially in the first few months of life when infants are most at risk for RSV, Health Canada said.Palivizumab offers shorter protection.And then there’s the vaccine, Abrysvo (also called RSVpreF), which was approved by Health Canada in December 2023, for use on pregnant people in the third trimester (between 32 and 36 weeks gestation).The vaccine, introduced in May 2024, provides infants with passive protection through transplacental antibody transfer from the mother to the fetus.“So we vaccinate the mom to possibly transfer antibodies to the newborn who is born with that protection that can last for six months,” El-Chaar said.  Story continues below advertisement  \t\t\t\tWhere is nirsevimab available?\t\t\tAlthough there are three forms of treatment for RSV, nirsevimab is preferred over palivizumab and the Abrysvo vaccine, Health Canada said.In May 2024, the National Advisory Committee on Immunization (NACI) began recommending nirsevimab as the preferred option for preventing severe RSV disease in infants. Trending NowSaskatchewan Premier Scott Moe calls for federal electionYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegNACI’s goal is to eventually establish a universal RSV prevention program using nirsevimab for all infants, starting with high-risk groups.“Program introduction could occur in stages depending on access, cost-effectiveness, and affordability of available options,” NACI said in its media release.Although NACI is recommending the antibody, not all provinces can provide it this season.“There are differences across different provinces because of the way our health-care systems are,” El-Chaar said. “Quebec was very early to have a strategy to use nirsevimab for all of its province, for all its babies born this season”  Story continues below advertisement “And Ontario has a clear guideline that was published in late summer clearly delineating our strategy of using nirsevimab mainly, but also actually offering the vaccine for patients who choose to make that their preferred option and that has been going since late October.” 2:12Health Matters: Canada to use Pfizer’s ‘Abrysvo’ RSV vaccineIn British Columbia, monoclonal antibody medications (palivizumab and nirsevimab) will not be available for most infants in the province during the 2024 to 2025 RSV season, the province said.Currently, these medications are available only to certain infants and young children who meet specific criteria, such as young, premature babies with chronic medical conditions.Alberta is working to secure nirsevimab, but the manufacturer has been unable to guarantee supply, a spokesperson from the Alberta Minister of Health’s office told Global News Wednesday. In the meantime, the province said it will continue to offer palivizumab to high-risk infants during the 2024 to 2025 RSV season.  Story continues below advertisement Nirsevimab is not available this RSV season in Saskatchewan, but palivizumab is eligible for infants and children who meet the criteria.Manitoba will not provide nirsevimab this season. However, as part of its high-risk infant program, the province will use palivizumab, a government spokesperson told Global News on Thursday.Both Ontario and Quebec now have provincially-funded programs that will offer the newer monoclonal antibody, nirsevimab, to all babies experiencing their first RSV season. 5:56Quebec is first province to offer RSV shots for babies free of chargeCoverage of nirsevimab is also now available in Nunavut, the Northwest Territories and Yukon.In Nova Scotia, the province said a limited supply of nirsevimab will be available for high-risk children in the 2024 to 2025 season.Nirsevimab is not currently publicly funded or available in New Brunswick or Newfoundland and Labrador.  Story continues below advertisement Although the use of nirsevimab is still in its early stages, as more provinces begin rolling out strategies for its use, El-Chaar hopes to see RSV cases start to decline with these improved treatment options.  In fact, she said that numbers could start to decline this RSV season.“We hope to see the effects of these products with good uptake… we should see a downgrade reduction of RSV infection. We won’t know now, we will know in a month or two, but I think we will see the effect,” she said. More on HealthMore videos$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\t‘Abnormally high’ flames spur recall for thousands of candles in Canada\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tWorld’s oldest newlyweds have a combined age of 202\t\t\t\t\tHealth Matters: Canada Post workers seek improved health and safety measures on the jobMore container homes open in CourtenayWearing a mask while exercising indoors improves lung functionAlberta paramedics sound the alarm over shift vacancies ahead of the holidays"
    },
    {
        "Title": "Cold weather clothing essentials for kids",
        "Date": "Posted December 13, 2024 7:00 am",
        "Text": "When the snow starts to fall, it’s the little one’s cue to get the winter gear on. Get them cold-weather ready with all the essentials they need to get the most out of this festive season. From cute matching mitten and glove sets, to little luxe puffer coats, we’ve got it all and we’re not gatekeeping these adorable finds.  \t\t\t\t\t\tKids Winter Knitted Pom Beanie Hat\t\t\t\t\t\t\t\t\t\tBeautifully and softly knitted, this faux fur beanie hat will be a staple winter accessory for your kid to enjoy the outdoor wintery fun.\t\t\t\t\t\t\t\t\t\t$23.99 on Amazon (was $25.99)\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tMango Pocket Quilted Jacket\t\t\t\t\t\t\t\t\t\tThis cloud-like quilted Mango jacket has a turtleneck design and large pockets, all while being long enough to keep toasty.\t\t\t\t\t\t\t\t\t\t$119.99 at Mango\t\t\t\t\t  \t\t\t\t\t\tNike Sportswear Lightweight Synthetic Fill\t\t\t\t\t\t\t\t\t\tThis Nike jacket is made from insulated fabric with a smooth, matte finish and will be your best friend this winter. The sleeves are lined with with extra fabric for maximum warmth and comfort.\t\t\t\t\t\t\t\t\t\t$110 at Nike\t\t\t\t\t  \t\t\t\t\t\tBeanie Hats Scarfs Gloves Set\t\t\t\t\t\t\t\t\t\tEveryone needs a matching set and your little one will love this adorable koala hat mitten and gloves set. Made from thick fabric and super soft.\t\t\t\t\t\t\t\t\t\t$29.99 on Amazon\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tUGG Classic Mini Boots\t\t\t\t\t\t\t\t\t\tForever a classic, these kids classic mini boots come in toddler and kid sizes so play time doesn’t have to end early for your little snow-lover. Made with sheepskin lining, super warm and comfortable on your feet.\t\t\t\t\t\t\t\t\t\tBuy on Amazon\t\t\t\t\t  \t\t\t\t\t\tMoncler Marat Down Jacket\t\t\t\t\t\t\t\t\t\tSnuggle up in The Marat — a cloud-like jacket made from recycled nylon that keeps you warm and light, with cozy details like a snug hood and handy zip pockets.\t\t\t\t\t\t\t\t\t\t$1265 at Holt Renfrew\t\t\t\t\t  \t\t\t\t\t\tMetallic puffer jacket\t\t\t\t\t\t\t\t\t\tIf you’re looking for a standout piece, this metallic puffer comes in a light champagne hue and was made to totally turn heads.\t\t\t\t\t\t\t\t\t\t$119.99 at Mango\t\t\t\t\t  Story continues below advertisement You may also like: Get weekly The Curator newsBe in the know before you buy - Stay up to date with the latest trends, get expert recommendations, tips, and shopping guides.Sign up for weekly The Curator newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Roots Kid Classic Cabin Ankle Sock 3 Pack – $19.50The North Face Beanie – $43.95Columbia girls Heavenly Long Jacket – $104.99 – $318.33Kamik Baby Boy’s Boots – $160Boys Snow Boots – $49.88Disposable Hand Warmers – $34.99  \t\t\t\t\t\tKids Wool Bomber Jacket\t\t\t\t\t\t\t\t\t\tThis sherpa-collar bomber jacket from Gap is made from a wool-blend, offering warmth and lightweight comfort — perfect for the kid on the go.\t\t\t\t\t\t\t\t\t\t$79.00 at Gap Canada (was $158.00)\t\t\t\t\t  \t\t\t\t\t\tMango Quilted gilet with hood\t\t\t\t\t\t\t\t\t\tAdorned with gold button detailing, this simple yet sleek hooded vest pairs well with any long-sleeve sweatshirt for those milder winter days.\t\t\t\t\t\t\t\t\t\t$59.99 at Mango\t\t\t\t\t More Recommendations15 mini gifts that make a big impact Story continues below advertisement   \t\t\t\t\t\tUniqlo Heattech Ultra Warm Crew Neck T-Shirt\t\t\t\t\t\t\t\t\t\tLong-sleeve tops are always a winter essential, and these heattech ultra warm crew neck t-shirts from Uniqlo are going to be your kids new go-to everyday staple. Moisture-wicking and the thickest option in the kids heattech collection, it’s the perfect time to stock up on these high-tech basics.\t\t\t\t\t\t\t\t\t\t$24.90 at Uniqlo\t\t\t\t\t  \t\t\t\t\t\tPolo Ralph Lauren Baby Boy's Combed Cotton Button-Front Cardigan\t\t\t\t\t\t\t\t\t\tKeep your little one looking undeniably dapper with Polo Ralph Lauren’s combed cotton cardigan, featuring classic button-front charm and an irresistibly soft touch.\t\t\t\t\t\t\t\t\t\t$86.00 at Saks Fifth Avenue\t\t\t\t\t \t\t\t\t\t\tWaterproof Toddler Snowsuit\t\t\t\t\t\t\t\t\t\tThis adorable snowsuit will keep your toddler warm and dry with its high-quality polyester fill, waterproof and windproof fabric, and easy zipper closure.\t\t\t\t\t\t\t\t\t\t$48.98 on Amazon\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tDeux Par Deux Two Piece Snowsuit\t\t\t\t\t\t\t\t\t\tNeed something a little more heavy-duty? This snowsuit has adjustable features and ski-gear-ready pockets ensure a perfect fit and seal in warmth while keeping moisture out.\t\t\t\t\t\t\t\t\t\t$298.00 at deux par deux\t\t\t\t\t  \t\t\t\t\t\tSorel Unisex Snow Commander Boots\t\t\t\t\t\t\t\t\t\tLet your little explorer stomp through snow, mud, or grass with these Sorel winter boots — featuring a waterproof shell, fleece lining, and great traction.\t\t\t\t\t\t\t\t\t\t$68 on Amazon\t\t\t\t\t  \t\t\t\t\t\tKids Wool Socks\t\t\t\t\t\t\t\t\t\tThese wool socks come in a variety of festive winter designs and are extra thick to combat snow and slushy playtime.\t\t\t\t\t\t\t\t\t\t$24.99 on Amazon\t\t\t\t\t  Story continues below advertisement You may also like:Kids Winter Thermal Top – $26.99Nike Sportswear Club Fleece Girls High-Waisted Fitted Trousers – $50Kids Fleece Ski Face Mask – $21.99Canada Goose Logan Down Parka – $895Thick Wool Beanie – $10.65 More from The Curator10 Last-Minute Gifts That Will Arrive on Time\t\t\t\t\t14 Canadian gifts to give this holiday season\t\t\t\t\tGifting goals: The best picks for every budget\t\t\t\t\t"
    },
    {
        "Title": "10 Last-Minute Gifts That Will Arrive on Time",
        "Date": "Posted December 12, 2024 7:00 am",
        "Text": "Still scrambling for those last-minute Christmas gifts? Don’t stress — we’ve got you covered with thoughtful finds that will arrive on time. From delicious treats to snuggly sweaters, this roundup is packed with everything you need for a cheerful holiday gift exchange. Keep reading to discover our top picks.  \t\t\t\t\t\tr.e.m. beauty x Wicked Galinda Glow Drops\t\t\t\t\t\t\t\t\t\tYou’re going to be popular with these Galinda glow drops by r.e.m beauty. Infused with hydrating hyaluronic acid and peptides to visibly improve complexion, this is the must-have product for Wicked fans and makeup lovers.\t\t\t\t\t\t\t\t\t\t$44 at Shopper's Drug Mart\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tChocolate Gift Box\t\t\t\t\t\t\t\t\t\tWith an assortment of flavours like pretzel clouds, double silk truffles, and sea salt caramels, this delicious chocolate gift box will an irresistible surprise to any giftee. \t\t\t\t\t\t\t\t\t\t$52.99 on Amazon\t\t\t\t\t  \t\t\t\t\t\tDiptyque Limited Edition Set of 5 Miniature Candles\t\t\t\t\t\t\t\t\t\tThis limited edition miniature candle set by Diptyque. Five enchanting scents in adorable mini jars make this the perfect gift for candle lovers who crave a little indulgence\t\t\t\t\t\t\t\t\t\t$135 at Holt Renfrew\t\t\t\t\t  \t\t\t\t\t\tEstée Lauder Glow Authorities Repair + Lift + Hydrate\t\t\t\t\t\t\t\t\t\tFor the girlfriend who loves a little pamper time (who doesn’t?), this luxe skincare set from Estée Lauder keeps skin plump and radiant. With hydrating properties, this set is a must-have to stay glowing this winter.\t\t\t\t\t\t\t\t\t\t$60 at Shopper's Drug Mart\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\t14K Gold Heart Pendant\t\t\t\t\t\t\t\t\t\tThis heart-shaped pendant from Jennybird is the perfect way to wear your love. It’s timeless, chic, and adds just the right amount of shine to any outfit – a versatile addition to your jewelry collection.\t\t\t\t\t\t\t\t\t\t$440.00 at Jennybird\t\t\t\t\tYou may also like: Get weekly The Curator newsBe in the know before you buy - Stay up to date with the latest trends, get expert recommendations, tips, and shopping guides.Sign up for weekly The Curator newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Mandy’s Gourmet Salads: Recipes for Lettuce and Life – $35.00e.l.f. Jet Set Hydration Kit – $22.00Jennybird Gia Bangle – $198.00LEGO Icons Bouquet of Roses Building Set – 54.96Starbucks Holiday Blend Ground Coffee – $9.87  \t\t\t\t\t\tNike Mens Golf Cap\t\t\t\t\t\t\t\t\t\tA sporty gift for your active loved one – this Nike hat for men or women is classic, versatile, and ready for workouts or running errands.\t\t\t\t\t\t\t\t\t\t$45.99 on Amazon (was $56.01)\t\t\t\t\t More RecommendationsCold weather clothing essentials for kids14 Canadian gifts to give this holiday season Story continues below advertisement   \t\t\t\t\t\t100% Cotton Fisherman Cable Crewneck Sweater\t\t\t\t\t\t\t\t\t\tThis classic crew neck makes a great gift for any man in your life. Made from 100% cotton, this might be the perfect sweater for all your mister’s festive family gatherings and photoshoots. \t\t\t\t\t\t\t\t\t\t$38.2 on Amazon\t\t\t\t\t  \t\t\t\t\t\tNintendo Switch\t\t\t\t\t\t\t\t\t\tLevel up the fun with a Nintendo Switch – the ultimate console for gaming at home or on the go! With endless adventures to explore, it’s a gift that brings joy to every player, no matter their age.\t\t\t\t\t\t\t\t\t\t$355 on Amazon (was $372.95)\t\t\t\t\t  \t\t\t\t\t\tUnder Armour Mens Running Shoes\t\t\t\t\t\t\t\t\t\tThese Under Armour running shoes combine comfort and performance for every step of your workout. Lightweight and supportive, they provide the perfect blend of style and durability to keep you going mile after mile.\t\t\t\t\t\t\t\t\t\t$82.81 on Amazon (was $97.12)\t\t\t\t\t  Story continues below advertisement   \t\t\t\t\t\tDigital Picture Frame\t\t\t\t\t\t\t\t\t\tThis digital picture frame is the perfect gift to share heartfelt memories with loved ones throughout the holiday season and beyond. Your giftee will love receiving new photos instantly and reliving cherished moments every time they glance at their frame.\t\t\t\t\t\t\t\t\t\t$145 on Amazon (was $199.99)\t\t\t\t\tYou may also like:Beats Solo 4 – $179.93Apple iPad (10th Generation) – $499.99Hanes mens Crew Socks – $16.97Men’s Boxer Briefs – $46.99Men’s Daily Advanced Face Care Routine – $107.00 More from The Curator15 mini gifts that make a big impact\t\t\t\t\t12 top stocking stuffers for men and women\t\t\t\t\tThe Curator’s top gift picks for 2024: Your ultimate shopping guide\t\t\t\t\t"
    },
    {
        "Title": "California couple shot dead in Mexico while on vacation for the holidays",
        "Date": "Posted December 13, 2024 12:01 pm",
        "Text": "A California couple has been shot and killed while on vacation in Mexico, authorities have confirmed.The couple, identified by the Michoacan State Attorney General’s Office only as Gloria A., 50, and Rafael C., 53, were gunned down in the western state of Michoacan just before midnight Wednesday night.The married pair had been travelling in a pickup truck in the municipality of Angamacutiro when they were shot. The woman died at the scene, reports Reuters, while the man died in hospital a short time later.It was not immediately clear why or if the couple was specifically targeted.State prosecutors told Reuters that the woman, who had obtained U.S. citizenship, and the man, who was born in the U.S. to Mexican parents, had family and a home in Angamacutiro.  Story continues below advertisement  4:55Why more Canadians say they’re skipping travel and staying home for the holidaysWhy more Canadians say they’re skipping travel and staying home for the holidaysThe medical travel risks to be aware of this holiday seasonPrevious VideoNext VideoMagdalena Guzmán, a press officer at the Michoacán prosecutor’s office, told the New York Times the couple arrived in Mexico late last month to spend the holidays with family. Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegSaskatchewan Premier Scott Moe calls for federal electionGet daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.According to the outlet, authorities learned of the attack after security officers found their vehicle ridden with bullets on an Angamacutiro street.The prosecutor’s office said that the couple’s licence plate had been registered without a number in the Lázaro Cárdenas neighbourhood. Investigators were collecting ballistic evidence from the scene for analysis.The killing is considered a step backward in the Mexican government’s pledge to curb organized crime in several regions.Mexican President Claudia Sheinbaum, who took office in October, has promised to replicate nationally the success she had as mayor of Mexico City in bringing down the sprawling capital’s murder rate.  Story continues below advertisement But her first two months in office have been marked by an outbreak of cartel violence in several hotspots.The Canadian government advises tourists to avoid non-essential travel to several states in Mexico — including Michoacan — due to high levels of violence and organized crime.— With files from Reuters More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tTrump to China’s Xi : Come to my inauguration\t\t\t\t\tMarie Antoinette ‘smartwatch’ on display in LondonSyria’s transition: U.S. racing to play role in shaping country’s futureSouth Korea’s president says he’ll fight impeachmentYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg"
    },
    {
        "Title": "None",
        "Date": "None",
        "Text": "None"
    },
    {
        "Title": "South Korea police carry out arrests, searches over martial law order",
        "Date": "Posted December 11, 2024 6:26 pm",
        "Text": "South Korea’s previous defense minister was stopped from attempting suicide while in detention over last week’s martial law declaration, officials said Wednesday, as President Yoon Suk Yeol’s office resisted a police attempt to search the compound.The main liberal opposition Democratic Party is pushing for a new motion to impeach Yoon for his Dec. 3 decree that imposed martial law in South Korea for the first time in more than four decades.Its first impeachment attempt against Yoon last Saturday failed after ruling party lawmakers boycotted the vote. The party said it plans to submit the new motion on Thursday to set up a vote on Saturday.Yoon’s ill-conceived power grab has paralyzed South Korean politics, frozen its foreign policy and rattled financial markets. On Wednesday, rival North Korea’s state media for the first time reported about the turmoil across the border, but the country hasn’t shown any suspicious activities.  Story continues below advertisement  2:09South Korean president survives impeachment attempt as ruling party boycotts voteShin Yong Hae, commissioner general of the Korea Correctional Service, told lawmakers that former Defense Minister Kim Yong Hyun tried to kill himself the previous night at a detention center in Seoul. He said correctional officers stopped him and that he was in stable condition.Kim was arrested by prosecutors early Wednesday on allegations of playing a key role in a rebellion and committing abuse of power. He became the first person formally arrested over the martial law decree.Kim, one of Yoon’s close associates, has been accused of recommending martial law to Yoon and sending troops to the National Assembly to block lawmakers from voting on it. Enough lawmakers eventually managed to enter a parliament chamber and they unanimously rejected Yoon’s decree, forcing the Cabinet to lift it before daybreak on Dec. 4.Kim said in a statement on Tuesday that he “deeply apologizes for causing significant anxiety” to the public. He said all responsibility for the martial law imposition rests with him and pleaded for leniency for soldiers deployed to enforce it.  Story continues below advertisement Prosecutors have up to 20 days to determine whether to indict Kim. \t\t\t\tYoon’s office blocks search of presidential compound\t\t\tLater Wednesday, police detained National Police Agency Commissioner General Cho Ji Ho and Kim Bong-sik, head of Seoul’s metropolitan police. They were accused of deploying police forces to parliament to block lawmakers from voting. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The main focus of the investigation is finding whether Yoon, Kim and others involved in imposing martial law committed rebellion. A conviction for rebellion carries a maximum penalty of death. 2:36South Korean president faces possible treason allegations over botched martial lawSouth Korean police said they sent officers to search Yoon’s office on Wednesday to look for any evidence related to the martial law introduction. But investigators failed to enter the office as of Wednesday evening, about six hours after their arrival, senior police officer Lee Ho-young told the parliament.  Story continues below advertisement Some observers earlier said that the presidential security service won’t likely permit searches of Yoon’s office, citing a law that prohibits searches of sites with state secrets without approval from those in charge of those areas.Yoon on Saturday apologized over the martial law decree, saying that he won’t avoid legal or political responsibility for it. He said he would leave it to his party to chart a course through the country’s political turmoil, “including matters related to my term in office.”The leader of Yoon’s ruling party later vowed to arrange the president’s stable exit from office, saying the party will coordinate with Cabinet members over state affairs and that Yoon will be sidelined from duties. Trending NowHow the Ford government in Ontario plans to escalate trade war with the U.S.Saskatchewan Premier Scott Moe calls for federal electionThe comments were criticized as unrealistic and unconstitutional, and caused widespread questions about who is in charge of South Korea and its military at a time of heightened tensions with North Korea. The Justice Ministry on Tuesday banned Yoon from leaving the country as he faces investigations.Vice Defense Minister Kim Seon Ho reiterated Wednesday that Yoon remains in charge of the military. But Yoon hasn’t been involved in any major official activities since lifting martial law, except for accepting resignation offers by officials involved in the martial law case and appointing the head for the country’s Truth and Reconciliation Commission. \t\t\t\tA view from North Korea\t\t\tA Wednesday article from the North’s state news agency reported about the South Korean political chaos and protests triggered by Yoon’s martial law decree. The report mostly attempted to explain the South Korean events, though it called Yoon “a traitor” and his military “gangsters.”  Story continues below advertisement  1:58Protests against South Korean president continue after martial law flubMany experts say North Korea is sensitive to the domestic spread of news on major anti-government protests in foreign countries, because its own people have no official access to international news and could be affected by such events. The U.S. State Department said Monday that the U.S.-South Korean alliance remains “iron-clad” and that Washington is committed to the peace and security of the Korean Peninsula.In his martial law announcement, the conservative Yoon stressed a need to rebuild the country by eliminating “shameless North Korea followers and anti-state forces,” a reference to his liberal rivals who control parliament. Since taking office in 2022, Yoon has had near-constant friction with the Democratic Party, which introduced motions to impeach some of his top officials and launched a political offensive over scandals involving Yoon and his wife.Opposition parties and many experts say the martial law decree was unconstitutional. They say a president is by law allowed to declare martial law only during wartime or similar emergency situations, but South Korea wasn’t in such a predicament. They argue that deploying troops to seal the National Assembly to suspend its political activities amounted to rebellion because the constitution doesn’t allow a president to use the military to suspend parliament in any situation.  Story continues below advertisement If Yoon is impeached, his presidential powers would be suspended until the Constitutional Court decides whether to restore his powers or remove him from office. If he is dismissed from office, a new presidential election would be required. More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tMarie Antoinette ‘smartwatch’ on display in LondonSyria’s transition: U.S. racing to play role in shaping country’s futureSouth Korea’s president says he’ll fight impeachmentYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg"
    },
    {
        "Title": "Air Canada denies world-renowned musician from boarding flight with cello",
        "Date": "Posted December 13, 2024 2:02 pm",
        "Text": "Sheku Kanneh-Mason, a British cellist who rose to international fame after performing at the wedding of Prince Harry and Meghan Markle, had to cancel a highly-anticipated Toronto concert following a dispute with Air Canada over his cello’s pre-booked seat.Kanneh-Mason, currently on tour in North America with his sister and pianist, Isata Kanneh-Mason, detailed the incident in a heartfelt Instagram post.“We were deeply saddened not to be able to perform for you at Koerner Hall last night,” they wrote Thursday.The siblings were scheduled to perform at the Koerner Hall on Wednesday, but a series of travel mishaps with the airline, resulted in the denial of boarding with his valuable instrument.“First we had delays, then a cancellation, and the day concluded by being denied boarding with the cello – despite having a confirmed seat for it – on a new, final flight into Toronto,” the siblings wrote.  Story continues below advertisement “After nine anxious hours at the airport, we realized our journey wasn’t going to be possible.”  View this post on InstagramA post shared by Sheku (@shekukannehmason) Trending NowSaskatchewan Premier Scott Moe calls for federal electionYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegAccording to the musician’s website, his cello is on an indefinite loan to him, which requires special care and arrangements due to its historical value. However, Air Canada reportedly refused to honor the initial booking. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The airline’s policy states that passengers may buy a seat for a musical instrument as long as they meet specific size and weight requirements. It is unclear why Kanneh-Mason’s cello, was denied. Global News has reached out to Air Canada for comment but did not hear back by publication.“We can only dream of a time when all airlines have a standardized, global and carefully considered approach to the carriage of precious instruments that are booked to travel in the cabin,” their statement read.  Story continues below advertisement The siblings expressed their disappointment and promised to reschedule the Toronto performance for next year, thanking fans for their understanding. More on TorontoMore videosToronto man who killed girlfriend in act of ‘unthinkable’ violence gets life in prison\t\t\t\t\tFrank Stronach chooses jury trial in Toronto sexual assault case\t\t\t\t\tNiche dog sport divided Ford’s caucus as expansion plan killed, then resurrected\t\t\t\t\tConservationists eager to see plan to save rare eastern wolf found in Quebec, Ontario\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "Toronto hospital left without heat or hot water cancels non-essential activities",
        "Date": "Posted December 13, 2024 1:44 pm",
        "Text": "A Toronto hospital cancelled all “non-essential” activities on Friday after a boiler system failure cut off its supply of heat and hot water.Unity Health Toronto called the boiler failure at St. Joseph’s Health Centre in the city’s west end an “emergency situation” affecting its ability to provide services across the hospital.“The health and safety of all of our patients is a top priority and we are working to keep our buildings warm as possible as we resolve the issue,” a statement posted to the Unity Health website said.Unity Health said unless it’s a life-threatening emergency, patients should seek out another hospital’s emergency department. All non-essential activities were cancelled Friday across its ambulatory, procedural and surgical areas. Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The statement said patients receiving dialysis or chemotherapy treatments are not affected and should still attend their appointments.  Story continues below advertisement Patients with scheduled appointments will be contacted directly by their care team, the hospital network said.In an update shortly before noon on Friday, Unity Health said it was not restricting victors and had no planned patient transfers.“But we continue to monitor temperatures and this evolving situation,” the update read. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobTrump says it’s ‘fine’ after Ford threat to cut energy to border statesTemperatures were expected to top out at -3 C in Toronto on Friday, before dropping to -13 C overnight.Unity Health said it could not accept “generous offers” from community members of blankets and space heaters.Loved ones can bring extra clothing or blankets for in-patients if they want to, but the hospital network said electronic items are not being accepted for safety reasons.A spokesperson declined an interview and referred to the statement when reached for comment Friday.The network also operates two other hospitals in the city, St. Michael’s Hospital and Providence Healthcare. More on TorontoMore videosToronto man who killed girlfriend in act of ‘unthinkable’ violence gets life in prison\t\t\t\t\tFrank Stronach chooses jury trial in Toronto sexual assault case\t\t\t\t\tNiche dog sport divided Ford’s caucus as expansion plan killed, then resurrected\t\t\t\t\tConservationists eager to see plan to save rare eastern wolf found in Quebec, Ontario\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal election"
    },
    {
        "Title": "Federal government to fund University of Manitoba reconciliation initiative",
        "Date": "Posted December 13, 2024 12:50 pm",
        "Text": "The federal government says it’s funding the Canadian Reconciliation Barometer Project at the University of Manitoba to the tune of more than $206,000.The project, which began in 2015, monitors the evolution of Canadians’ understanding of and progress through reconciliation.MP Terry Duguid (Winnipeg South) announced Friday on behalf of Canada’s heritage minister, Pascale St-Onge, that the funding will go toward initiatives including the creation of an advisory council of elders and knowledge keepers, and the development of learning materials to help educate people. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The cash for the project comes from the Canada History Fund.“Our government’s support for the Canadian Reconciliation Barometer Project illustrates our commitment to continuing the essential reconciliation process between Indigenous and non-Indigenous people,” St-Onge said in a statement.“This new funding will help bolster efforts to deepen our understanding of the reconciliation process. Although we have made progress on our shared path so far, we still have much to do.” Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg Story continues below advertisement  0:53Truth and Reconciliation workshop "
    },
    {
        "Title": "Former Chilliwack, B.C. MLA Dan Coulter has died",
        "Date": "Posted December 13, 2024 1:58 pm",
        "Text": "Dan Coulter, a former member of British Columbia’s legislature and a New Democrat cabinet minister, has died at age 49.The BC New Democratic Party says in a statement that Coulter was a “devoted advocate” for the people of B.C.The party says Coulter “always championed the underdog,” citing his work in the legislature after his election in Chilliwack in 2020, his former role of chair of the Chilliwack school board and as the Parliamentary secretary for accessibility and minister of state for infrastructure and transit.The party’s provincial director Heather Stoutenburg said last week in a statement that Coulter had “experienced a serious medical emergency” and was being treated in hospital. 3:10B.C. Premier David Eby reflects on ‘Premier Dad’ John Horgan’s life in officeThe party says a private service will be held for Coulter on Saturday and a local public service will be held in Chilliwack on Jan. 11. Trending NowSaskatchewan Premier Scott Moe calls for federal electionHow the Ford government in Ontario plans to escalate trade war with the U.S. Story continues below advertisement The party says that Coulter, who lost his bid for re-election in the October provincial election, was “the very best of us,” and it extends its “deepest condolences to his family, friends and everyone who had the privilege of knowing and working with him.” Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.It says that instead of flowers, his family has asked that donations go to the Chilliwack Restorative Justice and Youth Advocacy Association, Chilliwack Bowls of Hope Society, and the BC SPCA.“To those of us who knew him, Dan was so much more than a colleague — he was a friend and a mentor,” the statement says. “He was smart, funny, thoughtful and honest. But above all things, he was kind.”  More on PoliticsMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tCanada Post, union resolve complaint over temporary layoffs\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tDoug Ford in impromptu interview during Global News broadcastBroadway Corridor density debateMore container homes open in CourtenaySyria’s transition: U.S. racing to play role in shaping country’s future"
    },
    {
        "Title": "Calgary ‘disappointed’ to not get copy of province’s new Green Line proposal",
        "Date": "Posted December 13, 2024 1:50 pm",
        "Text": "The Alberta government is proposing a reworked Green Line light rail transit route in Calgary that it says would serve more communities and save more than $1 billion.The province contracted consulting firm AECOM in July to find alternatives to the city’s latest proposal, which would have involved a tunnel through downtown and run a drastically shorter distance than earlier planned.Calgary city council voted to wind down the $6.2-billion project in September after the province said it would pull its $1.5-billion in funding without a major project overhaul.The federal government has also committed $1.5 billion.The Alberta government says based on the AECOM report, it is proposing a new Green Line alignment that would connect 7th Avenue downtown to a station at Shepard on the Calgary’s southeastern edge.  Story continues below advertisement The province says it would save $1 billion by using elevated tracks downtown instead of a tunnel, and would connect to two other lines serving the northeast and northwest as well as a new NHL arena set to open in 2027. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“This alignment adds five more stops, will be 76 per cent longer and will serve 60 per cent more Calgarians — all within the same budget,” Alberta Transport Minister Devin Dreeshen said in a news release Friday.“The ball is now in Calgary city council’s court to approve this alignment and to finally start construction on the Green Line in the new year.” 1:51Province says work can move forward on Green Line between Victoria Park and ShepardIn a statement to Global News, the city said it “has not received the AECOM report and it is disappointing that after working collaboratively since September on a reimagined Green Line that the Province shared the details publicly prior to Council’s review.  Until Council has an opportunity to review the report including the alignment and costing, we cannot comment.”  Story continues below advertisement The statement went on to say “council has been clear that the City’s commitment of $1.53B remains and look forward to understanding the Province’s plan on their new alignment.”With files from The Canadian Press Related NewsCity of Calgary holds Green Line information sessions\t\t\t\t\tCalgary close-up: New agreement over Calgary’s Green Line LRT\t\t\t\t\t"
    },
    {
        "Title": "Niche dog sport divided Ford’s caucus as expansion plan killed, then resurrected",
        "Date": "Posted December 13, 2024 8:51 am",
        "Text": "A decision over whether to expand an obscure dog sport in Ontario sparked division within Doug Ford’s Progressive Conservative caucus that saw the premier agree to cancel a new licensing regime before later resurrecting it, The Canadian Press has learned.At trial and train areas, hunters can unleash dogs inside massive, fenced-in areas to hunt down prey such as coyotes, foxes and rabbits. The provincial government insists they are safe for both dogs and wildlife.In the spring of last year, after a prolonged lobbying campaign from some train and trial hunters, the province released a proposal through the Environmental Registry that would allow for a one-time, 90-day licence application period and allow licences to be transferred to new owners. The changes were part of an omnibus red tape bill that became law in June 2023.The dog sport had been withering for decades. In 1997, then-premier Mike Harris’s Progressive Conservative government began phasing out the practice by ceasing the issuance of licences needed to operate dog train and trial areas in the province. It also made it illegal to sell or transfer those licences.  Story continues below advertisement At the time, there were upwards of 60 such areas across Ontario. That number has dwindled to 24. They are all on private property and must be completely enclosed.The training component sees hunting dogs let loose in these areas, which are often hundreds of hectares in size but fenced in around the perimeter. The dogs learn to hunt animals like coyotes, which are caught in the wild and re-homed to these areas.The trial portion involves competitions with judges who score the dogs on their hunting skills. Points are awarded and champions crowned. More on PoliticsMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tHow the Ford government in Ontario plans to escalate trade war with the U.S.\t\t\t\t\tCanada Post, union resolve complaint over temporary layoffs\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tDoug Ford in impromptu interview during Global News broadcastBroadway Corridor density debateMore container homes open in CourtenaySyria’s transition: U.S. racing to play role in shaping country’s futureAfter The Canadian Press published news of the unannounced expansion plans last year, two former conservation officers spoke out about the pens based on their experience investigating them in the years after the Harris government tightened the rules.Rick Maw and Wayne Lintack said the dog sport is cruel to the captive prey and well-meaning regulations are impossible to enforce.The two said the industry has long been rife with problems, including the illegal catching and warehousing of coyotes that are then fenced in as prey for the dogs. They also uncovered a coyote trafficking ring.On April 2, 2006, conservation officers fanned out across southern and central Ontario for a series of raids. They seized nearly two dozen live coyotes and laid hundreds of charges. The criminal case eventually fell apart because it took too long to get to trial, but the province shut down a train-and-trial area where coyotes had been found packed in a barn.  Story continues below advertisement Maw and Lintack said legislation that tries to regulate the practice is largely unenforceable, despite its good intentions to keep animals safe. Their initial audits of the place that was ultimately shut down passed with flying colours, they said, recounting that it took going undercover to discover what was really happening. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.As last year’s omnibus legislation was being debated, the two implored the government to reconsider the expansion. The committee studying the sport’s expansion was deluged with hundreds of other complaints from the public, though the bill ultimately passed.Six Progressive Conservatives, including two cabinet members, spoke to The Canadian Press about the issue. They agreed to share details under condition of anonymity in order to frankly discuss the government’s internal machinations about the sport without risking repercussions.The sources said news of the expansion, along with warnings by the former provincial conservation officers, caused division within party ranks. That division deepened in August 2023 when advocacy organization Animal Justice released a video after sending someone undercover at a train and trial area outside Kingston, Ont.The video showed dogs wearing numbered pinnies running around a forest chasing a coyote, as hunters’ discussions could be heard in the background. One man is heard boasting about how they run down coyotes all year.Several Progressive Conservatives actively lobbied against the sport’s expansion in light of animal cruelty concerns.  Story continues below advertisement Backbenchers Christine Hogarth and Jess Dixon led the charge, the sources said. Neither of them responded to a request for comment. Both are animal lovers who believed the sport to be cruel, the sources said.Their concerns were welcomed by many within the party. Both Ford and Natural Resources Minister Graydon Smith were convinced to let the expansion plans die by not putting the new licence application process into place, the sources said.“It made sense to let this die on the vine because it had become a needless distraction for us,” said one cabinet member.“Frankly, most of us didn’t even know this dog sport existed, and if Harris wanted it gone 25 years ago, many of us felt like that was reason enough to quietly reverse course.”In early September, word of the reversal made its way to the hunters, who launched another letter-writing campaign addressed to Ford and Smith.Members of a Ontario Field Trialers, a Facebook group popular with hunters, were fuming.“With the release of the video recorded by Animal Justice and the increased pressure by animal rights activists and looming election possibility, Premier Doug Ford has turned his back on the hound and hunting community and decided not to open up the application process, therefore defeating everything we wanted,” one member wrote in early September. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesCanada Post strike: Ontario utilities warn of penalties as millions await bills Story continues below advertisement “I urge everyone to contact their local MP, (Natural Resources) Minister Graydon Smith and Doug Ford’s office letting them know how this will hurt them in the upcoming election.”Ford has not ruled out calling an early election in 2025 before the fixed June 2026 election date.With that possibility dangling, the hunters’ pressure led the premier to change course for a second time, the Progressive Conservative sources said.“It was really about appeasing the hunters and shoring up support if we have an election,” a second cabinet member said.“Although most of us had never heard of this sport before, and, frankly, found the entire thing odd.”Ford’s office declined to comment.The facilities are safe for both dogs and wildlife, said Melissa Candelaria, a spokeswoman for the natural resources minister.“These facilities prepare sporting dogs and their handlers for animal tracking and competitions while ensuring a safe environment that protects both dogs and wildlife from public areas, where this activity is not monitored or regulated,” Candelaria said.“Contact between sporting dogs and wildlife is actively avoided and protections are in place to maintain safety for both.”The areas are routinely inspected, she said, and must adhere to strict standards set out in the Fish and Wildlife Conservation Act with stiff fines upwards of $100,000 and up to two years in jail for non-compliance. Operators must also comply with the Provincial Animal Welfare Services Act, she said.  Story continues below advertisement “Conservation officers will not hesitate to enforce the law on facilities that do not meet the required standard of care for wildlife,” she said.The Ontario Federation of Anglers and Hunters said they were pleased to see the government move forward.“The licensing process was developed with the support of experts and stakeholders like the OFAH and Canadian Kennel Club, allowing this tradition to continue responsibly while reinforcing the already rigorous standards for the safety and care of wildlife,” said Mark Ryckman, a policy manager at the federation.Last month, Animal Justice filed an application for review of the law’s compliance with the province’s Environmental Bill of Rights. The group alleges the “facilities are harmful to the environment, which includes Ontario’s wildlife.”The group isn’t happy with Ford’s about-face.“We went undercover to determine the extent of the cruelty involved in caging and chasing these animals and we were shocked by what we saw, including coyotes running for their lives in enclosed areas,” said Camille Labchuk, Animal Justice’s executive director.“We heard participants admitting that coyotes and other animals are regularly caught and killed by dogs and that the pens have to be restocked throughout the season because of all of these deaths. We quickly determined that this is a blood sport that has no place in a compassionate province like Ontario.”  Story continues below advertisement The province is currently accepting applications for train and trial licences. The application period is set to close at the end of December, with approvals likely coming in the new year. "
    },
    {
        "Title": "Lethbridge city council votes to maintain operations of Lethbridge and District Exhibition",
        "Date": "Posted December 12, 2024 9:28 pm",
        "Text": "While avoiding a tax hike, Lethbridge city council has chosen to maintain operations of Lethbridge & District Exhibition (LDE) by using a contingency fund and surplus budget dollars until at least 2027.With the doors remaining open on the Agri-Food Hub and Trade Centre, residents had been facing a 2.24 per cent jump in property taxes for next year. However, council voted against city administration’s recommendation, instead using existing budget to ensure taxes remain in place. There will be a 5.1 per cent increase for 2025, but that was approved in 2022 and is unrelated to the operation of LDE.“The dollars have to come from somewhere, so of course, we were able to find some dollars in reserves and we’re going to use some of those until 2027. Then, the next council can make a decision moving forward. For now, there’s two extra years that we are not – there’s no additional tax increase for the operations there,” said Lethbridge mayor Blaine Hyggen.  Story continues below advertisement Hyggen, along with councilors Ryan Parker, Belinda Crowson, Jenn Schmidt-Rempel and Nick Paladino, voted in favour of the plan. Rajko Dodic and Jeff Carlson voted against. Councilor John Middleton-Hope did not vote as he is on an unpaid leave of absence during his campaign in the Lethbridge-West byelection. Get weekly money newsGet expert insights, Q&A on markets, housing, inflation, and personal finance information delivered to you every Saturday.Sign up for weekly money newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The mayor says this decision will give council time to make an informed plan for the future. Lethbridge will have a municipal election next year, so the new council will be forced to make those future decisions. More on MoneyMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tCanada Post strike tests public support heading into holidays: experts\t\t\t\t\tHow the Bank of Canada’s interest rate cut will provide relief to homeownersMore container homes open in CourtenayBreaking down the Bank of Canada’s last interest rate cut of 2024Money Matters with Baun and Pate Investment Group at Wellington-Altus Private Wealth“There’s a way we can find efficiencies, cost-savings, without doing service reductions. So, that’s something I think our administration has heard loud and clear. We’ll look at that over the next couple years, but it gives us that opportunity to try to find those cost-savings. So, the possibility of not having to look at a tax increase, if we’re able to find cost-savings in that time,” said Hyggen.For the LDE, this decision allows time to stabilize. A new board of governors and acting CEO took over in early 2024, so far reducing the projected deficit from an estimated $6.5 million to what they say will be under $3 million by the end of the year.“With council’s green light to move ahead, we are going to really zero in on our future revenues and work hard to build those up in both the short and long-term years,” said Kim Gallucci, acting CEO of Lethbridge & District Exhibition.  Story continues below advertisement However, the decision to keep LDE alive without a tax increase has left the city’s rainy day coffers a little lighter. This leaves the future budget uncertain.“Using the full contingency in one-time revenue poses different risks and that was really what administration wanted to bring forward for members of council to be aware of. As we’ve mentioned, all the options were viable options for (council) to consider, including the one they chose. So, from that point of view, obviously it works for the Lethbridge Exhibition and gives them funding over the next couple years. That’ll be part of the discussions for the next council as part of the operating budget moving forward,” said Darrell Mathews, Chief Financial Officer of the City of Lethbridge.Mathews had presented several options for council to consider. These ranged from closing the new Agri-Food Hub and Trade Centre, to a 2.24 per cent tax increase, a modified tax increase, or limiting city operations elsewhere. Related NewsCity council receives ‘concerning’ review on Lethbridge and District Exhibition\t\t\t\t\tMOU signed with City of Lethbridge and Lethbridge and District Exhibition\t\t\t\t\tCity council approves initial steps to help Lethbridge and District Exhibition\t\t\t\t\t"
    },
    {
        "Title": "‘Stubborn’ fixed mortgage rates might not fall despite Bank of Canada cut",
        "Date": "Posted December 12, 2024 3:44 pm",
        "Text": "The Bank of Canada’s latest oversized interest rate cut isn’t expected to deliver immediate relief to the Canadian fixed-mortgage market, experts warn.The central bank delivered a second consecutive half-point drop to its policy rate on Wednesday. After five straight cuts in 2024, the Bank of Canada’s key rate now stands at 3.25 per cent.Despite the substantial reduction in borrowing costs tied to the central bank’s benchmark rate, BMO senior economist Robert Kavcic warned in a note to clients Thursday that fixed mortgage rates in Canada may have already hit their floor.While Canadians with variable-rate debt like some mortgages and home-equity lines of credit will have seen an immediate reduction in their rates of interest in line with the Bank of Canada’s 50-basis-point cut, Kavcic warned those shopping for fixed-rate mortgages likely won’t see the same easing.  Story continues below advertisement  1:48Bank of Canada cuts rates by half a point but signals ‘more gradual’ paceThat’s because fixed-rate mortgages don’t respond directly to the Bank of Canada’s policy rate. Changes in the benchmark rate affect this side of the market indirectly by influencing bond yields, which lenders use as a proxy to price their fixed mortgage offerings.But amid signals from the Bank of Canada that it’s set to slow the pace of easing in 2025, Kavcic noted that the five-year Government of Canada bond yield — a key driver for popular five-year, fixed-rate mortgages — actually ticked higher on Wednesday. Get weekly money newsGet expert insights, Q&A on markets, housing, inflation, and personal finance information delivered to you every Saturday.Sign up for weekly money newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.While economists are widely expecting additional interest rate cuts next year, markets have also already priced in another 50-basis-points of easing by June, Kavcic said.Unless there’s a sharp change in expectations for the Bank of Canada, he argued there might not be much more “downside” for five-year yields.  Story continues below advertisement By extension, “the low for mortgage rates in a well-behaved economy might already be upon us,” Kavcic said.Victor Tran, Ratesdotca mortgage and real estate expert, tells Global News that bond yields and fixed-mortgage rates have both been “pretty stubborn” over the past three or four months.Fixed-mortgage rates have adjusted a bit higher or lower in recent weeks but have largely hovered in the low-to-mid-four-per cent range, Tran says.Heading into 2025, he expects homebuyers and those with mortgages up for renewal could potentially see rates fall into the high-three-per cent range, but he also warns that lenders are “treading cautiously” right now. 2:33Bank of Canada cuts key interest rate by 50 basis points amid ‘softer economic outlook’ Trending NowCanada Post strike: Minister seeks order to get workers back on the jobYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegThe Bank of Canada on Wednesday highlighted trade uncertainty with the United States — president-elect Donald Trump has floated imposing blanket tariffs on Canada when he takes office — as a major question mark making it difficult to make economic forecasts.  Story continues below advertisement Experts told Global News this week that if the tariffs are ultimately imposed as threatened, the resultant hit to Canada’s economy would force the central bank to cut its policy rate sharply to soften the blow.Tran says lenders don’t want to make major shifts in their fixed-rate mortgage offerings only to have to backtrack should the U.S. tariffs come to pass and the central bank’s rate path shifts drastically lower.But with the trend still broadly downward for the Bank of Canada’s policy rate, both Kavcic and Tran noted that the spread between fixed and variable mortgage rates is narrowing in the market. More on MoneyMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tCanada Post strike tests public support heading into holidays: experts\t\t\t\t\tHow the Bank of Canada’s interest rate cut will provide relief to homeownersMore container homes open in CourtenayBreaking down the Bank of Canada’s last interest rate cut of 2024Money Matters with Baun and Pate Investment Group at Wellington-Altus Private WealthVariable mortgages, which had been priced higher than their fixed counterparts while the Bank of Canada rapidly raised its policy rate in recent years, have come in closer to some fixed-rate mortgages in recent months.That’s changed the value proposition for some eyeing the housing market or with a mortgage up for renewal in early 2025, Tran says.“It’s a little bit more difficult, because now they’re fairly on par,” he says.“A lot of customers are having difficulty deciding whether just to lock in and have some stability on fixed rates, or go for the variable and hopefully be ahead in the next few months or so.”  Story continues below advertisement  5:47Breaking down the Bank of Canada’s last interest rate cut of 2024 "
    },
    {
        "Title": "Child benefit cheques delayed, but still coming, amid Canada Post strike",
        "Date": "Posted December 12, 2024 11:51 am",
        "Text": "Parents expecting this month’s Canada Child Benefit (CCB) cheques will have to wait a little while longer because of the ongoing Canada Post strike.Under an agreement between Canada Post and the Canadian Union of Postal Workers (CUPW), some socio-economic cheques, including the Canada Child Benefit, will continue to be delivered despite the national postal strike that reached the four-week mark on Thursday.December payments of the CCB are set to go out to eligible families who have children under the age of 18 on Friday. But those who are expecting cheques will see a one-week delay, according to the Canada Revenue Agency.“Canada Post will deliver benefit cheques for the Canada child benefit and related provincial and territorial benefits on December 20, 2024, one week later than expected,” CRA says on its website.  Story continues below advertisement However, direct deposit payments will still be made as per the schedule on Friday, Dec. 13.Canada Post told Global News on Thursday that under the agreement with the union, “CUPW has committed to provide enough volunteers to deliver the cheques.” 2:09Canada Post strike could cause Christmas gift delays — so what are the last days to ship? \t\t\t\tHow much can parents expect?\t\t\tThe CCB amounts were increased in July after a routine annual recalculation based on a family’s net income from the previous year and inflation.  Story continues below advertisement In December, parents could receive a maximum payment of $648.91 for each child under the age of six years. That is an annual increase of 4.7 per cent relative to 2023. Get weekly money newsGet expert insights, Q&A on markets, housing, inflation, and personal finance information delivered to you every Saturday.Sign up for weekly money newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.For every child aged six to 17 years, the maximum CCB payment will be $547.50, which is also a 4.7-per-cent increase from last year.Families will get the maximum amount for each child if their adjusted family net income is less than $36,502.“The payments gradually start decreasing when the adjusted family net income is over $36,502,” the CRA states on its website.Families whose total benefits for the year are less than $240 would have received a lump sum amount in July and therefore won’t be getting anything in December. 5:59Child poverty in Canada reaches somber milestone: report Trending NowSaskatchewan Premier Scott Moe calls for federal electionHow the Ford government in Ontario plans to escalate trade war with the U.S. \t\t\t\tWhat about other benefits?\t\t\tOther government benefit cheques that will continue to be delivered this month amid the strike include the Canada Pension Plan, Old Age Security, Veterans Affairs Canada payments and provincial cheques from Alberta, Saskatchewan, Ontario and Nova Scotia.  Story continues below advertisement CRA is encouraging Canadians to set up direct deposit payments to avoid any interruptions in receiving their benefits.“Direct deposit is the most efficient and surest method of payment that will not be impacted by a postal disruption,” the agency says.The nationwide strike by more than 55,000 Canada Post workers still shows no signs of a resolution.Both sides are still at odds over wage increases and weekend delivery among other issues including health and pension benefits in their labour negotiations. 0:29Canada Post, union resolve complaint over temporary layoffs "
    },
    {
        "Title": "Leafs’ Stolarz day-to-day with lower-body injury",
        "Date": "Posted December 13, 2024 2:04 pm",
        "Text": "Toronto Maple Leafs goalie Anthony Stolarz is day-to-day with a lower-body injury.Head coach Craig Berube announced the injury update Friday after Stolarz exited Thursday’s 3-2 win over the Anaheim Ducks following the first period.Stolarz shook out his right leg after Frank Vatrano fired a shot from the sideboards for an Anaheim power-play goal late in the first period, but the Maple Leafs appear to have avoided the worst. Related Videos1:48Toronto traffic forces NHL’s Utah players to walk to arenaToronto traffic forces NHL’s Utah players to walk to arenaHockey Preview: What to expect ahead of the NHL Season‘Truly an honour’: Auston Matthews named 26th captain of the Toronto Maple LeafsHouse of Hockey returns for second season‘The accountability is on me’: Shanahan accepts responsibility for Maple Leafs playoff failureAuston Matthews suffered from sickness, hit to head: Treliving‘Difficulty of the business’: Treliving addresses Keefe’s firing‘Just win’: MLSE President and CEO Keith Pelley speaks on future of the Maple LeafsToronto Maple Leafs fire head coach Sheldon KeefeLeafs hope to capitalize on momentum in first home game vs. BostonPrevious VideoNext Video  Story continues below advertisement The 30-year-old netminder signed in Toronto last summer and is off to a stellar start as a Maple Leaf, posting a .927 save percentage, 2.15 goals-against average and 9-5-2 record so far this season. Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Joseph Woll will carry the load in Toronto’s crease while Stolarz is out. The Maple Leafs also recalled netminder Dennis Hildeby on an emergency basis from the American Hockey League’s Toronto Marlies on Friday. Trending NowSaskatchewan Premier Scott Moe calls for federal electionCanada Post strike: Ontario utilities warn of penalties as millions await billsToronto visits the Detroit Red Wings on Saturday before hosting the Buffalo Sabres on Sunday.This report by The Canadian Press was first published Dec. 13 "
    },
    {
        "Title": "Alberta paramedics sound the alarm over shift vacancies ahead of the holidays",
        "Date": "Posted December 12, 2024 8:17 pm",
        "Text": "An Alberta paramedic is sounding the alarm after providing Global News with a series of screen shots showing more than 200 shifts on Christmas Eve, Christmas Day and New Years Eve are currently unfilled.Going by just the name ‘David’, out of fear of losing his job, the paramedic of more than a decade, says each year around the holidays, it gets worse and worse.“We’re providing a service that people absolutely depend on,” said David. “It used to be hard to get on in Calgary; you would have to start somewhere else in the province and work you way to a position in Calgary.  Now you can get a spot that’s full-time right out of school.”View image in full screen\t\t\t\t\tAn Alberta paramedic is sounding the alarm over reports more than 200 shifts remain unfilled on Christmas Eve, Christmas Day and New Years Eve.\t\t\t\t\t\t\t\t\tGlobal News\t\t\t\tMike Parker with the Health Sciences Association of Alberta says these shifts not being filled points to a larger issue within Alberta’s healthcare system.  Story continues below advertisement “We don’t have the folks to answer the phone, we don’t have the folks to respond to the emergency, we don’t have the folks in the hospital to take care of you when you get there,” explained Parker. “It’s all tied together.” Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Last year the Alberta government announced it was creating a new committee aimed at assessing EMS concerns and providing recommendations on how to improve working conditions.View image in full screen\t\t\t\t\tThe Health Sciences Association of Alberta says reports more than 200 paramedic shifts remain unfilled over the upcoming holidays points to a much larger problem within Alberta’s healthcare system.\t\t\t\t\t\t\t\t\tGlobal News\t\t\t\tThose words are hollow for anyone working on the front lines like David.“They talk a big game but it doesn’t translate into anything for us,” said David. “We don’t see any of the benefit, we just see more people leaving.”While the number of paramedics working in the system has remained the same, many say they have chosen to move from full-time to casual in order to protect what remains of their mental and physical health.  Story continues below advertisement In a statement provided to Global News, AHS says the holidays are a bust time for paramedics and they have been proactive to plan several months in advance to address potential increases in demand by adding additional resources, offering overtime, expanding surge capacity and working with emergency departments in order to reduce patient off-loading delays. Related NewsAlberta health care worker speaks out about AHS changes\t\t\t\t\tHealth care expert concerned about patient care amid looming AHS restructuring\t\t\t\t\t"
    },
    {
        "Title": "One year later, daughter of missing senior continues push for change",
        "Date": "Posted December 12, 2024 7:10 pm",
        "Text": "On Dec. 12, 2023, 81-year-old Earl Moberg left his River East home and never returned.A year later, his daughter Britt Moberg is still looking for answers while dealing with the “devastating” loss.“For the family to lose my dad, and in this way, and not find him,” she said. “It’s just hard to actually accept this as reality.”Earl Moberg lived with dementia. He lived at home in Winnipeg with his wife. He was known to wander, as about 60 per cent of people with dementia do at some point, according to the Alzheimer’s Society of Manitoba.His wife Brenda was his primary caregiver, and despite being recommended 24-hour supervision over a year prior, he only received one day of home care — on the day he went missing.  Story continues below advertisement Ground searches with the Bear Clan Patrol and community volunteers in the days that followed didn’t offer any leads. Earl Moberg is now presumed deceased. Get weekly health newsReceive the latest medical news and health information delivered to you every Sunday.Sign up for weekly health newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“It just felt unreal,” Britt remembers. “Like, is this actually really happening? Am I actually in the field looking for my dad’s remains?” More on HealthMore videos$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\t‘Abnormally high’ flames spur recall for thousands of candles in Canada\t\t\t\t\tCanadians concerned country’s children are too soft, with no coping skills: survey\t\t\t\t\tWorld’s oldest newlyweds have a combined age of 202\t\t\t\t\tHealth Matters: Canada Post workers seek improved health and safety measures on the jobMore container homes open in CourtenayWearing a mask while exercising indoors improves lung functionAlberta paramedics sound the alarm over shift vacancies ahead of the holidaysIn the past year, Britt has made several trips to Winnipeg from her home in Victoria and spent countless hours working to ensure no other family experiences what hers has. Earl’s disappearance was deemed a critical incident in June after Britt sent a detailed account of the circumstances that led to her father’s disappearance to the Winnipeg Regional Health Authority’s Critical Incident Review Committee and Health Minister Uzoma Asagwara.The committee consulted with Britt and Brenda on their preliminary recommendations, and Britt says the WRHA will be sharing the final recommendations with her next week.She’s also advocated for a Silver Alert program that would notify people of missing seniors through their cellphones, much like the Amber Alert system. A petition to the government of Canada, which is collecting signatures until Jan. 20, 2025, had over 2,300 signatures at time of publication.Britt says a recent case where a Saanich, B.C. man with dementia who died after escaping his care home reaffirmed the need for a Silver Alert system.  Story continues below advertisement “It’s really distressing. I’m thinking about that person and their family and what their family is going through,” she said.She adds the support of her father’s MLA and MP, Drag the Red, Bear Clan Patrol, and community members has kept her going over the past year.“It’s been really touching just to see how many people out there care and how many people out there are impacted by dementia,” she said.Britt hopes the Critical Incident Review Committee’s recommendations will help improve the lives of those living with dementia.“I think people grieve in different ways,” she said. “For me, looking at my dad’s situation and seeing how I think that it could have been preventable… I think that just means trying to advocate for the changes that could prevent that.“I just want to feel like I’ve done everything that I can.” Related NewsMissing senior case investigated as critical incident\t\t\t\t\tVancouver police say missing senior found safe\t\t\t\t\tB.C. promised a ‘Silver Alert’ system for missing seniors with dementia. Where is it?\t\t\t\t\t"
    },
    {
        "Title": "The Ongoing History of New Music, episode 1034: 60 Mind-Blowing Facts About Music in 60 Minutes (2024 Edition)",
        "Date": "Posted December 13, 2024 9:00 am",
        "Text": "I am just finishing up my end-of-year cleanup, I do research for Ongoing History programs pretty much 24/7, looking for stuff to talk about, trying to figure out what topics need to be covered, and so on. And let me tell you something: I accumulate a lot of material.Newspaper clippings. Magazines where I’ve turned down pages where I found something interesting, There are dozens of books that contain cool nuggets of information with more dog-eared pages and highlighted passages. Notebooks and notepads with scribbles. And then there are all the Post-It notes with something written on them.And don’t get me started on all the web pages I’ve bookmarked and all the documents in the “research” file on my computer. Wait that’s computers, plural.I don’t come close to using all this information in any Ongoing History project. But i can’t seem to stop hoarding material. I keep thinking “Well, I don’t need this now, but what if I do in the future and can’t find it again?”  Story continues below advertisement Here’s an example. In early 2024, I ran across a recording of the loudest burp ever recorded—well, the loudest burb by a female ever recorded. Her name is Kimberly Winter and—wait, let me show you, This 107.3 decibels.That has nothing to do with music—yet. But you never know when you’re going to need audio like this, Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.What I’m trying to say is that once again, it’s time to clean up the office with my annual massive data dump of information that I’ve collected over the last 12 months. I have found no use for any of this stuff, but maybe you’ll have better luck. Trending NowTrump says it’s ‘fine’ after Ford threat to cut energy to border statesSaskatchewan Premier Scott Moe calls for federal electionThis is the 2024 edition of 60 Mind-Blowing Facts About Music in 60 Minutes.Songs on this episode:  Story continues below advertisement Wilko Johnson, Blow Your MindDevo, Whip ItSinead O’Connor, MandinkaThe Vapors, Turning JapaneseBilly Idol, Rebel YellOasis, WonderwallThe Clash, London CallingFine Young Cannibals, Good ThingThe Dreamboys, Outer LimitsThe Worst Song in the WorldHere’s Eric Wilhites’ playlist.The Ongoing History Music can be heard on these stations. Don’t forget that there’s a podcast version, too, in case you miss any episodes. Get them for free wherever you get your podcasts.102.1 The Edge/Toronto – Sunday night at 7pmQ107/Toronto – Sunday night at 9pmLive 88-5/Ottawa – Saturdays at 9am and Sundays at 6pm.107.5 Dave-FM/Kitchener – Sunday nights at 11pmFM96/London – Sunday nights at 8pmPower 97/Winnipeg – Sunday nights at 10am and 10pm107-3 The Edge/Calgary – Sundays at 10am and 10pmSonic 102.9/Edmonton – Sunday at 8am and 8pmThe Zone/Victoria – Sunday at 8am and 9pmThe Fox/Vancouver – Sundays at 10anm and 10pmSurge 105/Halifax – Sunday at 7pmWAPS/WKTL The Summit/Arkon, Canton, Cleveland, Youngstown – Mon-Fri at 9pm More on EntertainmentMore videosDiddy hit with more lawsuits, 3 men say they were drugged, sexually assaulted\t\t\t\t\tSelena Gomez engaged to record producer Benny Blanco\t\t\t\t\tB.C. announces increased tax incentives to attract more film and TV productions\t\t\t\t\tJordan Peterson says he’s left Canada and moved to the U.S.\t\t\t\t\tEdmonton Opera celebrates the holidays at Epic MarketSparkle Tour holiday displays light up Saskatoon neighbourhoodsCelebrity mentalist George Kresge Jr., aka The Amazing Kreskin, dies at 89Consumer Matters: StubHub resale hubbub"
    },
    {
        "Title": "B.C. announces increased tax incentives to attract more film and TV productions",
        "Date": "Posted December 12, 2024 4:31 pm",
        "Text": "B.C. has announced increased tax incentives to attract more major film and television productions to the province.Premier David Eby said on Thursday that next year’s budget will include increases to the Film Incentive BC (FIBC) tax credit, which supports Canadian-content productions, and the production services tax credit (PSTC) that provides a tax incentive for international projects made in B.C. 1:45Hollywood North film tax credit concerns“Our province is home to one of the busiest film and TV production centres in North America,” Eby said. ͞”But film production in B.C. has taken a big hit over the last few years, responding to significant impacts from the pandemic, multiple labour disruptions and changes to industry practices.”  Story continues below advertisement In October, California Gov. Gavin Newsome proposed to more than double the state’s film tax credit program from $330 million to $750 million a year, hoping to attract more productions back to the state. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.British Columbia currently offers a 28-per cent production services credit to both domestic and foreign producers, with no requirement for Canadian content.With the approval of the budget, the FIBC will increase from 35 per cent to 36 per cent and the PSTC will increase from 28 per cent to 36 per cent for productions with principal photography starting Jan. 1, 2025.Projects with B.C. production costs of greater than $200 million will receive a two-per cent bonus. 2:02B.C. made show ‘Shōgun’ shines at the 2024 Emmys Trending NowCanada Post strike: Minister seeks order to get workers back on the jobYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegEby said the province also intends to restore regional and distant location tax credits for companies with a bricks-and-mortar presence outside of Metro Vancouver, the Fraser Valley and Whistler/Squamish.  Story continues below advertisement “B.C. is a motion-picture powerhouse with spectacular locations, world-class crews, studios and outstanding creative talent that major productions rely on,” Spencer Chandra Herbert, Minister of Tourism, Arts, Culture and Sport said in a statement.“I was recently in Los Angeles and heard directly from studio executives about the significant production increases in B.C. that would flow from changes like these. These changes will help us land more top-tier projects, fuel economic and job growth, and showcase everything we love about B.C. to the world.”Some of the projects recently made in B.C. include Murder in a Small Town, starring Rossif Sutherland and Kristen Kreuk, Watson starring Morris Chestnut, more than 20 Hallmark Christmas movies and season two of the HBO blockbuster series The Last of Us starring Pedro Pascal and Bella Ramsey. More on EntertainmentMore videosDiddy hit with more lawsuits, 3 men say they were drugged, sexually assaulted\t\t\t\t\tSelena Gomez engaged to record producer Benny Blanco\t\t\t\t\tJordan Peterson says he’s left Canada and moved to the U.S.\t\t\t\t\tThe Ongoing History of New Music, episode 1034: 60 Mind-Blowing Facts About Music in 60 Minutes (2024 Edition)\t\t\t\t\tEdmonton Opera celebrates the holidays at Epic MarketSparkle Tour holiday displays light up Saskatoon neighbourhoodsCelebrity mentalist George Kresge Jr., aka The Amazing Kreskin, dies at 89Consumer Matters: StubHub resale hubbub"
    },
    {
        "Title": "Diddy hit with more lawsuits, 3 men say they were drugged, sexually assaulted",
        "Date": "Posted December 12, 2024 3:08 pm",
        "Text": "Three men sued Sean “Diddy” Combs in New York on Thursday, claiming the hip-hop mogul drugged and raped them.The lawsuits, which were filed anonymously in a state court, add to a wave of sexual assault litigation against the rapper, producer and record executive as he also faces federal sex trafficking charges in New York.Thomas Giuffra, a New York attorney who filed Thursday’s lawsuits on the men’s behalf, said Combs used his power and wealth to take advantage of the accusers and then ensured their silence through threats and fear.“This is a long overdue opportunity for the victims to take the power back after carrying the burden of the assaults in silence for several years,” he said in a statement. “While a lawsuit will not undo the wrongs done to them, it enables the survivors to regain the power and dignity that was stripped from them by Sean Combs.”  Story continues below advertisement View image in full screen\t\t\t\t\tIn this courtroom sketch, Sean “Diddy” Combs’ defense lawyer Marc Agnifilo, left, addresses the judge while Combs, seated second from right, in a prison uniform, watches during a hearing in federal court in New York on Oct. 10, 2024.\t\t\t\t\t\t\t\t\tElizabeth Williams via AP\t\t\t\tLawyers for Combs, 55-year-old founder of Bad Boy Records, said the claims are baseless. Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“These complaints are full of lies,” the lawyers wrote in a statement, declining to elaborate. “We will prove them false and seek sanctions against every unethical lawyer who filed fictional claims against him.”The lawsuits involve incidents taking place from 2019 to 2022. The men, all identified as John Doe, say they were unwittingly served drugged drinks and then sexually assaulted by Combs and others. 1:55Jay-Z accused of raping 13-year-old girl, rapper denies allegationJay-Z accused of raping 13-year-old girl, rapper denies allegationWhat is ‘pink cocaine’? The drug linked to Liam Payne, DiddyAttorney representing over 100 alleged victims of Sean ‘Diddy’ Combs speaks outPrevious VideoNext Video  Story continues below advertisement They each seek a jury trial and to be awarded unspecified damages from Combs.One of the men claims Combs drugged and raped him in 2020 when the two met at Combs’ suite at the InterContinental hotel in Times Square to discuss payments the man was owed as a longtime employee of the entrepreneur. Trending NowCanada Post strike: Ontario utilities warn of penalties as millions await billsSaskatchewan Premier Scott Moe calls for federal electionAnother claims he met Combs in 2019 at a Manhattan nightclub and was invited to an afterparty at Combs’ suite at the Park Hyatt hotel, where he was also drugged and raped.The man said he tried to resist before the drugged drink left him unconscious. He also said he was given $2,500 after the attack by a man who had been recording the bedroom assault. 2:38Sean ‘Diddy’ Combs forced victims in ‘Freak off’ sex performances, feds allegeSean ‘Diddy’ Combs forced victims in ‘Freak off’ sex performances, feds allegeSean ‘Diddy’ Combs to fight charges with ‘all of his energy’Sean ‘Diddy’ Combs faces another lawsuit over alleged rape, sexual assaultSean ‘Diddy’ Combs’ LA, Miami homes raided by U.S. federal agents following sex trafficking accusationsPrevious VideoNext VideoThe third man claims he was drugged and raped by Combs and associates from his record label during a summertime party in 2020 at Combs’ mansion in East Hampton, New York.  Story continues below advertisement Combs has pleaded not guilty to federal charges that he coerced and abused women for years, using a network of associates and employees to hold drug-fuelled, elaborately produced sexual performances known as “Freak Offs” involving male sex workers.Prosecutors say he then silenced his victims through blackmail and violence, including kidnapping, arson and physical beatings.Combs has been seeking to be released until his trial in May but was denied bail a third time last month and remains in a federal jail in Brooklyn. More on EntertainmentMore videosSelena Gomez engaged to record producer Benny Blanco\t\t\t\t\tJordan Peterson says he’s left Canada and moved to the U.S.\t\t\t\t\tB.C. announces increased tax incentives to attract more film and TV productions\t\t\t\t\tThe Ongoing History of New Music, episode 1034: 60 Mind-Blowing Facts About Music in 60 Minutes (2024 Edition)\t\t\t\t\tEdmonton Opera celebrates the holidays at Epic MarketSparkle Tour holiday displays light up Saskatoon neighbourhoodsCelebrity mentalist George Kresge Jr., aka The Amazing Kreskin, dies at 89Consumer Matters: StubHub resale hubbub"
    },
    {
        "Title": "Kelowna doctor donates proceeds from joke book to Prostate Cancer Foundation Canada",
        "Date": "Posted December 11, 2024 9:06 pm",
        "Text": "To Dr. David Goldberg, laughter really is the best medicine.It’s what has always fueled the family doctor and surgical assistant in orthopedic surgery at Kelowna General Hospital.He began telling jokes in the hospital’s operating theatre to pass the time while the cement hardened to replace a joint, a period during an operation he said no other work can be done.Turning to humour helped him through his own diagnosis of prostate cancer.“I was aware that I was at a higher risk for prostate cancer given my family history and as a result, I was making sure I was having my P.S.A.’s tested regularly,” said Dr. Goldberg. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“P.S.A. stands for Prostate-Specific Antigen and it’s a blood test done in order to see if your prostate is metabolically more active and therefore could perhaps could be at risk for prostate cancer.”  Story continues below advertisement Dr. Goldberg said that he saw a bump in his P.S.A. levels and received his diagnosis of early-stage prostate cancer in 2022. He began writing a joke book while he was getting treatment. Now he has become an advocate, encouraging men to get their P.S.A.’s tested.After the first round of his book’s publication in March, he donated some of the proceeds to the KGH Foundation. He’s now published an updated version, with a portion of the proceeds to be donated to Prostate Cancer Foundation Canada.“We use humour as a way of coping with a lot of life’s stressors and the joke book has helped me do that and it’s helped many of my patients,” said Dr. Goldberg. More on LifestyleMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\t$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tChristmas cookie decorating fun at Christies BakeryMore container homes open in CourtenayThis is BC: Celebrating an aviation legendSearch continues for missing 68-year-old skier at Sun PeaksBeing a doctor, going through the diagnosis and treatment himself gives him a unique outlook on the process.“I have been a family doctor for 30 years and I have actually treated and been involved in the diagnosis and treatment of prostate cancer and it helps in some ways to have gone through it myself to see what areas they may need more support in,” said Dr. Goldberg.Right now the book is being sold at Indigo across British Columbia and Mosaic Books in Kelowna as well as at Kelowna General Hospital.Goldberg said he hopes that it will eventually be sold across Canada to raise more funds for the non-profit.  Advertisement Related NewsKelowna doctor releases charitable joke book\t\t\t\t\tOkanagan doctor releases joke book\t\t\t\t\t"
    },
    {
        "Title": "Russia’s latest move to combat low birth rates? Paying students to have kids",
        "Date": "Posted December 11, 2024 4:08 pm",
        "Text": "Almost a dozen regions in Russia are getting set to offer a cash payment to young women who give birth, Russian outlets are reporting, but there’s a pretty big catch.According to the Moscow Times, monetary childbirth incentives will be offered in at least 11 Russian regions and will go into effect on Jan. 1, 2025. If a young woman successfully carries the child to term, they will be paid 100,000 rubles, or approximately C$1,300.The bonuses, which were first announced in a handful of regions in the summer, come with strict criteria. While it varies by region, all require the mothers-to-be to be full-time students at a local college or university. Additionally, they must be under the age of 25 when they give birth.The eligibility is also nullified if the mother fails to carry the child to term, meaning a stillborn baby would disqualify the woman from receiving payment.  Story continues below advertisement Last month, Russia’s lower house of parliament voted unanimously to ban what authorities cast as dangerous propaganda for a child-free way of life, hoping to boost a faltering birth rate, reports Reuters.Official data released in September put Russia’s birth rate at its lowest in a quarter of a century while mortality rates are up as Moscow’s war in Ukraine rages on and a wartime exodus sees citizens moving abroad. The Kremlin called the figures “catastrophic for the future of the nation.” 5:30Canada’s birth rate hits all time lowPresident Vladimir Putin has said that three-child families should be the norm in Russia in order to secure the future of the country. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The ban on child-free propaganda also includes any content deemed to promote “non-traditional lifestyles” such as same-sex relationships or gender fluidity, as well as dissenting accounts of the conflict in Ukraine. Violators can face large fines.  Story continues below advertisement “We are talking about protecting citizens, primarily the younger generation, from information disseminated in the media space that has a negative impact on the formation of people’s personality,” said Vyacheslav Volodin, chairman of the lower house and a senior Putin ally, in November after the ban was announced.“Everything must be done to ensure that new generations of our citizens grow up centred on traditional family values.”In recent month, Russian lawmakers have made sweeping and panicked changes to health policy, as well as offering new cash incentives, in an attempt to course correct on low birth rates. 0:47Boosting Italy’s birth rate: Hotels offer free stay for guest couples who conceive Trending NowCanada Post strike: Minister seeks order to get workers back on the jobSaskatchewan Premier Scott Moe calls for federal electionThe government has proposed using public funds to pay for newlywed wedding night stays at hotels, in the hopes they conceive, as well as encouraging women to use their breaks at work to have sex with the intention to get pregnant.  Story continues below advertisement A regional health minister, Yevgeny Shestopalov, said on Russian TV in September that women should “engage in procreation on breaks.”Per Newsweek, he added: “Being very busy at work is not a valid reason but a lame excuse. You can engage in procreation during breaks, because life flies by too quickly.”And last year, Newsweek additionally reports, a member of Russia’s lower house suggested that female prisoners be released to procreate, with the hopes of increasing the nation’s birth rate, and their sentences be cancelled if they are successful in having a child.The country’s health authority also announced expansion to fertility testing, with some women in Moscow reporting having received unsolicited referrals to testing clinics.Russia isn’t the only country grappling with low birth rates. According to Statistics Canada report released in September, the Canadian fertility rate in 2023 was 1.26 children per woman, which is the lowest recorded level since the agency began collecting data.A StatCan report published in January said Canada, like other countries, is riding the “fertility ‘pandemic rollercoaster’” with more families putting off having children. 3:39Financial concern a key reason Canadians are having fewer kids: pollFinancial concern a key reason Canadians are having fewer kids: pollFertility treatments on riseImpact inflation, living costs have on birth rates and Canadians on parental leavePrevious VideoNext Video  Advertisement More on WorldMore videosMan who faked own death arrested, charged — and his wife files for divorce\t\t\t\t\tMacron names Francois Bayrou as new French PM. Who is he?\t\t\t\t\tCalifornia couple shot dead in Mexico while on vacation for the holidays\t\t\t\t\tFormer U.S. Speaker Nancy Pelosi admitted to hospital after injury in Europe\t\t\t\t\tMarie Antoinette ‘smartwatch’ on display in LondonSyria’s transition: U.S. racing to play role in shaping country’s futureSouth Korea’s president says he’ll fight impeachmentYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg"
    },
    {
        "Title": "37th annual Pan Pacific Christmas Wish Breakfast is back on Dec. 17",
        "Date": "Posted December 11, 2024 3:54 pm",
        "Text": "The 37th annual Pan Pacific Christmas Wish Breakfast will take place this year from 6 a.m. to 9 a.m. on Dec. 17.Donate new and unwrapped toys (or cash or gift card donation on the day of) and receive a complimentary breakfast from the Pan Pacific.Your donation will help and support the Lower Mainland Christmas Bureau.The Global News Morning team: Jason Pires, Sonia Sunger, Mark Madryga and Katelin Owsianski & Rock 101 Willy in the Morning will be LIVE on location with broadcast sponsor FortisBC. 1:46Timelapse of Christmas Wish Breakfast toy pileTop Christmas Wishes from the Lower Mainland Christmas Bureau Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Ages 0 to 4Outdoor toys: e.g. tricycle, kick scooter, balance bike, ballsBuilding blocks: e.g. Megablocks, wooden blocks, stacking blocksMusical toys: e.g. xylophone, maracas, drumsEducational toys: e.g. Leapfrog, co-operative board games, Trace-n-Erase chalkboards, Magna-Tiles, Toy ToolboxArts and crafts: Play-doh, crayons, paints & easelsImagination toys: toy cars and train sets, magnetic fishing sets, play food sets, dollsAges 5 to 11 Trending NowCanada Post strike: Minister seeks order to get workers back on the jobSaskatchewan Premier Scott Moe calls for federal electionOutdoor toys: e.g. kick scooter, bicycle, soccer ball, basketball, sledGames & puzzles: e.g. Pokemon Cards, Perplexus, Monopoly, Cranium Family Edition Sorry, Twister, Chutes and LaddersArts and craft sets: e.g. pencil crayons, pastels, DIY craft kits, jewelry making setsSTEM toys: e.g. science kits, kids coding games, Imagination toys: e.g. pretend and dress up, interactive pet toysBuilding blocks and sets: e.g. Lego, marble maze, Kiva blocksAction figures and dolls: e.g. Barbie, play sets, video game characters, Marvel action figuresAge-appropriate electronicsAges 12 to 18Sports and activities: e.g. Nerf toys, bicycle, hockey gear, skateboard, activity trackerGames, Arts & Crafts: e.g. Settlers of Catan, Cards Against Humanity, Scrabble, Codenames, Telestrations, professional art supplies, intricate models, advanced Lego setsElectronics: e.g. video game consoles, tablets, portable chargers, Fujifilm Instax or Polaroid Camera and film; handheld gaming devicesMusical items: e.g. guitars, keyboards, drums, Bluetooth speakers, headphones, wireless earbudsLifestyle: e.g. watch/smartwatches, fitness/water bottles, backpacks, books, travel mugs, make-up, jewellery, hair styling tools, wallets, pursesTickets and gift cards: tickets for concerts & sports events, gift cards for clothing, electronics, etc. so that tweens and teens can pick out something for themselves that they will love and need (can be donated on-site) More on LifestyleMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\t$32.5B settlement with tobacco giants approved by creditors, lawyer says\t\t\t\t\tCanada’s maple syrup harvest up 91% — but it may not sweeten prices\t\t\t\t\tChristmas cookie decorating fun at Christies BakeryMore container homes open in CourtenayThis is BC: Celebrating an aviation legendSearch continues for missing 68-year-old skier at Sun Peaks"
    },
    {
        "Title": "Former Piikani Nation councillor breaks silence on contentious Grassy Mountain coal mine",
        "Date": "Posted December 11, 2024 1:45 pm",
        "Text": "Former Piikani Nation councillor of 20 years, Fabian North Peigan, whose Blackfoot name is Last Otter, has shared his perspective on the Grassy Mountain coal mining site, which is located on Piikani traditional territory.Australia’s Northback Holdings has applied for explorational drilling of the site in the Crowsnest Pass area with intention to mine, which has created deep fractures within many southern Alberta communities, between those for and against the project.Piikani Nation members rallied in Brocket, Alta., on Monday in protest of the project, voicing concerns about its possible impact on the Old Man River.The protest follows chief and council’s announcement of support for Northback’s drilling application last week.“I stand with our people that our showing frustration of this process and I support them, and I’ll continue to support them,” said North Peigan.  Story continues below advertisement “At the same time, I urge our elected government to be just a bit more transparent, so that we won’t have these breakdowns.” Get daily National newsGet the day's top news, political, economic, and current affairs headlines, delivered to your inbox once a day.Sign up for daily National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Piikani Nation Chief Troy “Bossman” Knowlton says tribal government has been transparent, emphasizing that the mining project hasn’t been approved yet.“I’m not willing to sign anything until we have meaningful discussion, looking at the pros and cons, and looking forward,” said Knowlton. “The concerns today that some have about chief and council signing anything or receiving anything — it’s absolutely untrue.” More on CanadaMore videosCanada Post strike: Minister seeks order to get workers back on the job\t\t\t\t\tCanada Post strike: Ontario utilities warn of penalties as millions await bills\t\t\t\t\tDoug Ford threatened to stop energy exports to the U.S. How would it work?\t\t\t\t\tQuebec, Ottawa announce $100M deal to fight homelessness\t\t\t\t\tYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in Winnipeg‘Fine’: Trump dismisses Ford’s threat to cut Americans off from Ontario energyCanada Post, union resolve complaint over temporary layoffsSaskatchewan Premier Scott Moe calls for federal electionNorth Peigan calls Northback’s drilling program application “an inventory of the mountain,” to find out how much coal can be extracted, and how long that extraction process might take.“”If they’re granted this application to do that, the greater issue is going to come to the forefront, which is the application to mine it, which now becomes the application of greater interest,” said North Peigan. “It’s the operation in which they’re going to extract the coal.”North Peigan noted the outstanding impact benefit agreements and environmental mitigation plans from the Old Man River Dam, which was built by the federal and provincial governments in the early ’90s, despite opposition from Piikani members.The impacts of the dam have forever changed the nation’s river valley, which is culturally sacred to its people.  Story continues below advertisement He says if the application to mine Grassy Mountain is approved, a robust impact benefit agreement addressing employment, training, water access, health care, and long-term partnership between Piikani Nation and Northback Holdings is vital.“I urge our leaders to do their very best to protect their responsibility, whom are their people. I urge our people to do their very best to protect our way of life, and our children, and together, hopefully we can prevail, and preserve the water,” said North Peigan.“In the event that this argument is lost once again, just like the Old Man Dam, and in the event, which is the worst-case-scenario, the coal mine is granted the privilege to open, then I urge our leadership to ensure that such an elaborate impact benefit agreement beyond measure be instituted and be privileged for all time.”Watch the video above to learn more. Related NewsPiikani Nation members protest Grassy Mountain coal mining project\t\t\t\t\tSupporters, opponents of Alberta coal mine square off at public hearing\t\t\t\t\tCrowsnest Pass residents vote overwhelmingly for new Alberta coal mine\t\t\t\t\t"
    },
    {
        "Title": "Global’s annual Morning of Giving fundraiser returns to help spread some Christmas cheer",
        "Date": "Posted December 6, 2024 1:09 pm",
        "Text": "Global’s Morning of Giving charity fundraiser returns again this year to help spread some Christmas cheer to seniors, families and others in our communities who are in need.The annual event, hosted by Global Calgary’s Leslie Horton in support of The Magic of Christmas, takes place on Dec. 11 from 6-9 a.m. at the ATCO Blue Flame Kitchen.In 2023 Calgarians generously donated more than $137,000 to the Morning of Giving.View image in full screen\t\t\t\t\tGlobal Calgary’s Leslie Horton is joined by Santa Claus as she hosts the annual Morning of Giving fundraiser in support of The Magic of Christmas.\t\t\t\t\t\t\t\t\tGlobal Calgary\t\t\t\tCharity partner Calgary Transit also contributes buses and the drivers graciously donate their time to head out with Santa and his elves to have fun delivering the gift bags, gift cards and other holiday surprises.  Story continues below advertisement The charity will also enlist the help of Santa to deliver gifts and Christmas cheer to seniors’ homes and hospitals around the city. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“This event really shows how our community comes together to support our neighbors and friends who need a little extra help this season,” said Horton.“To watch the kids receive a Santa visit and a bag of gifts with big eyes and big smiles warms my heart and to watch the parents gratitude that others came together to make the day special is truly the Christmas spirit.”There are hundreds of families on the list this year, so Santa will be very busy.View image in full screen\t\t\t\t\tThe Heebee-jeebees are joined by Santa Claus as they help spread some Christmas cheer at Global Calgary’s Morning of Giving in support of The Magic of Christmas.\t\t\t\t\t\t\t\t\tGlobal News\t\t\t\t Trending NowCanada Post strike: Ontario utilities warn of penalties as millions await billsTrump says it’s ‘fine’ after Ford threat to cut energy to border statesHorton will join Santa and all the Christmas elves outside, in the traffic circle at the south end of the Blue Flame Kitchen, at 5302 Forand St SW, where you can drive through and drop off your generous donation of toys, gifts, gift cards or cash to support those in need.  Story continues below advertisement Or if you are unable to attend the event or wish you can donate online you can do so at The Magic of Christmas website.View image in full screen\t\t\t\t\tIn 2023 Calgarians generously donated more than $137,000 to Global Calgary’s Morning of Giving in support of the Magic of Christmas to help spread some holiday cheer to those in need.\t\t\t\t\t\t\t\t\tGlobal Calgary\t\t\t\t "
    },
    {
        "Title": "Advocates outraged after dozens of memorial red dresses vandalized on Vancouver Island",
        "Date": "Posted November 27, 2024 8:48 pm",
        "Text": "Advocates for missing and murdered Indigenous people say they’re angry and disturbed about repeated vandalism targeting a memorial along Vancouver Island’s Inland Highway.Activist Leslie Hnatiw, a member of the Wei Wai Kum First Nation from ƛəmataʔaxʷ (Ccampbell River spearheaded the initiative, which saw 48 wooden red dresses — a national symbol for missing and murdered Indigenous women and girls — along the highway between Campbell River and Comox.The dresses were crafted by community members with donated wood and paint, and in many cases reference specific women and girls who have vanished or been killed. 1:59Canada marks National Day of Awareness for MMIWGThe installation went up on May 5, Red Dress Day, but in the months since at least 28 of them have been torn down or damaged in other ways.  Story continues below advertisement “It’s very disturbing what has happened here. This is a child that has been murdered,” Hnatiw said of one of the damaged signs.“The fact it was violently destroyed multiple times, taken down off these posts, is very disturbing, is very saddening and disheartening.”Hnatiw said she reached out to Campbell River Mayor Kermit Dhal about the issue in October and met with him earlier this month. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.During that meeting, she asked for the city to issue a clear statement denouncing the vandalism — but has heard nothing from the city since.Missing and murdered Indigenous people advocate Raven Hall said that’s not good enough. 2:09Ceremonies mark Red Dress Day“I would like to see a public statement so that the community is very well aware that these red dresses are not garbage on the highway. I would like to hear a formal announcement that these dresses will remain and they are not to be touched,” she told Global News.  Story continues below advertisement “Because taking down each of those dresses, in my opinion, is a hate crime.”Hall said all levels of government in Canada have failed to make virtually any progress on the 231 calls for justice identified in the 2019 National Inquiry into Missing and Murdered Indigenous Women and Girls.She said if the local municipality was unwilling to stand up for the dresses in this case, it should stop speaking about its commitment to reconciliation. Trending NowCanada Post strike: Minister seeks order to get workers back on the jobTrump says it’s ‘fine’ after Ford threat to cut energy to border statesDhal was not available for an interview, but in a statement, the city urged anyone with information on the vandalism to call the RCMP.“The City of Campbell River acknowledges the trauma caused by the removal and destruction of the red dresses along Highway 19 and wholeheartedly supports education about the significance of the National Day of Awareness for Missing and Murdered Indigenous Women and Girls, also known as Red Dress Day,” it said.In a statement, B.C. Minister of Indigenous Relations and Reconciliation Christine Boyle denounced the vandalism. 2:19‘We need action’: AFN chief slams Ottawa’s lack of progress to address MMIWG“The vandalizing of the memorial is an ugly reminder of the racism, colonialism and misogyny that continues in our everyday lives,” the statement reads.  Story continues below advertisement “Every single Indigenous woman, girl and two-spirit person needs to be able to feel safe in their community, neighbourhood and home. We remain steadfast and committed to ending violence against Indigenous women and girls.”Making matters worse, advocates posted on a local Facebook group asking for the dresses to be left alone, only to meet with a torrent of racist and abusive comments in return.The group behind the red dresses is now fundraising to buy more wood, paint and supplies to craft new signage, saying they won’t back down.“This is colonial violence and oppression and racism,” Hnatiw said.“It’s a further attempt to silence Indigenous people and to perpetrate further harm and violence and hate.”RCMP are investigating the vandalism, but say it is too early to speculate about a motive. More on CrimeMore videosHomicides in Canada dropped in 2023. Here’s what the numbers say\t\t\t\t\tEx-TD Bank worker in U.S. charged with alleged money laundering to Colombia\t\t\t\t\tDismembered head found 36 years ago in Ontario river. Now, police know who he is\t\t\t\t\tPolice say more evidence ties Luigi Mangione to UnitedHealthcare CEO killing\t\t\t\t\tBorder officer almost hit by B.C. carjacking suspectSurrey man charged in assault on golf course caught on videoNo day parole for convicted killer Travis VaderFive people arrested in North Vancouver drug bust"
    },
    {
        "Title": "Vancouver Whitecaps FC to be put up for sale",
        "Date": "Posted December 13, 2024 1:56 pm",
        "Text": "The owners of the Vancouver Whitecaps FC announced Friday that they have started the process to sell the club.This move comes after careful “consideration of the club’s journey and reflection on what is required to ensure its continued growth and success,” owners Greg Kerfoot, Steve Luczo, Jeff Mallett and Steve Nash said in a statement.They said they built a solid foundation for the club and now is the right time for an owner with the resources and ambition to take the next steps.“Our group have been committed to transforming our local soccer club into a significant contributor to our community,” Kerfoot said. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.“It is gratifying to see how meaningful the Whitecaps have become to so many, and to have been able to contribute to the growth of a vibrant and thriving soccer community in Vancouver, the Lower Mainland, British Columbia, and beyond.”  Story continues below advertisement This news comes a few weeks after the Whitecaps parted ways with head coach Vanni Sartini.Sartini joined the club at the start of the 2019 season before becoming acting head coach for the first team in August 2021.He was officially named head coach at the end of November 2021. Trending NowYazidi teen says she escaped ISIS in Iraq, only to be sexually assaulted in WinnipegHow the Ford government in Ontario plans to escalate trade war with the U.S. 3:25Vancouver Whitecaps fire head coach Vanni SartiniVancouver Whitecaps fire head coach Vanni SartiniA peek inside Vanni Sartini’s daily journalCoach Vanni Sartini on Vancouver Whitecaps’s playoff matchVancouver Whitecaps striker Brian White on playoff   series with LAFCWhitecaps win third straight Canadian ChampionshipWhitecaps gear up to welcome Wrexham FCPrevious VideoNext VideoKerfoot acquired the Whitecaps in 2002 when he said the club was deeply in debt and had no clear future.The current ownership group formed in 2008. "
    },
    {
        "Title": "ANALYSIS: Jets experience thrill of victory, agony of defeat",
        "Date": "Posted December 13, 2024 11:24 am",
        "Text": "View image in full screenWhen I was a kid, a long, long time ago, every Saturday there was a sports anthology show, The Wide World of Sports, on television. I marveled every week when the great Jim McKay talked about “the thrill of victory and the agony of defeat”.And in a 72-hour period, the Jets and their fans experienced just that… the best and worst of what the NHL offers.  Story continues below advertisement Losing is never fun. It’s not supposed to be. Winning, on the other hand, can be thrilling. Every time.The thrill of that 8-1 victory against Boston on Tuesday was exactly what the Jets needed to get some level confidence back. And Thursday night, after 58 minutes of fun, edge-of-your-seat stuff… the Jets found themselves a miserable way to lose to Vegas. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.Silly mistakes, silly penalties erased a quality effort from the home team.But as well as it appeared the Jets played Thursday night, never did you think the game was in control. Unlike Tuesday, when Winnipeg took control of the game versus Boston, and filled the net at will, the Jets were truly embroiled in a heavyweight battle against Vegas.You could feel the intensity grow throughout the game — a style of hockey that fits the personality of the Golden Knights. A style of hockey that the Jets can learn from. In fact, I would suggest, that Scott Arniel’s team learned much, much more from the overtime loss than they did from the seven-goal victory.  Story continues below advertisement What’s the old saying? “No pain, no gain”There is little doubt that the Jets can play with the big boys — Vegas, Dallas, Edmonton — but playing at an elite level comes with pain. Agonizing pain. And it comes by being consistent and relentless and playing every minute of every game. 3:04John Shannon on the Jets: Dec 11 Related NewsANALYSIS: Jets’ top line leads outburst of scoring in blowout win\t\t\t\t\tANALYSIS: Jets’ Haydn Fleury plays unexpectedly important role\t\t\t\t\tANALYSIS: Winnipeg Jets back on track after overtime heroics from key players\t\t\t\t\tANALYSIS: Addition of Brad Lambert a glimpse into Jets’ future?\t\t\t\t\tANALYSIS: Jets have opportunity to regain consistency with home stretch\t\t\t\t\t"
    },
    {
        "Title": "Flames prospect Zayne Parekh looking to keep world junior dream alive",
        "Date": "Posted December 13, 2024 10:21 am",
        "Text": "Zayne Parekh lived a strange week earlier this month.The Calgary Flames prospect was crushed after being left off Canada’s list of selection camp hopefuls for the upcoming world junior hockey championship.A chance to pull on the red Maple Leaf was a dream. At age 18, there would still be next year. Not seeing his name alongside the rest of the country’s marquee under-20 talent still stung.Some five days later, however, the defenceman from Nobleton, Ont., selected ninth overall at June’s NHL draft, was making travel plans for the nation’s capital — handed an unexpected lifeline that kept his tournament quest alive.“A lot of motivation came from finding out that I wasn’t on the team,” said Parekh, who replaced the injured Harrison Brunicke last Friday. “A bit devastated because every kid wants to represent their country on the highest stage.  Story continues below advertisement “Glad I got a second opportunity.” Tweet ThisClick to share quote on Twitter: \"Glad I got a second opportunity.\"Oshawa Generals winger Beckett Sennecke, meanwhile, waited until Monday for his tap on the shoulder with Easton Cowan being held out of action this week as a precaution. The No. 3 pick in 2024 wants to do everything he can to ensure it doesn’t get slammed shut a second time.“It’s tough to not see your (name) on there,” said 18-year-old, who like Parekh has another year of world junior eligibility. “Getting the call a couple days later was extremely exciting.“I have certain qualities that they like. I’m trying to display those.”Parekh and Sennecke were last to enter the building. That doesn’t mean they’ll be the first two out.“You’ve got to cut the number off at some point,” said Hockey Canada’s Peter Anholt, who heads the organization’s under-20 program. “They’re here now to show us what they can do and see if they can cut out a niche.”  Story continues below advertisement Parekh and Sennecke took part in Thursday’s exhibition game against a team of university all-stars at TD Place that saw Canada register a 5-2 victory. Sennecke picked up two assists. Get breaking National newsFor news impacting Canada and around the world, sign up for breaking news alerts delivered directly to you when they happen.Sign up for breaking National newsletterSign UpBy providing your email address, you have read and agree to Global News' Terms and Conditions and Privacy Policy.The Canadians face the U Sports squad again Friday before the national program’s brain trust trims its roster.Parekh had an admittedly slow start to his Ontario Hockey League campaign with the Saginaw Spirit after winning last season’s Memorial Cup, going through the draft process and taking part in Calgary’s training camp. More on SportsMore videosRaptors sign Lawson to two-way contract\t\t\t\t\tJa’Kobe Walter proves to be NBA ready for Raptors\t\t\t\t\tFIFA World Cup: 3 nations to host in 2030, Saudi Arabia in 2034\t\t\t\t\tRaptors need someone to step up with Barnes out\t\t\t\t\tCall of the Wilde: Habs crushed by PensCountdown to winter Invictus Games as new details releasedRapid Fire with the Rush: Levi AndersonUSask Huskies forward Liam Keeler to represent Canada at 2025 World Winter University Games“They know I’m capable of playing with the puck,” the six-foot, 180-pound defender with 34 points across 25 games said of Canada’s management group.“You’ve got to step on the ice with a purpose and compete as hard as you can. I’m going to try and leave a good impression on all the staff.”Sennecke is in a similar boat.The six-foot-four, 195-pound forward needs to show he can play a 200-foot game to have a chance of sticking with Canada — a powerhouse aiming to rebound off a disastrous fifth-place finish 12 months ago in Sweden — for the annual showcase set to open Dec. 26 in Ottawa.“Size, speed, direct game, a heavy game,” Sennecke said of his attributes. “Going to continue to do what I do.”  Story continues below advertisement The Toronto native has 44 points in 26 contests with Oshawa, including six goals and eight assists in three appearances after initially being told he hadn’t been invited to try out at TD Place.“Hockey gods kind of rewarding me,” he said with a smile. “A couple good games where everything went in.” Trending NowCanada Post strike: Ontario utilities warn of penalties as millions await billsHow the Ford government in Ontario plans to escalate trade war with the U.S.After bitter disappointment followed by excitement, both Parekh and Sennecke still cling to a world junior dream.“You watch it every Christmas,” Sennecke said. “The staple of a Canadian hockey family.”“It definitely got taken away from me,” Parekh added. “But I’m grateful to be here … I have a pretty good feeling.”NHL pedigreeCanada doesn’t expect any of its three eligible NHLers — Chicago’s Connor Bedard, San Jose’s Macklin Celebrini or Buffalo’s Zach Benson — to be made available for the tournament, but there will still pro experience in the fold. 2:18NHL draft lottery: Chicago Blackhawks win Connor Bedard sweepstakesOshawa centre Calum Ritchie played seven games with Colorado in the fall, while Guelph Storm counterpart Jett Luchanko suited up four times with Philadelphia.  Story continues below advertisement Carolina prospect Bradly Nadeau has already been confirmed on Canada’s final roster — he will join up following selection camp — after playing once in the NHL last season before suiting up for the American Hockey League’s Chicago Wolves in 2024-25.Second chanceTanner Molendyk made Canada’s roster last year only to break his wrist in pre-tournament play.The Nashville Predators defence prospect is back with unfinished business.“I flew home Christmas Eve and then watched Boxing Day,” said Molendyk, who figures to have a big role this time around. “It was tough, didn’t get the results they wanted. Hopefully this year we can change that around and flip the script.” 2:06Saskatoon Blades star defender Molendyk heading to second straight World Junior selection camp "
    }
]